10 REM ｺﾀﾞｲｼ ﾉ ﾛﾏﾝ ｢ｲﾛﾊ ｳﾀ ﾉ ﾅｿﾞ｣  Author  CHIAKI. KASAHARA
20 CLR:CONSOLE C80,S0,24 :TEMPO 6
30 PRINT"ⓒ":DIM U$(50)
40 PRINT"下下下右右右右右右右右右右右右右右右右右右右右ｼﾊﾞｼ ｵﾏﾁｱﾚ !"
50 M$="G7G5AEEDEGGGAE8R4G7G5AEEDCDDDEC8R4A7A5+C+D+D+D+CAAAGA8R4+C7+C5+DAAGEDDEDC8R4"
60 FORI=1TO50:FORJ=1TO32
70 READ X:U$(I)=U$(I)+CHR$(X)
80 NEXT J,I
90 GOTO 760
100 REM ｲﾛﾊ
110 DATA 96,96,96,96,96,96,96,96,96,96,96,50,28,8,0,0,0,0,0,0,0,48,24,12,6,6,6,6,6,6,4,8
120 DATA 127,0,0,1,3,6,15,24,0,0,0,64,32,16,15,0,240,96,192,128,0,0,248,12,6,6,6,6,6,12,248,0
130 DATA 0,96,96,96,111,96,96,96,96,103,108,108,108,108,39,16,48,48,48,48,254,48,48,48,48,240,48,56,52,50,192,0
140 DATA 96,96,96,99,100,96,96,96,96,96,96,96,100,34,17,0,0,0,0,254,0,0,0,0,0,0,0,0,0,0,254,0
150 DATA 7,96,96,96,111,96,96,96,96,103,108,108,108,108,39,16,254,48,48,48,254,48,48,48,48,240,48,56,52,50,192,0
160 DATA 0,0,0,0,8,28,38,67,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,128,192,96,48,24,12,6,0
170 DATA 0,64,32,16,8,5,3,6,12,24,24,24,24,12,7,0,12,24,48,96,192,128,0,0,0,0,0,0,0,0,254,0
180 DATA 6,6,6,6,127,6,6,6,7,0,0,0,0,8,7,0,0,0,0,0,254,0,0,0,248,4,6,6,6,6,252,0
190 DATA 0,12,12,12,12,12,12,12,4,2,0,0,0,0,0,0,12,12,12,12,12,12,12,12,12,12,12,24,48,96,192,0
200 DATA 0,0,64,32,31,40,100,98,97,99,102,108,56,16,0,0,0,0,6,12,248,56,108,204,140,12,60,76,74,48,0,0
210 DATA 127,0,0,0,1,3,7,12,0,0,7,12,12,12,7,0,248,48,96,192,128,0,248,12,6,6,134,70,70,76,248,0
220 DATA 6,6,127,6,6,7,0,0,0,1,2,4,12,12,7,0,0,0,248,0,8,240,48,112,176,48,48,48,0,0,254,0
230 DATA 1,1,1,1,125,5,11,21,41,81,97,65,1,1,1,0,128,128,128,128,128,128,252,134,134,134,134,134,134,132,136,0
240 DATA 12,12,12,12,127,12,12,12,12,12,12,12,12,8,16,0,32,16,8,4,226,48,24,24,24,24,24,24,24,16,32,0
250 DATA 0,0,0,0,0,0,0,0,31,48,96,96,96,48,31,0,192,192,192,254,192,192,192,192,224,208,200,196,192,128,0,0
260 DATA 24,24,24,127,24,24,24,25,24,24,24,24,24,25,24,0,0,0,0,248,0,0,254,0,0,0,0,0,0,0,254,0
270 DATA 1,1,1,1,125,5,11,21,41,81,97,65,1,1,1,0,128,128,128,252,140,140,140,140,140,140,140,140,140,140,132,2
280 DATA 64,32,16,8,5,3,6,127,0,0,0,1,3,3,1,0,24,48,96,192,128,0,0,252,48,96,192,128,0,0,254,0
290 DATA 0,0,0,0,0,127,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,248,12,6,6,6,6,6,6,12,248,0
300 DATA 1,1,1,1,125,5,11,21,41,81,97,65,1,1,1,0,128,128,128,128,128,128,248,132,134,134,134,158,166,166,156,0
310 DATA 24,24,127,24,24,24,24,24,24,0,3,6,6,6,3,0,0,0,224,0,0,254,24,24,24,24,248,28,26,24,240,0
320 DATA 4,2,1,24,24,24,24,24,31,0,0,0,8,4,3,0,0,0,0,128,64,0,0,0,248,12,6,6,6,12,248,0
330 DATA 1,1,63,1,1,29,51,49,49,49,51,29,1,1,0,0,128,128,254,128,128,128,144,136,132,130,128,128,130,130,252,0
340 DATA 4,2,1,0,0,31,0,0,0,0,0,0,0,0,1,1,0,0,0,128,0,248,12,12,12,12,24,48,96,192,128,0
350 DATA 31,0,0,0,0,0,31,35,70,76,88,49,3,3,1,0,254,12,24,48,96,192,248,4,6,6,6,230,22,20,248,0
360 DATA 0,0,0,15,24,48,96,96,97,99,102,60,24,0,0,0,0,0,0,240,24,52,102,198,134,6,6,6,4,8,16,0
370 DATA 1,1,1,1,127,1,1,1,31,33,97,97,97,97,62,0,128,128,128,128,252,128,128,136,228,178,152,140,140,12,12,16
380 DATA 0,1,3,6,12,24,48,96,48,24,12,6,3,1,0,0,192,128,0,0,0,0,0,0,0,0,0,0,0,128,192,96
390 DATA 0,0,0,96,48,24,127,6,3,1,0,0,0,0,0,0,0,0,64,32,16,0,252,6,6,134,196,96,48,24,12,6
400 DATA 0,0,63,0,0,127,0,0,0,63,96,96,96,96,63,0,192,192,252,192,192,254,192,192,192,192,192,224,208,200,128,0
410 DATA 0,96,96,96,103,96,96,96,96,96,96,96,32,16,0,1,96,96,96,96,254,96,96,96,96,96,96,96,96,96,128,0
420 DATA 1,0,12,12,12,12,12,15,0,0,64,34,20,8,1,0,0,128,64,32,0,0,0,224,48,48,56,52,50,48,224,0
430 DATA 0,127,0,0,0,0,0,0,0,0,32,32,16,8,7,0,0,224,16,8,16,32,64,0,0,0,0,0,0,2,252,0
440 DATA 15,0,127,0,0,0,1,3,6,12,24,48,96,96,96,0,192,0,248,48,96,192,128,224,48,48,48,48,48,48,30,0
450 DATA 127,0,0,0,1,3,6,12,24,24,24,24,24,12,7,0,248,48,96,192,128,0,0,0,0,0,0,0,0,0,254,0
460 DATA 1,1,1,1,127,1,1,15,17,49,49,48,48,48,31,0,128,128,128,128,254,128,128,242,156,140,150,166,70,166,4,8
470 DATA 6,3,1,0,127,0,0,0,15,24,24,24,24,24,15,0,0,0,128,192,254,48,24,12,254,0,0,0,0,0,248,0
480 DATA 6,3,63,0,0,127,0,0,15,24,24,24,24,24,15,0,0,0,240,192,96,252,24,12,254,0,0,0,0,0,248,0
490 DATA 0,0,0,0,96,96,103,104,112,32,0,2,1,0,0,1,96,96,96,96,96,96,252,102,102,102,102,102,252,96,128,0
500 DATA 0,0,64,32,31,40,100,98,97,99,102,108,56,16,0,0,0,0,6,12,248,60,102,198,134,134,70,6,6,6,4,8
510 DATA 15,0,0,0,0,0,1,63,70,76,88,112,32,0,0,0,254,12,24,48,96,204,140,254,12,12,12,12,12,8,16,0
520 DATA 12,12,12,12,12,12,12,12,12,12,12,12,12,12,7,0,0,0,0,0,0,0,0,0,0,0,4,4,4,8,240,0
530 DATA 15,0,1,3,6,0,1,1,1,0,4,13,24,48,96,0,224,192,128,252,6,198,38,38,38,252,0,16,136,68,34,0
540 DATA 127,1,3,6,12,24,48,96,96,96,96,96,48,24,15,0,192,128,0,0,0,0,0,0,8,12,22,34,64,128,0,0
550 DATA 3,3,127,3,3,127,3,3,3,3,3,3,3,3,1,0,0,0,252,0,0,252,0,0,0,0,0,2,2,2,252,0
560 DATA 24,24,24,24,24,127,24,24,24,24,24,24,24,24,15,0,0,24,24,24,24,254,24,24,24,24,24,0,0,0,252,0
570 DATA 0,0,0,0,127,0,0,30,49,48,49,30,0,0,0,1,192,192,192,192,254,192,192,192,192,192,192,192,192,192,128,0
580 DATA 0,0,0,0,0,1,3,6,13,26,52,104,80,96,64,0,12,24,48,96,192,128,0,0,224,48,48,48,48,48,30,0
590 DATA 255,0,126,66,66,126,0,255,0,126,66,66,126,0,0,15,200,136,136,136,159,165,133,196,132,132,132,132,136,148,162,193
600 DATA 32,34,34,250,0,119,2,116,2,250,138,138,138,139,138,252,73,73,73,73,42,8,255,28,42,73,73,73,73,8,128,127
610 REM ﾍﾟ-ｼﾞ ｼｮﾘ
620 GRAPH I1,C,I2,C:PRINT"ⓒ"
630 GRAPH I1,O12
640 LINE0,0,319,0,319,199,0,199,0,0
650 FORI=1TO10:MUSIC"E0F0":NEXT
660 RETURN
670 PRINT"下右右Push [CR]"
680 GET K$:IF K$<>CHR$(13) THEN 680
690 PRINT"ⓒ"
700 IF VAL(TI$)<10000 THEN RETURN
710 PRINT"下下右右右右ｻﾞﾝﾈﾝﾅｶﾞﾗ TIME LIMIT ﾆ ﾅｯﾃｼﾏｲﾏｼﾀ｡"
720 PRINT"下右右右右ﾓｳｲﾁﾄﾞ TRY ｽﾙﾅﾗ GOTO760 ﾄ ｼﾃｸﾀﾞｻｲ｡"
730 END
740 PRINT"右ｺﾀｴ ﾊ ﾏﾁｶﾞｲﾃﾞｽ｡ ﾓｳｲﾁﾄﾞ ﾖｸ ｶﾝｶﾞｴﾃ｡"
750 PRINT:RETURN
760 REM TITLE
770 GOSUB 610:GRAPH I2
780 POSITION70,68:PATTERN-16,U$(1)
790 POSITION100,68:PATTERN-16,U$(2)
800 POSITION130,68:PATTERN-16,U$(3)
810 POSITION160,68:PATTERN-16,U$(49)
820 POSITION190,68:PATTERN-16,U$(26)
830 POSITION220,68:PATTERN-16,U$(50)
840 POSITION160,8:PATTERN-16,U$(1)
850 POSITION160,28:PATTERN-16,U$(2)
860 POSITION160,48:PATTERN-16,U$(3)
870 POSITION160,88:PATTERN-16,U$(26)
880 POSITION160,108:PATTERN-16,U$(50)
890 CURSOR 50,14:PRINT"Author  CHIAKI. KASAHARA"
900 GOTO 1120
910 GRAPH I1
920 LINE40,110,55,100,75,110,75,113,40,113,40,110,36,93,40,90,43,108
930 LINE75,113,75,140,65,145,50,140
940 LINE45,113,45,125,40,122,37,130,42,133
950 LINE55,120,60,120:LINE70,120,75,120:LINE68,125,68,135
960 LINE57,125,60,125:LINE72,125,75,125:LINE63,138,70,138
970 LINE60,141,67,160,73,141:LINE65,141,67,159,69,141
980 LINE73,144,90,152,95,198:LINE90,155,100,160,120,198
990 LINE72,198,72,165,82,165,82,198
1000 FORI=0TO9:LINE72+I,165,72+I,198:NEXT
1010 LINE40,135,40,140,50,150,63,150,68,198
1020 LINE40,140,20,150,30,198:LINE20,155,1,165
1030 LINE40,122,40,110,30,108,20,150
1040 LINE40,107,25,105,10,160
1050 FORI=0TO18STEP3:FORJ=1TO110STEP5:SET J,180+I
1060 NEXT J,I
1070 FORI=1TO2:FORJ=0TO2*π STEP.3
1080 SET 4*COS(J)+40*I,4*SIN(J)+155
1090 SET 6*COS(J)+40*I,6*SIN(J)+155
1100 NEXT J,I
1110 RETURN
1120 GOSUB 910:MUSIC M$
1130 PRINT"ⓒ": GRAPH I2,C
1140 FORI=1 TO7 :POSITION20*(I-1)+160,60:PATTERN-16,U$(I):NEXT
1150 FORI=8 TO14:POSITION20*(I-8)+160,80:PATTERN-16,U$(I):NEXT
1160 FORI=15TO21:POSITION20*(I-15)+160,100:PATTERN-16,U$(I):NEXT
1170 FORI=22TO28:POSITION20*(I-22)+160,120:PATTERN-16,U$(I):NEXT
1180 FORI=29TO35:POSITION20*(I-29)+160,140:PATTERN-16,U$(I):NEXT
1190 FORI=36TO42:POSITION20*(I-36)+160,160:PATTERN-16,U$(I):NEXT
1200 FORI=43TO47:POSITION20*(I-43)+160,180:PATTERN-16,U$(I):NEXT
1210 TI$="000000"
1220 PRINT"右右右右右右右右右右右右右右右右右右右右< ｶｲｾﾂ >"
1230 PRINT"右ﾆﾎﾝｼﾞﾝ ﾅﾗ ｢ｲﾛﾊ ｳﾀ｣ ｦ ｼﾗﾅｲﾓﾉﾊ ｵｿﾗｸ ｲﾅｲ ﾀﾞﾛｳ｡"
1240 PRINT"右ﾀﾞｶﾞ ｷﾐﾊ,｢ｲﾛﾊ ｳﾀ｣ ﾆ ﾏﾂﾜﾙ ｵﾄﾞﾛｸﾍﾞｷ ﾅｿﾞ ﾆ ﾂｲﾃ ｼｯﾃｲﾙ ﾀﾞﾛｳｶ ?"
1250 PRINT"右ｺﾉ ｳﾀ ｶﾞ ｲﾂ ﾀﾞﾚﾆ ﾖｯﾃ ﾂｸﾗﾚﾀ ﾉｶ ｾｲｶｸ ﾆﾊ ﾜｶｯﾃ ｲﾅｲ｡"
1260 PRINT"右ｼｶﾓ 7,5 ﾁｮｳ 4ｸ ﾉ ﾜｶ ﾃﾞｱﾙﾉﾆ,ｼﾀ ﾉ ﾖｳﾆ 7ｷﾞｮｳ 7ﾚﾂ ﾆ ｶｷｼﾙｻﾚﾙ ｺﾄｶﾞ ｵｵｲ｡"
1270 PRINT"右ｺﾉﾅｶﾆ ｵｿﾙﾍﾞｷ ｱﾝｺﾞｳ ｶﾞ ｼｸﾏﾚﾃ ｲﾙﾉﾃﾞ ｱﾙ｡"
1280 GOSUB 670:GRAPH I2,C
1290 POSITION160,100:PATTERN-16,U$(14),-16,U$(22),-16,U$(33),-16,U$(2),-16,U$(45)
1300 POSITION160,120:PATTERN-16,U$(38),-16,U$(19),-16,U$(19),-16,U$(21),-16,U$(17),-16,U$(4),-16,U$(42)
1310 POSITION160,140:PATTERN-16,U$(19),-16,U$(30),-16,U$(42),-16,U$(36),-16,U$(17),-16,U$(3)
1320 POSITION160,160:PATTERN-16,U$(3),-16,U$(11),-16,U$(3),-16,U$(11),-16,U$(38),-16,U$(10),-16,U$(11)
1330 POSITION160,180:PATTERN-16,U$(16),-16,U$(44),-16,U$(12),-16,U$(42),-16,U$(18),-16,U$(27),-16,U$(45),-16,U$(32)
1340 PRINT"右ｺﾀﾞｲｼﾞﾝ ﾊ ｳﾀ ｿﾉﾓﾉ ｦ ｼﾞｮｳﾎｳ ﾃﾞﾝﾀﾂ ﾉ ｼｭﾀﾞﾝ ﾆ ﾓﾁｲﾀ｡"
1350 PRINT"右ｼﾀｶﾞｯﾃ ﾄｸﾃｲ ﾉ ﾋﾄ ﾆ ﾀﾞｹ ﾜｶﾙ ｱﾝｺﾞｳ ｦ ｳﾀ ﾉ ﾅｶﾆ ﾖﾐｺﾑｺﾄﾓ ｱｯﾀ｡"
1360 PRINT"右ｼﾀﾆ ｱｹﾞﾀﾉﾊ ｢ｲｾ ﾓﾉｶﾞﾀﾘ｣ ﾆ ﾃﾞﾃｸﾙ ｱﾘﾊﾗ ﾉ ﾅﾘﾋﾗ ﾉ ｳﾀ ﾃﾞｱﾙ｡"
1370 PRINT"下右ｼﾂﾓﾝ: ｺﾉ ﾅｶﾆ ｶｸｻﾚﾀ ﾊﾅ ﾉ ﾅﾏｴ ｦ ｶﾀｶﾅ 5ﾓｼﾞ ﾃﾞ ｺﾀｴﾖ｡"
1380 PRINT"右右ﾋﾝﾄ: ｸ ﾉ ﾊｼﾞﾒ ﾉ ﾓｼﾞ ｦ ﾋﾛｳ (ｺﾚｦ ｵﾘｸ ﾄ ｲｳ)｡"
1390 PRINT"右右右右右右右ﾃｷﾄｳ ﾆ ﾀﾞｸﾃﾝ(ﾞ) ｦ ｵｷﾞﾅｯﾃ ｶｲｼｬｸ ｾﾖ｡"
1400 PRINT"右";CHR$(12);:INPUT K$
1410 PRINT"ⓒ"
1420 Q$=CHR$(182)+CHR$(183)+CHR$(194)+CHR$(202)+CHR$(192)
1430 IF K$=Q$ THEN 1450
1440 GOSUB 740:GOTO 1370
1450 PRINT"右ｺｳｼﾀ ﾅｿﾞ ｦ ﾄｷｱｶｼﾃ ﾕｸｳﾁﾆ,ｷﾐﾊ ﾔｶﾞﾃ ﾆﾎﾝ ﾉ ｺﾀﾞｲｼ ﾉ ﾌﾞﾀｲ ﾆ ﾋｷｺﾏﾚﾃ ﾕｸﾀﾞﾛｳ｡"
1460 PRINT"右ﾓﾉ ｶﾞﾀﾘ ﾉ ｼﾝｺｳ ﾄﾄﾓﾆ ｼﾂﾓﾝ ﾔ ﾅｿﾞﾅｿﾞ ｶﾞ ｱﾗﾜﾚﾙ｡"
1470 PRINT"右ｷﾐﾊ ｺﾚﾗﾆ ﾀｲｼﾃ ｾｲｶｸ ﾆ ｺﾀｴ ﾅｹﾚﾊﾞ ﾅﾗﾅｲ｡ ｺﾀｴ ｶﾞ ﾁｶﾞｳﾄ ﾂｷﾞﾆ ｽｽﾒﾅｲ ｺﾄﾆﾅﾙ｡"
1480 PRINT"右ｺﾄﾊﾞ ﾉ ﾅｿﾞ ﾊ,ｵｵｸ ｺﾃﾝﾌﾞﾝｶﾞｸ ﾅﾄﾞ ｦ ﾖﾘﾄﾞｺﾛ ﾄ ｼﾃｲﾙ｡"
1490 PRINT"右ｺﾀｴ ｶﾞ ﾜｶﾗﾅｲ ﾄｷﾊ ｺﾃﾝ ｦ ｲﾛｲﾛﾄ ﾋﾓﾄｲﾃ ﾐﾙﾉｶﾞ ﾖｲﾀﾞﾛｳ｡"
1500 PRINT"右ﾀﾀﾞｼ 1ｼﾞｶﾝ ｲｼﾞﾖｳ ｹｲｶ ｽﾙﾄ TIME LIMIT ﾃﾞ ｵｼﾏｲ ﾆ ﾅｯﾃ ｼﾏｳ｡"
1510 PRINT"右ｻｱ,ｷﾐｦ ﾌｼｷﾞﾅ ｺﾀﾞｲｼ ﾉ ﾀﾞﾋﾞ ﾆ ｼｮｳﾀｲ ｼｮｳ｡"
1520 GOSUB 670:GOTO 1650
1530 REM P-1
1540 GOSUB 610
1550 LINE1,130,50,130,43,138,45,135,15,135,15,160,10,157,7,167,13,170
1560 LINE41,135,41,155,50,165,41,170,41,185,38,187,20,187,15,195
1570 LINE25,143,40,145:LINE30,175,40,175:LINE1,182,17,198
1580 LINE39,151,32,153,39,154,39,151:LINE7,167,1,173
1590 GRAPH I2: LINE80,198,70,178,90,140,100,160,80,198
1600 LINE80,198,55,188,70,145,83,155
1610 POSITION120,120:PATTERN-16,U$(19),-16,U$(3),-16,U$(38)
1620 POSITION120,140:PATTERN-16,U$(3),-16,U$(27),-16,U$(8),-16,U$(35)
1630 POSITION120,160:PATTERN-16,U$(19),-16,U$(39),-16,U$(7),-16,U$(21),-16,U$(11)
1640 RETURN
1650 GOSUB 1530
1660 PRINT"右ｷﾐﾊ ﾑﾒｲ ﾉ ﾙﾎﾟﾗｲﾀ- ﾃﾞｱﾙ｡ K ﾄｲｳ ﾖﾋﾞﾅ ｦ ﾓﾁｲﾙ ｺﾄﾆ ｼﾖｳ｡"
1670 PRINT"右ｱﾙﾋ F ｷｮｳｼﾞｭ ﾄ ｲｳ ｺｸﾌﾞﾝｶﾞｸｼｬ ﾆ ｾﾞﾋ ﾀｽﾞﾈﾀｲ ｺﾄｶﾞｱｯﾃ ﾒﾝｶｲ ｦ ﾓｳｼﾃﾞﾀ｡"
1680 PRINT"右ｽﾙﾄ ｷﾑｽﾞｶｼｲ F ｷｮｳｼﾞｭ ﾊ ﾂｷﾞ ﾉ ﾖｳﾅ ﾐｼﾞｶｲ ﾃﾞﾝｺﾞﾝ ｦ ﾖｺｼﾀ｡"
1690 PRINT"右ﾌﾞﾝﾒﾝ ﾊ ｢ﾂﾊﾞｷ ﾉ ﾊ ｶﾞ ｵﾁﾃ ﾂﾕ ﾄ ﾅﾙ｣ ﾄ ｲｳ ｲﾐ ﾉﾖｳﾀﾞｶﾞ,ﾌﾞﾝｶﾞｸｼｬ ﾗｼｸ"
1700 PRINT"右ｲｯｼｭ ﾉ ﾅｿﾞﾅｿﾞ ﾆ ﾅｯﾃｲﾃ,ｺﾉ ﾊﾟｽﾜ-ﾄﾞ ｶﾞ ﾄｹﾅｹﾚﾊﾞ ﾒﾝｶｲ ﾃﾞｷﾅｲ ﾄ ｲｳ｡"
1710 PRINT"下右ｼﾂﾓﾝ: ｺﾉ ﾅｿﾞﾅｿﾞ ｦ ﾄｲﾃ ﾊﾟｽﾜ-ﾄﾞ ｦ ｺﾀｴﾖ｡"
1720 PRINT"右";CHR$(12);:INPUT K$
1730 PRINT"ⓒ"
1740 Q$=CHR$(213)+CHR$(183)
1750 IF K$=Q$ THEN 1780
1760 GOSUB 740
1770 GOTO 1710
1780 REM P-2
1790 GRAPH I2,C,I1
1800 FORJ=0TO2*π STEP.1
1810 SET 23*COS(J)+260,25*SIN(J)+140
1820 SET 6*COS(J)+243,6*SIN(J)+145
1830 SET 6*COS(J)+257,6*SIN(J)+145
1840 NEXT
1850 LINE263,145,273,145,277,143,280,148,275,152
1860 LINE281,135,273,135,270,138,270,145
1870 FORI=1TO3:LINE275,135+2*I,280,135+2*I:NEXT
1880 LINE249,148,248,158,253,158:LINE250,162,260,162,252,160,250,162
1890 SET 243,145:SET 257,145
1900 LINE247,160,230,170,210,198:LINE250,198,275,160,300,165,318,183:LINE247,160,260,180
1910 LINE282,162,260,198:LINE300,167,290,198
1920 LINE230,170,238,198
1930 PRINT"右F ｷｮｳｼﾞｭ ﾉ ﾔｼｷ ﾃﾞ ﾔｯﾄ ﾒﾝｶｲ ｶﾞ ｶﾅｯﾀ｡"
1940 PRINT"右ｼｮｻｲ ﾃﾞ ﾀｲﾒﾝ ｼﾀ ｷｮｳｼﾞｭ ﾊ ｺｶﾞﾗ ﾃﾞ ｱﾀﾏ ﾉ ﾊｹﾞﾀ ﾛｳｶﾞｸｼｬ ﾃﾞｱｯﾀ｡"
1950 PRINT"右ｺｸﾌﾞﾝｶﾞｸ ｦ ｾﾝｺｳ ｼ,ｺﾀﾞｲｼ ﾔ ｺﾀﾞｲｱﾝｺﾞｳｶﾞｸ ﾆ ｿﾞｳｹｲ ｶﾞ ﾌｶｲ｡"
1960 PRINT"下右K: ﾜﾀｼﾊ ﾙﾎﾟﾗｲﾀ- ﾉ K ﾄｲｳ ﾓﾉﾃﾞｽ｡"
1970 PRINT"右右右右ｻｯｿｸﾃﾞｽｶﾞ,ｷｮｳｼﾞｭ ﾆ ｱﾉ ｢ｲﾛﾊ ｳﾀ｣ ﾆ ﾏﾂﾜﾙ ﾌｼｷﾞﾅ ﾅｿﾞ ﾆ ﾂｲﾃ ｵｳｶｶﾞｲ ｼﾀｲﾉﾃﾞｽ｡"
1980 PRINT"右F: ﾚｷｼ ﾉ ｼﾘｮｳ ﾉ ﾅｶﾆﾊ,ｲﾏﾀﾞﾆ ﾄｷｱｶｻﾚﾅｲ ｵｵｸ ﾉ ﾅｿﾞ ｶﾞ ｳｽﾞﾓﾚﾃｲﾙ｡"
1990 PRINT"右右右右ｿﾚﾊ ﾊｶﾘｼﾚﾅｲ ﾚｷｼ ｼﾞｼﾞﾂ ｦ ﾜﾚﾜﾚ ﾆ ﾂﾀｴﾖｳ ﾄｼﾃ ｲﾙﾉｶﾓ ｼﾚﾇ｡ ﾀﾄｴﾊﾞ ﾄｷﾉ ｹﾝﾘｮｸｼｬｶﾞ"
2000 PRINT"右右右右ｺﾉﾏｼｸﾅｲ ｼﾞﾝﾌﾞﾂ ｦ ﾎｳﾑﾛｳ ﾄｽﾚﾊﾞ,ﾊﾝｺｳｼｬ ﾊ ｱﾝｺﾞｳ ｦ ﾓﾁｲﾃ ﾚｷｼ ﾉ ｼﾝｼﾞﾂ ｦ"
2010 PRINT"右右右右ﾄﾞｳﾆｶｼﾃ ｺｳｾｲ ﾆ ﾂﾀｴﾖｳﾄｼﾀ ｶﾗﾀﾞ｡"
2020 GOSUB 670:GRAPH I2
2030 POSITION100,120:PATTERN-16,U$(37),-16,U$(31),-16,U$(26),-16,U$(37),-16,U$(14),-16,U$(21)
2040 PRINT"右F: ｺﾀﾞｲ ﾉ ｱﾝｺﾞｳ ﾆﾊ ｼﾞﾂﾆ ｵｵｸﾉ ﾀｲﾌﾟ ｶﾞ ｱﾙ｡
2050 PRINT"右右右右ﾓｼﾞ ﾉ ｲｲｶｴ,ｼｮｳｷｮ,ｿｳﾆｭｳ,ﾃﾝﾄｳ,ｽｳｼﾞ ﾉ ｵｳﾖｳ,ｺﾚﾗ ｦ ｲｸﾂ ﾓ ｸﾐｱﾜｾﾀ ﾓﾉﾅﾄﾞ｡"
2060 PRINT"右右右右ﾂｷﾞﾆ ｱｹﾞﾀﾉﾊ,ﾓｯﾄﾓ ｶﾝﾀﾝﾅ 2ﾓｼﾞ ﾊﾝｵﾝ ﾉ ﾀｲﾌﾟ ﾀﾞ｡ ﾋﾄﾂ ｺﾚｦ ﾄｲﾃ ﾐﾀﾏｴ｡"
2070 PRINT"下右ｼﾂﾓﾝ: ｺﾉ ｱﾝｺﾞｳ ｦ ﾄｲﾃﾐﾖ｡ ";CHR$(12);:INPUT K$
2080 PRINT"ⓒ"
2090 Q$=CHR$(185)+CHR$(187)
2100 IF K$=Q$ THEN 2120
2110 GOSUB 740:GOTO 2070
2120 GRAPH I2,C
2130 PRINT"右F: ｻﾃ,ｹﾝｺｳﾎｳｼ ﾉ ｢ﾂﾚﾂﾞﾚｸﾞｻ｣ ﾆﾊ ｺﾗｲﾖﾘ ﾑｽﾞｶｼｲｺﾄ ﾃﾞ ﾕｳﾒｲﾅ ﾅｿﾞ ｶﾞ ﾃﾞﾃｸﾙ｡"
2140 PRINT"右右右右｢ﾑﾏﾉｷﾂ ﾘｬｳｷﾂﾆﾉｦｶ ﾅｶｸﾎﾞﾚｲﾘ ｸﾞﾚﾝﾄﾞｳ｣ ﾄｲｳﾓﾉﾀﾞｶﾞ,ﾀｲﾃｲ ﾉ ｺｸｺﾞｶﾞｸｼｬ ﾆﾓ"
2150 PRINT"右右右右ﾁﾝﾌﾟﾝｶﾝﾌﾟﾝ ﾉ ｼﾛﾓﾉﾀﾞ｡ ﾓｼﾞ ﾉ ｼｮｳｷｮ ﾄ ﾃﾝﾄｳ ﾉ ｸﾐｱﾜｾ ﾃﾞ ｺﾀｴ ｶﾞ ｲｸﾂｶ ｱﾙﾄ ｲﾜﾚﾙ｡"
2160 PRINT"右右右右ｷﾐﾆ ｷｮｳﾐ ｶﾞ ｱﾙﾅﾗ ｢ﾂﾚﾂﾞﾚｸﾞｻ｣ ｦ ﾖﾝﾃﾞ ﾁｮｳｾﾝ ｼﾃﾐﾙﾄ ﾖｲ｡"
2170 PRINT"右K: ﾃﾞﾊ ｱﾄﾃﾞ ｼﾞｯｸﾘ ｶﾝｶﾞｴﾃ ﾐﾏｽ｡ ｱﾝｺﾞｳ ﾉ ﾊﾅｼ ｦ ﾂﾂﾞｹﾃ ｸﾀﾞｻｲ｡"
2180 PRINT"右F: ｹﾝｺｳﾎｳｼ ﾆﾊ ﾏﾀ,ﾄﾝｱﾎｳｼ ﾄﾉ ｱｲﾀﾞ ﾃﾞ ﾔﾘﾄﾘｼﾀ ﾕｳﾒｲﾅ ｸﾂｶﾑﾘ ﾉ ｳﾀ ｶﾞ ｱﾙ｡"
2190 PRINT"右右右右ｸﾂｶﾑﾘ ﾄｲｳﾉﾊ,ｿﾚｿﾞﾚﾉ ｸ ﾉ ｱﾀﾏ ﾄ ｵﾜﾘ ﾆ ｱﾝｺﾞｳ ｦ ｸﾐｺﾑﾓﾉﾀﾞ｡"
2200 PRINT"下右ｼﾂﾓﾝ: ｹﾝｺｳﾎｳｼ ｶﾞ ｢ﾂﾚﾂﾞﾚｸﾞｻ｣ ｦ ｶｲﾀﾉﾊ ﾅﾆｼﾞﾀﾞｲ ｶ ｺﾀｴﾖ｡"
2210 PRINT"右";CHR$(12);:INPUT K$
2220 PRINT"ⓒ"
2230 Q$=CHR$(182)+CHR$(207)+CHR$(184)+CHR$(215)+CHR$(188)+CHR$(222)+CHR$(192)+CHR$(222)+CHR$(178)
2240 IF K$=Q$ THEN 2260
2250 GOSUB 740:GOTO 2200
2260 GRAPH I2
2270 POSITION80,80:PATTERN-16,U$(15),-16,U$(45),-16,U$(47),-16,U$(47),-16,U$(42)
2280 POSITION80,100:PATTERN-16,U$(20),-16,U$(37),-16,U$(40),-16,U$(26),-16,U$(14),-16,U$(9),-16,U$(5)
2290 POSITION80,120:PATTERN-16,U$(16),-16,U$(30),-16,U$(28),-16,U$(22),-16,U$(45)
2300 POSITION80,140:PATTERN-16,U$(30),-16,U$(18),-16,U$(35),-16,U$(45),-16,U$(36),-16,U$(38),-16,U$(4)
2310 POSITION80,160:PATTERN-16,U$(6),-16,U$(16),-16,U$(35),-16,U$(21),-16,U$(38),-16,U$(14),-16,U$(46)
2320 PRINT"右F: ｳﾜﾍﾞ ﾊ ﾌｳﾘｭｳﾅ ｳﾀ ﾆ ﾐｾｶｹﾃ,ﾚｯｷﾄｼﾀ ﾂｳｼﾝﾌﾞﾝ ﾆ ﾅｯﾃｲﾙ｡"
2330 PRINT"右右右右ｸﾂｶﾑﾘ ﾉ ｲﾐｶﾞ ﾜｶﾗﾅｲﾄ ｹﾝｺｳﾎｳｼ ﾉ ｾﾂｼﾞﾂ ﾅ ｷﾓﾁ ｶﾞ ﾖﾒﾅｸﾅｯﾃ ｼﾏｳﾉﾀﾞ｡"
2340 PRINT"下右ｼﾂﾓﾝ: ｺﾉ ｳﾀ ﾉ ｶﾑﾘ ﾄ ｸﾂ ｦ ﾅﾗﾍﾞﾃ ﾘｮｳﾎｳ ｺﾀｴﾖ｡"
2350 PRINT"右";CHR$(12);:INPUT K$
2360 PRINT"ⓒ"
2370 Q$=CHR$(214)+CHR$(200)+CHR$(192)+CHR$(207)+CHR$(205)+CHR$(190)+CHR$(198)+CHR$(211)+CHR$(206)+CHR$(188)
2380 IF K$=Q$ THEN 2400
2390 GOSUB 740:GOTO 2340
2400 GRAPH I2,C
2410 POSITION80,80:PATTERN-16,U$(15),-16,U$(11),-16,U$(45),-16,U$(24),-16,U$(42)
2420 POSITION80,100:PATTERN-16,U$(20),-16,U$(16),-16,U$(28),-16,U$(13),-16,U$(14),-16,U$(46),-16,U$(33)
2430 POSITION80,120:PATTERN-16,U$(3),-16,U$(35),-16,U$(3),-16,U$(33),-16,U$(47)
2440 POSITION80,140:PATTERN-16,U$(21),-16,U$(5),-16,U$(37),-16,U$(9),-16,U$(16),-16,U$(4)
2450 POSITION80,160:PATTERN-16,U$(42),-16,U$(3),-16,U$(42),-16,U$(7),-16,U$(44),-16,U$(30),-16,U$(46)
2460 PRINT"右F: ｹﾝｺｳﾎｳｼ ﾉ ｳﾀ ﾆ ﾀｲｼﾃ,ﾄﾝｱﾎｳｼ ﾊ ﾂｷﾞﾉﾖｳﾆ ｺﾀｴﾀ｡"
2470 PRINT"右右右右ﾔﾊﾘ ｸﾂｶﾑﾘ ﾉ ｳﾀ ﾆ ﾅｯﾃｲﾙ｡ ｲｯﾀｲ ﾅﾝﾄ ｲｯﾃ ｷﾀﾉｶ ?"
2480 PRINT"下右ｼﾂﾓﾝ: ｺﾉ ｳﾀ ﾉ ｶﾑﾘ ﾄ ｸﾂ ｦ ﾅﾗﾍﾞﾃ ﾘｮｳﾎｳ ｺﾀｴﾖ｡"
2490 PRINT"右";CHR$(12);:INPUT K$
2500 PRINT"ⓒ"
2510 Q$=CHR$(214)+CHR$(200)+CHR$(202)+CHR$(197)+CHR$(188)+CHR$(190)+CHR$(198)+CHR$(189)+CHR$(186)+CHR$(188)
2520 IF K$=Q$ THEN 2540
2530 GOSUB 740:GOTO 2480
2540 GRAPH I2,C
2550 FORI=1 TO7 :POSITION20*(I-1)+80,60:PATTERN-16,U$(I):NEXT
2560 FORI=8 TO14:POSITION20*(I-8)+80,80:PATTERN-16,U$(I):NEXT
2570 FORI=15TO21:POSITION20*(I-15)+80,100:PATTERN-16,U$(I):NEXT
2580 FORI=22TO28:POSITION20*(I-22)+80,120:PATTERN-16,U$(I):NEXT
2590 FORI=29TO35:POSITION20*(I-29)+80,140:PATTERN-16,U$(I):NEXT
2600 FORI=36TO42:POSITION20*(I-36)+80,160:PATTERN-16,U$(I):NEXT
2610 FORI=43TO47:POSITION20*(I-43)+80,180:PATTERN-16,U$(I):NEXT
2620 REM P-3
2630 PRINT"右F: ｺﾀﾞｲ ﾉ ｱﾝｺﾞｳ ｶﾞ ｲｶﾅﾙﾓﾉ ﾃﾞｱﾙｶ,ｷﾐﾆﾓ ｵｵﾖｿ ﾉﾐｺﾒﾀ ｺﾄﾀﾞﾛｳ｡"
2640 PRINT"右右右右ｻﾃ ｿｺﾃﾞ,ｷﾐ ｶﾞ ﾀｽﾞﾈﾙ ｢ｲﾛﾊ ｳﾀ｣ ﾉ ﾅｿﾞ ﾆ ﾁｭｳﾓｸ ｼﾃﾐﾖｳ｡"
2650 PRINT"右右右右ｺﾉ ｳﾀ ﾊ 7,5 ﾁｮｳ ｶﾞ 4ｶｲ ｸﾘｶｴｻﾚ,ｿﾉﾏﾏﾃﾞﾊ ｸﾂｶﾑﾘ ﾆ ﾅﾝﾉ ｲﾐﾓﾅｲ｡ ﾀﾒｼﾆ ﾄﾅｴﾃﾐﾖ｡"
2660 PRINT"右K: ｶﾑﾘ ﾊ ｢ｲﾁﾜﾂｳｹｱｴ｣,ｸﾂ ﾊ ｢ﾄｦｿﾑﾏﾃｼｽ｣ ﾃﾞｽ｡ ﾀｼｶﾆ ﾑｲﾐ ﾃﾞｽﾈ｡"
2670 PRINT"右F: ﾃﾞﾊ ﾂｷﾞﾉﾖｳﾆ 7ｷﾞｮｳ 7ﾚﾂ ﾆ ｼﾀﾊﾞｱｲ ﾊ ﾄﾞｳｶﾅ ?"
2680 PRINT"右K: ｶﾑﾘ ﾊ ｢ｲﾁﾖﾗﾔｱｴ｣,ｸﾂ ﾊ ....."
2690 PRINT"下右ｼﾂﾓﾝ: ｸﾂ ｦ ｺﾀｴﾖ｡"
2700 PRINT"右";CHR$(12);:INPUT K$
2710 PRINT"ⓒ"
2720 Q$=CHR$(196)+CHR$(182)+CHR$(197)+CHR$(184)+CHR$(195)+CHR$(188)+CHR$(189)
2730 IF K$=Q$ THEN 2750
2740 GOSUB 740:GOTO 2690
2750 PRINT"右F: ｿｳ ｢";Q$;"｣ ｽﾅﾜﾁ,ﾅﾝﾉ ﾂﾐﾓ ﾅｼﾆ ｼﾝﾀﾞ,ｱﾙｲﾊ ｺﾛｻﾚﾀ ﾄｲｳ ｲﾐ ﾆﾅﾙ｡"
2760 PRINT"右K: ｼﾞﾂﾆ ｵｿﾛｼｲ ｱﾝｺﾞｳ ﾃﾞｽﾈ｡ ﾔﾊﾘ ﾄｷ ﾉ ｹﾝﾘｮｸｼｬ ﾆ ﾊﾝｺｳ ｼﾃ ｺﾛｻﾚﾀ ｼﾞﾝﾌﾞﾂ ｶﾞ"
2770 PRINT"右右右右ｺﾉ ｳﾀ ﾉ ﾅｶﾃﾞ ﾑｼﾞﾂ ｦ ｳｯﾀｴﾖｳ ﾄｼﾀﾓﾉ ﾃﾞｼｮｳｶ｡"
2780 PRINT"右F: ｺﾉ ﾓｼﾞ ﾉ ﾊｲﾚﾂ ｶﾞ ｸﾞｳｾﾞﾝ ﾃﾞﾊﾅｸ ｲﾄﾃｷ ﾃﾞｱﾙﾅﾗ,ｳﾀ ﾉ ｻｸｼｬ ﾊ ﾋｹﾞｷ ﾉ ｶｼﾞﾝ ﾃﾞｱﾙ｡"
2790 PRINT"右右右右ｼｶﾓ,ｲﾛﾊ ｳﾀ ﾉ ｶﾝｾｲﾄﾞ ｶﾗ ﾐﾃ,ｽｻﾏｼﾞｲ ｱﾝｺﾞｳ ﾉ ﾃﾝｻｲ ﾀﾞｯﾀ ﾄ ｲｴﾖｳ｡"
2800 GOSUB 670:GRAPH I2,C
2810 PRINT"右K: ﾃﾞﾓ,ﾌﾂｳ ﾉ ｳﾀ ﾉ ｸｷﾞﾚ ﾃﾞﾊﾅｸ 7ｷﾞｮｳ 7ﾚﾂ ﾆｼﾃ ﾊｼﾞﾒﾃ ｱﾝｺﾞｳ ﾆ ﾅﾘﾏｽ｡"
2820 PRINT"右右右右ｲﾛﾊ ｳﾀ ﾊ ﾊｼﾞﾒｶﾗ 7ｷﾞｮｳ 7ﾚﾂ ﾆ ｸﾏﾚﾃ ｱｯﾀ ﾉﾃﾞｼｮｳｶ ?"
2830 PRINT"右F: ｲﾛﾊ ｳﾀ ｶﾞ ﾂｸﾗﾚﾀ ｾｲｶｸﾅ ﾈﾝﾀﾞｲ ﾊ ﾊﾝﾒｲ ｼﾅｲ｡ ﾓｯﾄﾓ ﾌﾙｲ ｼｭｯﾃﾝ ﾃﾞﾊ 1079ﾈﾝ ﾉ"
2840 PRINT"右右右右｢ｺﾝｺｳﾐｮｳｵｳｷｮｳ｣ ﾄｲｳ ｵｷｮｳ ﾉ ﾎﾝ ﾀﾞｶﾞ,ｿﾚﾆﾊ ﾏｷﾞﾚﾓﾅｸ 7ｷﾞｮｳ 7ﾚﾂ ﾉ ﾏﾝﾖｳｶﾞﾅ ﾃﾞ"
2850 PRINT"右右右右ｼﾙｻﾚﾃ ｲﾙ｡ ｼﾀｶﾞｯﾃ ﾊｼﾞﾒｶﾗ ｺﾉﾖｳﾆ ｸﾏﾚﾀ ﾄ ﾐﾅｼﾃ ﾖｲﾀﾞﾛｳ｡"
2860 PRINT"右K: ｿﾚﾃﾞﾊ,ｲﾛﾊ 47ﾓｼﾞ ﾉ ﾖｳﾆ ｶﾅ ｦ ｼﾞｭｳﾌｸ ｽﾙｺﾄﾅｸ ｽﾍﾞﾃ ﾂｶｯﾀ ｳﾀ ﾊ ﾎｶﾆﾓ ｱﾙﾉﾃﾞｽｶ ?"
2870 PRINT"右F: ﾕｳﾒｲ ﾅﾉﾊ ｢ｱﾒﾂﾁ｣ ﾄ ｢ﾀｲﾆ｣ ﾉ ｳﾀ ｶﾞ ｱﾙ｡ ﾘｮｳﾎｳﾄﾓ ｲﾛﾊ ｳﾀ ﾖﾘ ﾏｴ ﾄｻﾚﾙ ｶﾞ"
2880 PRINT"右右右右ｶﾞｸｼｬ ﾆﾓ ﾌﾒｲﾅ ﾃﾝ ｶﾞ ｵｵｲ｡ ﾅｲﾖｳ ﾊ ｼﾞﾌﾞﾝ ﾃﾞ ｼﾗﾍﾞﾃ ﾐﾙｶﾞﾖｲ｡"
2890 PRINT"右右右右ﾜﾀｼ ﾊ ｲｿｶﾞｼｲ ﾉﾃﾞ,ｷｮｳ ﾊ ｺﾚﾃﾞ ｼﾂﾚｲｼｮｳ｡"
2900 GOSUB 670
2910 REM P-4
2920 GOSUB 610
2930 LINE200,198,220,170,290,170,310,198
2940 LINE205,198,222,173:LINE210,198,210,192,233,192
2950 FORI=0TO70STEP2:LINE220+I,170,240+I,198:NEXT
2960 LINE260,80,260,170
2970 FORI=0TO3:FORJ=0TO20:LINE260,90+20*I,240+2*J,105+20*I
2980 NEXT J,I
2990 LINE250,105,247,170:LINE270,105,274,170
3000 LINE190,155,215,140,248,130:LINE272,130,295,133,318,140
3010 LINE170,148,200,162,220,165
3020 GRAPH I2
3030 POSITION40,100:PATTERN-16,U$(36),-16,U$(12),-16,U$(4),-16,U$(15),-16,U$(42)
3040 POSITION40,120:PATTERN-16,U$(21),-16,U$(22),-16,U$(26),-16,U$(41),-16,U$(29),-16,U$(33),-16,U$(3)
3050 POSITION40,140:PATTERN-16,U$(37),-16,U$(28),-16,U$(3),-16,U$(21),-16,U$(26)
3060 POSITION40,160:PATTERN-16,U$(4),-16,U$(5),-16,U$(32),-16,U$(14),-16,U$(33),-16,U$(7),-16,U$(28)
3070 POSITION40,180:PATTERN-16,U$(1),-16,U$(30),-16,U$(37),-16,U$(14),-16,U$(9),-16,U$(21),-16,U$(9)
3080 PRINT"右ｷﾐﾊ,F ｷｮｳｼﾞｭ ﾉ ﾔｼｷ ｦ ｱﾄﾆｽﾙﾄ,ｺﾀﾞｲｼ ﾉ ｹﾞﾝﾃﾝ ﾄｲｴﾙ ﾅﾗ ｦ ｵﾄｽﾞﾚﾃ,"
3090 PRINT"右ﾃﾝﾋﾟｮｳ ﾉ ﾑｶｼ ｦ ｼﾉﾊﾞｾﾙ ﾌﾙｲ ﾏﾁﾅﾐ ｦ ﾋﾄﾘ ｻﾝｻｸ ｼﾀ｡"
3100 PRINT"右｢ｲﾛﾊ ｳﾀ｣ ﾊ,ﾍｲｱﾝｼﾞﾀﾞｲ ｺｳﾎﾞｳﾀﾞｲｼ ﾆ ﾖｯﾃ ﾂｸﾗﾚﾀ ﾄ ﾅｶﾞｲｱｲﾀﾞ ｼﾝｼﾞﾗﾚﾃ ｲﾀｶﾞ,"
3110 PRINT"右ﾀﾝﾅﾙ ﾃﾞﾝｾﾂ ﾆ ｽｷﾞｽﾞ,ｲﾏﾃﾞﾊ ｶﾞｸｼｬ ﾆ ﾖｯﾃ ﾋﾃｲ ｻﾚﾃｲﾙ｡"
3120 PRINT"右ｱﾙｲﾊ ﾓｯﾄ ﾌﾙｲ ﾏﾝﾖｳｼﾞﾀﾞｲ ﾆ ﾏﾃﾞ ｻｶﾉﾎﾞﾙ ﾉﾃﾞﾊ ﾅｲｶ ﾄｲｳ ｾﾂ ｶﾞｱﾙ｡"
3130 PRINT"右ｷﾐｶﾞ ﾅﾗ ｦ ｵﾄｽﾞﾚﾀﾉﾊ,ｼﾀ ﾆ ｱｹﾞﾀ ｳﾀ ﾄ ｲﾛﾊ ｳﾀ ﾉ ﾙｲｼﾞ ｦ ｶﾝｼﾞﾄｯﾀ ｶﾗﾀﾞｯﾀ｡"
3140 PRINT"右ｲﾛﾊ ｳﾀ ﾉ ｶｼﾞﾝ ﾊ,ｶﾂﾃ ﾆｵｳｶﾞｺﾞﾄｷ ﾐﾔｺ ﾃﾞ ｸﾗｼﾃｲﾀﾗｼｲ ﾉﾀﾞ｡"
3150 PRINT"下右ｼﾂﾓﾝ: ｺｺﾆｱｹﾞﾀ ｳﾀ ﾉ ｻｸｼｬ ｦ ｺﾀｴﾖ｡ ";CHR$(12);:INPUT K$
3160 PRINT"ⓒ"
3170 Q$=CHR$(181)+CHR$(201)+CHR$(201)+CHR$(181)+CHR$(213):IF K$=Q$ THEN 3190
3180 GOSUB 740:GOTO 3150
3190 GRAPH I2,C
3200 PRINT"右ｿﾚﾆｼﾃﾓ,ｵｻﾅｲﾄｷｶﾗ ｸﾁﾆｼﾀ ｲﾛﾊ ｳﾀ ﾉ ﾅｶﾆ,｢ﾄｶﾞﾅｸﾃｼｽ｣ ﾄｲｳ ｵｿﾙﾍﾞｷ ｱﾝｺﾞｳ ｶﾞ ｶｸｻﾚﾃｲﾀﾄﾊ｡"
3210 PRINT"右ｴﾄﾞｼﾞﾀﾞｲ ﾉ ﾌﾞﾝｹﾝ ﾆ ﾖﾙﾄ,ｲﾛﾊ ｳﾀ ﾉ ﾌﾞｷﾐﾅ ｱﾝｺﾞｳ ｦ ｽﾃﾞﾆ ﾅﾝﾆﾝｶ ﾉ ﾋﾄ ｶﾞ ｷﾂﾞｲﾃｲﾀﾄｲｳ｡"
3220 PRINT"右ｿﾉﾅｶﾆﾊ,ｱｺｳﾛｳｼ ﾉ ｵｵｲｼ ｸﾗﾉｽｹ ﾓ ﾌｸﾏﾚﾃｲﾙ｡ ｲﾛﾊ 47ﾓｼﾞ ﾄ ｱｺｳﾛｳｼ 47ｼ ｶﾞ ﾌｼｷﾞﾄ ｲｯﾁｽﾙ｡"
3230 PRINT"右ｲﾛﾊ ﾉ ｻｸｼｬ ﾊ ﾅﾆｶ ｼﾞｭｳﾀﾞｲ ﾅ ﾘﾕｳ ﾃﾞ ﾐﾔｺ ｦ ｵﾜﾚ,ﾂｲﾆ ｼｹｲ ﾆ ﾅｯﾀﾄ ｵﾓﾜﾚﾙ｡"
3240 PRINT"右ｿﾉ ﾑﾈﾝ ﾉ ｼﾆｷﾞﾜ ﾆ,ｶﾚﾊ ﾋｯｼﾆ ﾁｴ ｦ ﾌﾘｼﾎﾞｯﾃ ﾑｼﾞﾂ ｦ ｳｯﾀｴﾙ ｳﾀ ｦ ｶﾝｾｲ ｻｾﾀﾉﾀﾞ｡"
3250 PRINT"右ﾅﾝﾄｲｳ ｽｻﾏｼﾞｲ ｼｭｳﾈﾝ ﾀﾞﾛｳ｡ ﾊｸﾁｮｳ ﾊ ｼﾆｷﾞﾜ ﾆ ﾓｯﾄﾓ ｳﾂｸｼｲ ｺｴﾃﾞ ﾅｸﾄｲｳ｡"
3260 PRINT"右ﾄｶﾞﾅｸﾃｼｽ ｶｼﾞﾝ ﾆ ﾄｯﾃ,ｲﾛﾊ ｳﾀ ｺｿ ﾋｹﾞｷﾃｷﾅ ﾊｸﾁｮｳ ﾉ ｳﾀ ﾆ ﾋﾄｼｶｯﾀ ﾉﾃﾞﾊ ﾅｲｶ｡"
3270 PRINT"右ﾄﾞｳﾆｶｼﾃ ｺﾉ ﾋｹﾞｷ ﾉ ｶｼﾞﾝ ｦ ﾂｷﾄﾒﾀｲ..."
3280 PRINT"右ｷﾐﾊ ﾚｷｼ ﾉ ｵﾓﾐ ｦ ｶﾝｼﾞﾙ ﾅﾗ ﾆ ｱｯﾃ,ﾊﾙｶ ｺﾀﾞｲｼ ﾉ ﾔﾐ ﾉ ﾌｶｻ ｦ ﾂｳｶﾝ ｼﾀ｡"
3290 GOSUB 670:GRAPH I2
3300 POSITION10,80:PATTERN-16,U$(36),-16,U$(40),-16,U$(19),-16,U$(8),-16,U$(5),-16,U$(42),-16,U$(18),-16,U$(22)
3310 POSITION10,100:PATTERN-16,U$(29),-16,U$(30),-16,U$(14),-16,U$(3),-16,U$(41),-16,U$(20),-16,U$(16),-16,U$(4)
3320 POSITION10,120:PATTERN-16,U$(28),-16,U$(45),-16,U$(38),-16,U$(9),-16,U$(23),-16,U$(2),-16,U$(33),-16,U$(31)
3330 POSITION10,140:PATTERN-16,U$(44),-16,U$(7),-16,U$(1),-16,U$(10),-16,U$(24),-16,U$(6),-16,U$(47),-16,U$(43)
3340 POSITION10,160:PATTERN-16,U$(39),-16,U$(13),-16,U$(37),-16,U$(11),-16,U$(27),-16,U$(32),-16,U$(46),-16,U$(15)
3350 POSITION10,180:PATTERN-16,U$(34),-16,U$(26),-16,U$(34),-16,U$(12),-16,U$(21),-16,U$(17),-16,U$(25),-16,U$(35)
3360 REM P-5
3370 PRINT"右ｺｺﾆ ｱｹﾞﾀ ﾉﾊ,F ｷｮｳｼﾞｭ ｶﾞ ｼﾞﾌﾞﾝﾃﾞ ｼﾗﾍﾞﾃﾐﾖ ﾄｲｯﾀ ｢ｱﾒﾂﾁ｣ ﾉ ｳﾀ ﾃﾞｱﾙ｡"
3380 PRINT"右ｲﾛﾊ ﾄ ﾄﾞｳﾖｳﾆ ｻｸｼｬ ﾊ ﾌﾒｲ ﾀﾞｶﾞ,ｸﾂｶﾑﾘ ﾆ ｱﾝｺﾞｳ ｶﾞ ｱﾙﾄﾊ ｵﾓｴﾅｲ｡"
3390 PRINT"右ﾕﾜ,ｻﾙ,ﾏﾃﾞﾊ 2ﾓｼﾞ ﾉ ｸﾐｱﾜｾ ﾆﾅｯﾃｲﾙｶﾞ,ｿﾉｱﾄﾊ ｷﾐｮｳﾅ 4ﾓｼﾞ ﾂﾞﾂ ﾃﾞｱﾙ｡"
3400 PRINT"右ﾅｾﾞ ｵｼﾏｲﾏﾃﾞ 2ﾓｼﾞ ﾆ ｼﾅｶｯﾀﾉｶ,ｿﾉ ｲﾐ ﾔ ﾘﾕｳ ﾆ ﾂｲﾃ ｶﾞｸｼｬ ﾓ ｸﾋﾞ ｦ ｶｼｹﾞﾃｲﾙ｡"
3410 PRINT"右｢ｵﾌｾﾖ ｴﾉｴｦ ﾅﾚｲﾃ｣ ﾅﾝﾄﾅｸ ｲﾐ ｶﾞ ｱﾘｿｳﾀﾞｶﾞ ﾖｸﾜｶﾗﾅｲ｡"
3420 PRINT"右ﾓｳﾋﾄﾂ,ｶﾅﾓｼﾞ ｦ ｼﾞｭｳﾌｸ ｼﾅｲﾃﾞ ﾂｸﾗﾚﾀ ｢ﾀｲﾆ｣ ﾉ ｳﾀ ｶﾞ ｱﾙｶﾞ,"
3430 PRINT"右ｺﾁﾗ ﾉ ｻｸｼｬ ﾊ,ﾐﾅﾓﾄﾉ ﾀﾒﾉﾘ ﾃﾞ ｳﾀ ﾉ ﾅｲﾖｳ ﾆ ﾌﾒｲﾅ ﾃﾝ ﾊ ﾅｲ｡"
3440 PRINT"下右ｼﾂﾓﾝ: ｢ｱﾒﾂﾁ｣ ﾆ ﾃﾞﾃｸﾙ ｢ﾕﾜ｣ ｦ ｹﾞﾝﾀﾞｲｺﾞ ﾆ ﾔｸｾ｡ ";CHR$(12);:INPUT K$
3450 PRINT"ⓒ"
3460 Q$=CHR$(178)+CHR$(181)+CHR$(179):IF K$=Q$ THEN 3480
3470 GOSUB 740:GOTO 3440
3480 PRINT"右ﾐﾅﾓﾄﾉ ﾀﾒﾉﾘ ﾊ ｢ｸﾁｽﾞｻﾐ｣ ﾄｲｳ ﾎﾝ ﾉ ﾅｶﾃﾞ,｢ｱﾒﾂﾁ｣ ｦ ｹﾅｼﾃｲﾙｶﾞ,｢ｲﾛﾊ｣ ﾆﾊ ﾅﾆﾓﾌﾚﾃｲﾅｲ｡"
3490 PRINT"右ｺﾚﾗ 3ﾂ ﾉ ｳﾁ 2ﾂ ﾏﾃﾞ,ｻｸｼｬ ﾌﾒｲ ﾃﾞｱﾘ,ｲﾐ ﾉ ﾖｸﾜｶﾗﾅｲ ﾌﾞﾌﾞﾝ ｶﾞ ﾃﾞﾃｸﾙ｡"
3500 PRINT"右ｶﾝｶﾞｴﾗﾚﾙ ｺﾄﾊ,｢ｱﾒﾂﾁ｣ ﾓ ｢ｲﾛﾊ｣ ﾄ ｵﾅｼﾞｸ ｱﾝｺﾞｳﾌﾞﾝ ﾆ ﾅｯﾃｲﾙ ﾉﾃﾞﾊﾅｲｶ..."
3510 PRINT"右ﾀﾀﾞｼ,｢ｲﾛﾊ｣ ﾄ ｢ｱﾒﾂﾁ｣ ﾊ ｶﾝｼﾞﾝﾅ ﾃﾝﾃﾞ ﾋﾄﾂ ｺﾄﾅｯﾃ ｲﾙ｡"
3520 PRINT"下右ｼﾂﾓﾝ: ｳｴ ﾉ 2ﾂ ｶﾞ ｺﾄﾅｯﾃｲﾙ ﾃﾝｦ ｱｹﾞﾖ｡"
3530 PRINT"右右ﾋﾝﾄ: ｺﾀﾞｲ ﾆﾊ ｱ.ｷﾞｮｳ ﾄ ﾔ.ｷﾞｮｳ ﾉ ｢ｴ｣ ｶﾞ ｸﾍﾞﾂ ｻﾚﾃｲﾀ｡"
3540 PRINT"右";CHR$(12);:INPUT K$
3550 PRINT"ⓒ"
3560 Q$=CHR$(211)+CHR$(188)+CHR$(222)+CHR$(189)+CHR$(179)
3570 IF K$=Q$ THEN 3590
3580 GOSUB 740:GOTO 3520
3590 GRAPH I2,C
3600 FORJ=0TO2*πSTEP.1
3610 SET 15*COS(J)+100,20*SIN(J)+140
3620 NEXT
3630 FORI=0TO15:LINE85+2*I,118,85+2*I,128:NEXT
3640 FORI=0TO4:LINE78+2*I,177-2*I,82+2*I,140+6*I:NEXT
3650 FORI=0TO4:LINE110+2*I,165-5*I,114+2*I,170+2*I:NEXT
3660 LINE75,180,78,160,81,135,83,120,90,115,100,112,110,115,117,120,120,135,122,160,125,180
3670 LINE93,158,93,170,100,173,107,170,107,158
3680 LINE93,170,65,185,60,198:LINE107,170,135,185,140,198
3690 FORI=1TO10:LINE65,185+I,135,185+I:NEXT
3700 LINE90,133,93,131,96,133:LINE104,133,107,131,110,133
3710 LINE100,138,100,148:LINE97,150,103,150:LINE98,152,102,152
3720 LINE92,136,94,136:LINE106,136,108,136
3730 PRINT"右ｷﾐﾊ ﾅﾗ ｼﾅｲ ﾃﾞ ﾋﾄﾘ ﾉ ﾜｶｲ ｵﾝﾅ ﾄ ﾃﾞｱｯﾀ｡"
3740 PRINT"右ｶﾉｼﾞｮ ﾊ ﾄｳｷｮｳ ﾉ ｼﾞｮｼﾀﾞｲｾｲ ﾃﾞ,ﾅﾗ ﾉ ﾌﾙｲ ｲｾｷ ﾒｸﾞﾘ ｦ ｼﾃｲﾙ ﾄｲｳ｡"
3750 PRINT"右ﾔﾊﾘ ｺﾀﾞｲｼ ﾉ ﾅｿﾞ ﾆ ﾄﾃﾓ ｷｮｳﾐ ｶﾞ ｱﾙﾗｼｲ｡"
3760 PRINT"右Y: ﾜﾀｼ ﾉ ﾅﾏｴ ﾊ Yoko ﾃﾞｽ｡ ﾏﾝﾖｳ ﾉ ﾌﾞﾀｲ ﾄ ﾅｯﾀ ｱｽｶ ﾁﾎｳ ｦ ｹﾝｶﾞｸ ｼﾃ ｷﾏｼﾀ｡"
3770 PRINT"右K: ﾑｺｳ ﾉ ﾏﾅｶﾐﾊﾗ ﾆﾊ,｢ｲｼﾌﾞﾀｲ｣ ﾄ ﾖﾊﾞﾚﾙ ｷｮﾀﾞｲﾅ ﾊｶ ｶﾞ ｱﾘﾏｼﾀﾈ｡"
3780 PRINT"右Y: ｴｴ,ﾀｲｶ ﾉ ｶｲｼﾝ ﾃﾞ ﾎﾛﾎﾞｻﾚﾀ ｿｶﾞｼ ﾉ..."
3790 PRINT"下右ｼﾂﾓﾝ: ｢ｲｼﾌﾞﾀｲ｣ ﾊ ｿｶﾞｼ ﾉ ﾀﾞﾚ ﾉ ﾊｶ ﾄｼﾃ ﾂﾀｴﾗﾚﾃｲﾙ ﾀﾞﾛｳｶ ?"
3800 PRINT"右";CHR$(12);:INPUT K$
3810 PRINT"ⓒ"
3820 Q$=CHR$(179)+CHR$(207)+CHR$(186):IF K$=Q$ THEN 3840
3830 GOSUB 740:GOTO 3790
3840 PRINT"右K: ﾀｲｶ ﾉ ｶｲｼﾝ ｾﾞﾝｺﾞ ﾊ ﾄｸﾆ ﾃﾝﾉｳｹ ﾄ ｺﾞｳｿﾞｸ ﾉ ﾁ ﾃﾞ ﾁ ｦ ｱﾗｳ ｹﾝﾘｮｸ ﾄｳｿｳ ｶﾞ"
3850 PRINT"右右右右ｱｲﾂｲﾀﾞ｡ ｿｶﾞﾉ ｲﾙｶ ﾊ ｼｮｳﾄｸﾀｲｼ ﾉ ｺ ﾔﾏｼﾛﾉ ｵｵｴ ｦ ﾎﾛﾎﾞｼ,ﾐｽﾞｶﾗﾊ ﾌｼﾞﾜﾗﾉ ｶﾏﾀﾘ,"
3860 PRINT"右右右右ﾅｶﾉ ｵｵｴ ﾆ ﾖｯﾃ ｳﾀﾚﾀ｡"
3870 PRINT"右Y: ｢ｲﾛﾊ ｳﾀ｣ ﾉ ｻｸｼｬ ﾓ ｿｳｼﾀ ｹﾝﾘｮｸ ｱﾗｿｲ ﾉ ｷﾞｾｲ ﾆ ｻﾚﾀ ﾄ ｱﾅﾀﾊ ｶﾝｶﾞｴﾙ ﾉﾃﾞｽｶ｡"
3880 PRINT"右K: ﾎﾞｸﾆﾓ ｿﾚﾊ ﾏﾀﾞ ｵｵｷﾅ ﾅｿﾞ ﾃﾞｽ｡ ｼｶｼ,ｲﾛﾊ ｶﾞ ﾏﾝﾖｳｶﾞﾅ ﾃﾞ ｼﾙｻﾚﾃ ｲﾀﾄｺﾛ ｦﾐﾙﾄ,"
3890 PRINT"右右右右ｿﾉ ｻｸｼｬ ﾊ ｢ﾏﾝﾖｳｼｭｳ｣ ｦ ﾀﾞｲﾋｮｳｽﾙ ｶｼﾞﾝ ﾀﾞｯﾀﾆ ﾁｶﾞｲﾅｲ｡"
3900 PRINT"右Y: ｿｳｽﾙﾄ,ﾇｶﾀﾞﾉ ｵｵｷﾐ,ｶｷﾉﾓﾄﾉ ﾋﾄﾏﾛ,ﾔﾏﾍﾞﾉ ｱｶﾋﾄ,ｵｵﾄﾓﾉ ﾔｶﾓﾁ ﾅﾄﾞﾃﾞｽﾈ｡"
3910 PRINT"右K: ｿﾉﾅｶｶﾗ ﾄｶﾞﾅｸﾃ ｼﾝﾀﾞﾄ ｵﾓﾜﾚﾙ ﾋｹﾞｷ ﾉ ｶｼﾞﾝ ｦ ｻｶﾞｼﾀﾞｻﾅｹﾚﾊﾞ ﾅﾗﾅｲ｡"
3920 PRINT"下右ｼﾂﾓﾝ: ﾀｲｶ ﾉ ｶｲｼﾝ ｶﾞ ｵｺﾅﾜﾚﾀﾉﾊ ﾅﾝｾｲｷ ｶ ｽｳｼﾞ ﾃﾞ ｺﾀｴﾖ｡ ";:INPUT K$
3930 PRINT"ⓒ"
3940 Q$=CHR$(55):IF K$=Q$ THEN 3960
3950 GOSUB 740:GOTO 3920
3960 PRINT"右ｼﾞｮｳﾀﾞｲ ｶﾖｳ ﾉ ﾎｳｺ ﾄ ｻﾚﾙ ｢ﾏﾝﾖｳｼｭｳ｣ ﾊ,20ｶﾝ 4500ｼｭ ﾉ ｳﾀ ｦ ｱﾂﾒ,"
3970 PRINT"右8ｾｲｷ ﾅｶﾊﾞ ｵｵﾄﾓﾉ ﾔｶﾓﾁ ｶﾞ ﾍﾝｼｭｳｼﾀ ﾄ ｲﾜﾚﾙｶﾞ,ｾｲｶｸﾅ ｺﾄﾊ ﾌﾒｲﾃﾞｱﾙ｡"
3980 PRINT"右ﾔｶﾓﾁ ﾊ ｶﾝﾑﾃｲ ﾉ ｼﾞﾀﾞｲ ﾆ,ｴﾐｼｾｲﾊﾞﾂ ﾆ ﾃﾞｶｹﾙｶﾞ,ﾌｼﾞﾜﾗﾉ ﾀﾈﾂｸﾞ ｼﾞｹﾝ ｦ ｹｲｶｸｼﾀ ﾄｼﾃ,"
3990 PRINT"右ｼｺﾞ ｻﾞｲﾆﾝ ｱﾂｶｲｻﾚﾀ｡ ｼｶｼ,ﾔｶﾓﾁ ﾊ ｿﾉﾏｴﾆ ﾋﾞｮｳｼ ｼﾃｲﾙ｡"
4000 PRINT"右Y: ﾄｽﾚﾊﾞ,ﾔｶﾓﾁ ﾊ ｢ﾄｶﾞﾅｸﾃｼｽ｣ ﾉ ｱﾝｺﾞｳ ｦ ﾂｸｯﾀ ｼﾞﾝﾌﾞﾂ ﾃﾞﾊ ｱﾘｴﾅｲ ﾜｹﾃﾞｽﾈ｡"
4010 PRINT"右K: ｢ｲﾛﾊ｣ ﾉ ｻｸｼｬ ﾊ ﾐﾔｺ ｦ ｵﾜﾚ,ﾀｼｶﾆ ｢ｳｲﾉｵｸｵﾔ｣ ﾖ ｺｴﾃ ﾙｻﾞｲ ﾆ ﾅｯﾀ ﾄ ｽｲﾃｲｻﾚﾙ｡"
4020 PRINT"右右右右ｿｼﾃ ｲﾏ ﾎﾞｸ ﾉ ﾉｳﾘﾆﾊ,ｶｷﾉﾓﾄﾉ ﾋﾄﾏﾛ ﾄｲｳ ｶｼﾞﾝ ﾉ ｽｶﾞﾀ ｶﾞ ｳｶﾝﾃﾞｸﾙ｡"
4030 PRINT"右Y: ﾃﾞﾓ,ﾋﾄﾏﾛ ﾊ ｾｲﾈﾝﾎﾞﾂﾈﾝ ｶﾞ ﾊｯｷﾘｼﾅｲ ｶｼﾞﾝ ﾃﾞｼｮｳ｡"
4040 PRINT"右K: ｿｺﾆ,ﾁﾅﾏｸﾞｻｲ ｹﾝﾘｮｸ ﾄｳｿｳ ﾆ ｱｹｸﾚﾀ ｺﾀﾞｲｼ ﾉ ｱﾝｺｸ ﾉ ｲﾁﾒﾝ ｶﾞ ﾋｿﾝﾃﾞ ｲﾙﾉﾃﾞﾊ ﾅｲｶ｡"
4050 GOSUB 670
4060 PRINT"右K: ﾋﾄﾏﾛ ﾊ ｢ﾏﾝﾖｳｼｭｳ｣ ﾃﾞ ﾓｯﾄﾓ ｵｵｸﾉ ｶｸﾁｮｳ ﾀｶｲ ｳﾀ ｦ ﾉｺｼ,ｾｲｼﾞﾝ ﾄ ﾀﾀｴﾗﾚﾃｲﾙ｡"
4070 PRINT"右右右右ﾆﾓｶｶﾜﾗｽﾞ,｢ｺｼﾞｷ｣ ﾔ ｢ﾆﾎﾝｼｮｷ｣ ﾆ ｲﾁﾄﾞﾓ ﾅﾏｴ ｶﾞ ｼﾙｻﾚﾃﾅｸ,ｼｮｳﾀｲ ﾊ ﾅｿﾞ ﾆﾂﾂﾏﾚﾃ ｲﾙ｡"
4080 PRINT"右Y: ｿﾚﾊ,ﾋﾄﾏﾛ ｶﾞ ｶｷｭｳﾔｸﾆﾝ ﾃﾞ,ｸﾗｲ ｶﾞ ﾋｸｶｯﾀ ｶﾗﾃﾞﾊ ｱﾘﾏｾﾝｶ｡"
4090 PRINT"右K: ｲｾﾞﾝﾆﾊ ｿｳ ｼﾝｼﾞﾗﾚﾃ ｲﾀ｡ ｼｶｼ,ｺﾀﾞｲ ﾆ ﾁｲ ｦ ｳｼﾅｲ,ﾙｻﾞｲ ﾆ ﾅﾚﾊﾞ ｷﾛｸ ｶﾗ ﾅﾏｴ ｦ"
4100 PRINT"右右右右ﾏｯｻﾂ ｻﾚﾙ ｺﾄｶﾞ ｵｵｲ｡ ﾄｸﾆ ｢ﾆﾎﾝｼｮｷ｣ ﾅﾄﾞﾊ ﾌｼﾞﾜﾗｼ ﾉ ｷﾛｸ ﾆ ﾓﾄﾂﾞｲﾃ ｲﾙﾉﾀﾞｶﾗ｡"
4110 PRINT"右Y: ﾃﾞﾊ,ﾋﾄﾏﾛ ｶﾞ ｲｷﾃｲﾀｺﾛ ｾｲｼﾞ ﾉ ｼﾞｯｹﾝ ｦ ﾆｷﾞｯﾃ ｲﾀﾉﾊ ﾀﾞﾚﾃﾞｽｶ ?"
4120 PRINT"下右ｼﾂﾓﾝ: ｶﾉｼﾞｮ ﾉ ﾄｲ ﾆ ｺﾀｴﾖ｡"
4130 PRINT"右右ﾋﾝﾄ: ﾌｼﾞﾜﾗﾉｶﾏﾀﾘ ﾉ ﾑｽｺ ﾃﾞｱﾙ｡"
4140 PRINT"右";CHR$(12);:INPUT K$
4150 PRINT"ⓒ"
4160 Q$=CHR$(204)+CHR$(188)+CHR$(222)+CHR$(220)+CHR$(215)+CHR$(201)+CHR$(204)+CHR$(203)+CHR$(196)
4170 IF K$=Q$ THEN 4190
4180 GOSUB 740:GOTO 4110
4190 GRAPH I2,C                                                                 
4200 POSITION40,100:PATTERN-16,U$(44),-16,U$(48),-16,U$(14),-16,U$(42),-16,U$(26)
4210 POSITION40,120:PATTERN-16,U$(26),-16,U$(4),-16,U$(14),-16,U$(38),-16,U$(2),-16,U$(44),-16,U$(26)
4220 POSITION40,140:PATTERN-16,U$(16),-16,U$(19),-16,U$(41),-16,U$(34),-16,U$(35)
4230 POSITION40,160:PATTERN-16,U$(14),-16,U$(6),-16,U$(9),-16,U$(41),-16,U$(47),-16,U$(17),-16,U$(3)
4240 POSITION40,180:PATTERN-16,U$(19),-16,U$(38),-16,U$(14),-16,U$(16),-16,U$(32),-16,U$(38),-16,U$(10)
4250 PRINT"右K: ｺﾉ ｳﾀ ﾊ,ﾋﾄﾏﾛ ｶﾞ ｶﾙﾉﾐｺ ﾆ ｼﾀｶﾞｯﾃ ｱｷﾉ ﾄｲｳﾄｺﾛﾆ ｵﾓﾑｲﾀﾄｷﾆ ﾖﾝﾀﾞﾓﾉ ﾃﾞｱﾙ｡"
4260 PRINT"右右右右ｺﾉﾄｳｼﾞ ﾋﾄﾏﾛ ﾊ ﾄｳｸﾞｳﾉﾀｲﾌ ﾄｲｳ ﾀｶｲ ｸﾗｲ ﾆ ﾂｲﾃ ｲﾀﾄ ｵﾓﾜﾚﾙ｡"
4270 PRINT"右Y: ｶﾙﾉﾐｺ ﾄｲｳﾉﾊ ?"
4280 PRINT"右K: ｼﾞﾄｳﾃｲ ﾉ ﾏｺﾞ ﾆ ｱﾀﾙ ｵｳｼﾞ ﾃﾞ,ﾉﾁﾆ ﾃﾝﾉｳ ﾄｼﾃ ｿｸｲ ｼﾀ｡"
4290 PRINT"下右ｼﾂﾓﾝ: ｿｸｲ ｼﾀ ｶﾙﾉﾐｺ ﾊ ﾅﾆﾃﾝﾉｳ ﾄ ﾅﾉｯﾀｶ ｺﾀｴﾖ｡ ";CHR$(12);:INPUT K$
4300 PRINT"ⓒ"
4310 Q$=CHR$(211)+CHR$(221)+CHR$(209)+CHR$(195)+CHR$(221)+CHR$(201)+CHR$(179)
4320 IF K$=Q$ THEN 4340
4330 GOSUB 740:GOTO 4290
4340 PRINT"右Y: ｺﾉﾄｷ ｾｲｼﾞ ﾉ ｼﾞｯｹﾝ ｦ ﾆｷﾞｯﾀ ﾉｶﾞ ﾔｼﾝｶ ﾉ ﾌﾋﾄ ﾀﾞｯﾀﾉﾃﾞｽﾈ｡"
4350 PRINT"右K: ﾄｳｸﾞｳﾉﾀｲﾌ ﾉ ﾋﾄﾏﾛ ﾊ,ﾌﾋﾄ ﾆ ﾄｯﾃ ﾓｯﾄﾓ ｼﾞｬﾏﾅ ｿﾝｻﾞｲ ﾀﾞｯﾀ｡ ﾌﾋﾄ ﾊ ﾑｽﾒ ｦ"
4360 PRINT"右右右右ﾓﾝﾑﾃｲ ﾉ ｷｻｷ ﾆｼﾃ,ｺｳｿﾞｸ ﾉ ﾀｹﾁﾉﾐｺ ｦ ｲﾂﾜｯﾃ ｼﾅｾﾀ｡"
4370 PRINT"右右右右ﾌｼﾞﾜﾗｼ ﾉ ﾊﾝｴｲ ﾉ ﾀﾒﾆ,ｼﾞｬﾏﾓﾉ ﾊ ﾖｳｼｬ ﾅｸ ﾏｯｻﾂ ｼﾀﾉﾀﾞ｡"
4380 PRINT"右Y: ｿｼﾃ,ﾋﾄﾏﾛ ﾊ ｸﾗｲ ｦ ｳﾊﾞﾜﾚ,ﾐﾔｺ ｶﾗ ﾂｲﾎｳ ｻﾚ,ﾑｼﾞﾂ ﾉ ﾐ ﾃﾞ ｼｮｹｲ ｻﾚﾀ ﾉﾃﾞｽｶ｡"
4390 PRINT"右K: ﾄﾞｳｼﾞﾆ ﾋﾄﾏﾛ ﾊ ｱﾗﾕﾙ ﾚｷｼ ﾉ ｷﾛｸ ｶﾗ ﾅﾏｴ ｦ ｹｻﾚﾙ ｳﾝﾒｲ ﾆ ｱｯﾀ｡"
4400 PRINT"右右右右ﾀﾀﾞ,｢ﾆﾎﾝｼｮｷ｣ ﾆﾊ ｶｷﾉﾓﾄﾉ ｻﾙ ﾄｲｳ ｷﾐｮｳﾅ ｼﾞﾝﾌﾞﾂ ｶﾞ ｲﾁﾄﾞ ﾃﾞﾃｸﾙ｡"
4410 PRINT"下右ｼﾂﾓﾝ: ｢ﾆﾎﾝｼｮｷ｣ ｶﾞ ﾂｸﾗﾚﾀ ﾈﾝｺﾞｳ ｦ ｾｲﾚｷ ﾃﾞ ｺﾀｴﾖ｡ ";:INPUT K$
4420 PRINT"ⓒ"
4430 Q$=CHR$(55)+CHR$(50)+CHR$(48):IF K$=Q$ THEN 4450
4440 GOSUB 740:GOTO 4410
4450 GRAPH I2,C
4460 POSITION40,100:PATTERN-16,U$(27),-16,U$(28),-16,U$(29),-16,U$(30),-16,U$(26)
4470 POSITION40,120:PATTERN-16,U$(45),-16,U$(41),-16,U$(42),-16,U$(32),-16,U$(41),-16,U$(13),-16,U$(31)
4480 POSITION40,140:PATTERN-16,U$(21),-16,U$(28),-16,U$(42),-16,U$(14),-16,U$(26)
4490 POSITION40,160:PATTERN-16,U$(33),-16,U$(43),-16,U$(38),-16,U$(28),-16,U$(7),-16,U$(38),-16,U$(18)
4500 POSITION40,180:PATTERN-16,U$(36),-16,U$(38),-16,U$(3),-16,U$(14),-16,U$(21),-16,U$(42),-16,U$(38)
4510 PRINT"右Y: ｵｳﾐ ﾉ ｵｸﾁ ﾆﾊ,｢ｻﾙﾏﾙﾀﾞﾕｳ｣ ﾉ ﾃﾞﾝｾﾂ ｶﾞ ｱｯﾃ,ｿﾉ ﾀﾞｲﾋｮｳﾃｷﾅ ｳﾀ ｶﾞ ｺﾚﾃﾞｽ｡"
4520 PRINT"右右右右ｶｷﾉﾓﾄﾉ ｻﾙ ｶﾞ ｻﾙﾏﾙﾀﾞﾕｳ ﾄ ﾄﾞｳｲﾂｼﾞﾝﾌﾞﾂ ｶ ﾜｶﾗﾅｲｹﾄﾞ,ﾋﾄﾏﾛ ﾓ ｵｳﾐ ﾆ ｲﾀｺﾄｶﾞ ｱﾘﾏｽ｡"
4530 PRINT"右K: ｢ｵｸﾔﾏﾉ ﾓﾐｼﾞﾌﾐﾜｹ｣... ｺﾚﾊ ﾏｻｼｸ ｢ｳｲﾉｵｸﾔﾏ ｹﾌｺｴﾃ｣ ﾆ ｷｮｳﾂｳｽﾙ ｳﾀ ﾀﾞ｡"
4540 PRINT"右右右右ﾋﾄﾏﾛ ﾊ ﾎｶﾆﾓ,｢ｵｸﾔﾏﾉ ｺﾉﾊｶﾞｸﾘﾃ ﾕｸﾐｽﾞﾉ ｵﾄｷｷｼﾖﾘ ﾂﾈﾜｽﾗｴｽﾞ｣ ﾄｲｳ ｳﾀ ｦ ﾉｺｼﾃｲﾙ｡"
4550 PRINT"右右右右ｿｼﾃ ｻﾗﾆ,｢ｱﾒﾂﾁ｣ ﾉ ｳﾀ ﾆﾓ,｢ﾔﾏ ｶﾊ｣｢ﾕﾜ ｻﾙ｣ ﾄ ﾃﾞﾃｸﾙ｡"
4560 PRINT"右Y: ｽﾙﾄ ｶｷﾉﾓﾄﾉ ｻﾙ ﾊ,ｸﾗｲ ｦ ﾊｸﾀﾞﾂｻﾚﾀ ﾋﾄﾏﾛ ﾆ ﾎｶﾅﾗｽﾞ,｢ｱﾒﾂﾁ｣ ﾉ ｻｸｼｬ ﾃﾞﾓｱﾙﾉﾃﾞｽｶ｡"
4570 PRINT"右K: ﾋﾄﾏﾛ ﾎﾄﾞ ﾉ ﾃﾝｻｲ ｶｼﾞﾝ ｶﾞ ﾚｷｼ ｶﾗ ﾏｯﾀｸ ｹｻﾚﾀﾉﾊ ｿﾚｿｳｵｳﾉ ｼﾞｭｳﾀﾞｲﾅ ﾘﾕｳｶﾞ ｶｸｻﾚﾃ"
4580 PRINT"右右右右ｲﾀ ﾄ ｵﾓﾜﾚﾙ｡ ｽﾅﾜﾁ,ﾔｼﾝｶ ﾉ ﾌﾋﾄ ﾄ ｱﾗｿｯﾃ ﾔﾌﾞﾚｻｯﾀﾉﾀﾞ｡"
4590 GOSUB 670
4600 GOSUB 610
4610 LINE290,110,285,95,280,95,265,100,275,105,260,110,290,110
4620 LINE261,110,261,118,257,122,261,125,261,130,265,132,278,132,290,125,290,110
4630 LINE280,110,288,127:LINE263,118,268,118:LINE261,125,270,129
4640 LINE261,128,265,128
4650 LINE265,132,255,165,260,175,290,175,295,145,305,142
4660 LINE285,129,307,140,315,180,300,188,280,188,290,175
4670 LINE280,188,272,192,275,197,286,195,290,188
4680 LINE278,190,265,190,265,195,272,195
4690 LINE318,190,290,190:LINE318,195,288,195
4700 LINE262,175,262,182,285,182:LINE262,182,257,198
4710 LINE262,142,240,142,245,168,255,180,262,176
4720 LINE240,146,228,143,225,147,225,153,230,155,241,150
4730 LINE228,153,228,162,235,162,235,154:LINE228,162,226,165,228,168,235,168,238,165,235,162
4740 LINE240,142,220,142,220,143,240,143:LINE232,142,232,110
4750 LINE228,142,228,118,232,90,235,118,234,142
4760 LINE278,132,258,160:LINE307,185,315,198
4770 FORJ=0TO2*π STEP.5
4780 LINE280,145,6*COS(J)+280,6*SIN(J)+145
4790 NEXT
4800 GRAPH I2
4810 POSITION40,100:PATTERN-16,U$(14),-16,U$(45),-16,U$(29),-16,U$(30),-16,U$(26)
4820 POSITION40,120:PATTERN-16,U$(1),-16,U$(3),-16,U$(20),-16,U$(42),-16,U$(30),-16,U$(31),-16,U$(11)
4830 POSITION40,140:PATTERN-16,U$(13),-16,U$(17),-16,U$(12),-16,U$(14),-16,U$(45)
4840 POSITION40,160:PATTERN-16,U$(42),-16,U$(22),-16,U$(4),-16,U$(7),-16,U$(1),-16,U$(45),-16,U$(14)
4850 POSITION40,180:PATTERN-16,U$(30),-16,U$(8),-16,U$(19),-16,U$(19),-16,U$(36),-16,U$(22),-16,U$(23)
4860 PRINT"右Y: ｿﾚﾃﾞﾊ,ﾋﾄﾏﾛ ｶﾞ ｼｹｲｼｭｳ ﾄｼﾃ ｲﾉﾁ ｦ ﾀﾀﾚﾀ ｼｮｳｺ ﾊ ｱﾙﾉﾃﾞｽｶ ?"
4870 PRINT"右K: ｾｲｼｷﾅ ｷﾛｸ ﾆﾊ ﾉｺｻﾚﾃｲﾅｲ｡ ｼﾀｶﾞｯﾃ,ﾋﾄﾏﾛ ﾉ ｳﾀ ｶﾗ ﾊﾝﾀﾞﾝ ｽﾙﾎｶﾅｲﾀﾞﾛｳ｡"
4880 PRINT"右Y: ﾋﾄﾏﾛ ﾊ ｲｯﾀｲ ﾄﾞｺﾃﾞ ｼﾝﾀﾞ ﾄ ｻﾚﾃｲﾙ ﾉﾃﾞｽｶ ?"
4890 PRINT"右K: ｢ﾏﾝﾖｳｼｭｳ｣ ﾉ ｢ﾊﾞﾝｶ｣ ﾆ ｿﾉ ﾃｶﾞｶﾘ ｶﾞ ﾉｺｻﾚﾃｲﾙ｡"
4900 PRINT"右右右右｢ｶｷﾉﾓﾄﾉｱｿﾝ ﾋﾄﾏﾛ ｲﾜﾐﾉｸﾆ ﾆ ｱﾘﾃ ﾐﾏｶﾗﾑ ﾄｽﾙﾄｷ ﾐｽﾞｶﾗ ｲﾀﾐﾃ ﾂｸﾙ ｳﾀ｣"
4910 PRINT"右右右右ﾄｼﾃ ﾉｯﾃｲﾙ｡ ﾋﾄﾏﾛ ｶﾞ ｲﾜﾐﾉｸﾆ ﾃﾞ ｼﾝﾀﾞ ｺﾄ ﾊ ｳﾀｶﾞｲ ｴﾅｲ｡"
4920 PRINT"下右ｼﾂﾓﾝ: ｢ｲﾜﾐﾉｸﾆ｣ ﾊ ｲﾏﾉ ﾅﾆｹﾝ ﾆ ｱﾀﾙｶ ｺﾀｴﾖ｡ ";CHR$(12);:INPUT K$
4930 PRINT"ⓒ"
4940 Q$=CHR$(188)+CHR$(207)+CHR$(200)+CHR$(185)+CHR$(221)
4950 IF K$=Q$ THEN 4970
4960 GOSUB 740:GOTO 4920
4970 PRINT"右K: ｺﾉ ﾊﾞﾝｶ ﾃﾞﾊ,｢ｶﾓﾔﾏ ﾄｲｳﾄｺﾛﾃﾞ ｼﾞﾌﾞﾝ ﾊ ｲﾜ ｦ ﾏｸﾗ ﾆ ｼﾝﾃﾞﾕｺｳﾄｽﾙｶﾞ ｱｲｽﾙｵﾝﾅ ﾊ "
4980 PRINT"右右右右ｼﾗｽﾞﾆ ﾏﾁﾜﾋﾞﾃｲﾙ ｺﾄﾀﾞﾛｳﾅ｣ ﾄｲｳ ｲﾐ ﾆﾅﾙ｡"
4990 PRINT"右Y: ﾔﾊﾘ ﾌﾂｳ ﾉ ｼﾆｶﾀ ﾄﾊ ｵﾓｴﾅｲ ｱﾜﾚﾅ ﾖｳｽ ｶﾞ ｳｶｶﾞﾜﾚ ﾏｽﾈ｡ ｢ﾏﾝﾖｳｼｭｳ｣ ｦ ﾊﾅﾔｶﾆ ｲﾛﾄﾞﾙ"
5000 PRINT"右右右右ﾃﾝｻｲ ｶｼﾞﾝ ﾉ ｻｲｺﾞ ﾆ ｼﾃﾊ ﾄﾃﾓ ﾍﾝﾃﾞｽ｡"
5010 PRINT"右K: ｿﾚﾆ,｢ﾐｽﾞｶﾗ ｲﾀﾐﾃ｣ ﾄｱﾙﾉﾊ,ﾋﾞｮｳｼ ﾅﾄﾞﾃﾞﾊﾅｸ ｼｮｹｲ ｻﾚﾀ ｺﾄｦ ｱﾝｼﾞ ｼﾃｲﾙ｡"
5020 PRINT"右右右右ﾎｶﾆﾓ,ﾋﾄﾏﾛ ｶﾞ ﾛｳｺﾞｸ ﾆｲﾃ ﾂｸｯﾀ ﾄｵﾓﾜﾚﾙ ﾂｷﾞﾉﾖｳﾅ ｳﾀ ｶﾞ ｱﾙ｡"
5030 PRINT"右右右右｢ﾜｷﾞﾓｺﾆ ｺﾌﾚﾆｶｱﾗﾑ ｵｷﾆｽﾑ ｶﾓﾉｳｷﾈﾉ ﾔｽｹｸﾓﾅｷ｣,｢ｶﾓﾔﾏ｣ ﾄ ｢ｶﾓﾉｳｷﾈ｣ ｶﾞ ｲｯﾁｽﾙ｡"
5040 PRINT"下右ｼﾂﾓﾝ: ｢ﾊﾞﾝｶ｣ ﾄﾊ ﾄﾞﾝﾅ ｳﾀ ｦ ｲﾐｽﾙ ｶ  ";CHR$(12);:INPUT K$
5050 PRINT"ⓒ"
5060 Q$=CHR$(196)+CHR$(209)+CHR$(215)+CHR$(178)+CHR$(201)+CHR$(179)+CHR$(192)
5070 IF K$=Q$ THEN 5090
5080 GOSUB 740:GOTO 5040
5090 GRAPH I2,C
5100 REM P-6
5110 GOSUB 910:GRAPH I2
5120 POSITION106,80:PATTERN-16,U$(36),-16,U$(40),-16,U$(28),-16,U$(45),-16,U$(26)
5130 POSITION106,100:PATTERN-16,U$(16),-16,U$(21),-16,U$(44),-16,U$(28),-16,U$(29),-16,U$(30),-16,U$(26)
5140 POSITION106,120:PATTERN-16,U$(33),-16,U$(45),-16,U$(9),-16,U$(16),-16,U$(11)
5150 POSITION106,140:PATTERN-16,U$(13),-16,U$(14),-16,U$(42),-16,U$(16),-16,U$(33),-16,U$(33),-16,U$(2)
5160 POSITION106,160:PATTERN-16,U$(33),-16,U$(26),-16,U$(3),-16,U$(42),-16,U$(11),-16,U$(22),-16,U$(23)
5170 PRINT"右K: ﾂｷﾞﾉ ｳﾀ ﾓ ﾋﾄﾏﾛ ｶﾞ ｺﾞｸﾁｭｳ ﾃﾞ ﾂｸｯﾀ ﾄ ｵﾓﾜﾚﾙ｡ ｺﾚｦ ﾖｸﾐﾙﾄ ｢ｱﾒﾂﾁ｣ ﾆ ｷｮｳﾂｳｽﾙ"
5180 PRINT"右右右右ｺﾄﾊﾞ ｶﾞ ｵｵｲ｡ ｺﾉ ｢ﾜｶﾞｼﾀｺﾞｺﾛ｣ ﾄﾊ,ﾋｿｶﾆ ｢ｲﾛﾊ｣ ﾆ ｱﾝｺﾞｳ ｦ ｲﾚﾀｺﾄ ｦ ｻｽﾉﾃﾞﾊ ﾅｲｶ｡"
5190 PRINT"右Y: ｿｼﾃ,｢ｺﾉﾊ｣ ﾉ ｢ﾊ｣ ﾊ,｢ｲﾛﾊ｣ ﾉ ｢ﾊ｣ ﾔ,｢ﾏﾝﾖｳｼｭｳ｣ ﾉ ｢ﾖｳ｣ ﾄ ｷｮｳﾂｳ ﾃﾞｽ｡"
5200 PRINT"右K: ｿｳﾀﾞ｡ ｺﾚﾊ ｽｺﾞｲｿﾞ! ｼﾗﾍﾞﾙﾎﾄﾞﾆ ｲﾛﾊ ﾉ ｱﾝｺﾞｳ ﾊ ﾋﾄﾏﾛ ﾆ ﾑｽﾋﾞ ﾂｲﾃﾕｸ｡"
5210 PRINT"右右右右｢ｱﾒﾂﾁ｣ ﾉﾅｶﾉ ｢ｻﾙ｣ ﾊ,｢ｶｷﾉﾓﾄﾉ ｻﾙ｣ ｽﾅﾜﾁ ｼｹｲｼｭｳ ﾉ ﾋﾄﾏﾛ ﾉ ｱﾀﾞﾅ ﾆ ﾎｶﾅﾗﾅｲ ﾉﾀﾞ｡"
5220 PRINT"右Y: ｢ｱﾒﾂﾁ｣ ﾉ ｻﾙ ﾉ ｱﾄ ﾆ ｲﾐﾌﾒｲ ﾅ ｺﾄﾞﾊﾞ ｶﾞ ﾅﾗﾝﾃﾞ ｲﾏｼﾀﾈ｡ ﾅﾝﾄｲｳ ﾉﾃﾞｼｮｳ ?"
5230 PRINT"下右ｼﾂﾓﾝ: ｻﾙ ﾉ ｱﾄﾆ ﾂﾂﾞｸ ｺﾄﾊﾞ ｦ ｶｷｼﾙｾ｡"
5240 PRINT"右";CHR$(12);:INPUT K$
5250 PRINT"ⓒ"
5260 Q$=CHR$(181)+CHR$(204)+CHR$(190)+CHR$(214)+CHR$(180)+CHR$(201)+CHR$(180)+CHR$(166)+CHR$(197)+CHR$(218)+CHR$(178)+CHR$(195)
5270 IF K$=Q$ THEN 5290
5280 GOSUB 740:GOTO 5220
5290 GRAPH I2,C
5300 PRINT"右K: ｢";Q$;"｣ ﾉ ｲﾐ ｦ ﾋﾄﾂ ﾂﾞﾂ ﾄｲﾃﾐﾖｳ｡"
5310 PRINT"右右右右｢ｵﾌｾﾖ｣ ﾄﾊ ｾﾞｯﾀｲ ﾋﾐﾂ ﾆ ｼﾃｸﾀﾞｻｲ｡"
5320 PRINT"右右右右｢ｴﾉｴｦ｣ ﾄﾊ ｺﾞｸﾁｭｳ ｶﾗ ﾀﾉﾐｺﾞﾄ ｶﾞ ｱﾘﾏｽ｡"
5330 PRINT"右右右右｢ﾅﾚｲﾃ｣ ﾄﾊ 7ﾚﾂ ﾆ ｼﾙｼﾃ ｱﾘﾏｽ｡ ﾎﾎﾞ ｺﾝﾅ ｲﾐ ﾆﾅﾙ｡"
5340 PRINT"右Y: ｿｳｽﾙﾄ,｢ｱﾒﾂﾁ｣ ﾊ ｢ｲﾛﾊ ｳﾀ｣ ｦ ﾀﾞﾚｶ ﾆ ﾄﾄﾞｹﾙﾀﾒﾉ ｱﾝｺﾞｳ ﾀﾞｯﾀ ﾉﾃﾞｽﾈ｡"
5350 PRINT"右K: ｿﾉ ﾀﾞﾚｶ ﾄﾊ ﾋﾄﾏﾛ ｶﾞ ﾘｭｳｹｲﾁ ﾃﾞ ｼﾀｼｸﾅｯﾀ ｢ﾂ ﾉ ｻﾄ ﾉ ｵﾝﾅ｣ ﾀﾞﾄ ｵﾓﾜﾚﾙ｡"
5360 PRINT"右Y: ｲﾜﾐﾉｸﾆ ﾉ ﾕﾉﾂ ﾉ ｺﾄﾃﾞｽﾈ｡"
5370 PRINT"右K: ｢ﾂ ﾉ ｻﾄ｣ ﾆﾂｲﾃﾊ,ﾋﾄﾏﾛ ﾉ ｿｳﾓﾝｶ ﾆ ｢ｲﾜﾐ ﾉ ﾂ ﾉ ｳﾐ｣ ﾄｼﾃ ﾃﾞﾃｸﾙ｡"
5380 GOSUB 670:GOSUB 610:GOSUB 910:GRAPH I2
5390 POSITION160,100:PATTERN-16,U$(31),-16,U$(32),-16,U$(31),-16,U$(32),-16,U$(7)
5400 POSITION160,120:PATTERN-16,U$(13),-16,U$(14),-16,U$(30),-16,U$(19),-16,U$(38),-16,U$(41),-16,U$(3)
5410 POSITION160,140:PATTERN-16,U$(1),-16,U$(42),-16,U$(14),-16,U$(3),-16,U$(26)
5420 POSITION160,160:PATTERN-16,U$(14),-16,U$(44),-16,U$(4),-16,U$(30),-16,U$(42),-16,U$(9),-16,U$(35)
5430 POSITION160,180:PATTERN-16,U$(36),-16,U$(9),-16,U$(7),-16,U$(1),-16,U$(3),-16,U$(47),-16,U$(29),-16,U$(45)
5440 PRINT"右K: ｺﾚﾊ ｢ﾊﾞﾝｶ｣ ﾆ ｢ｶｷﾉﾓﾄﾉｱｿﾝ ﾋﾄﾏﾛ ﾉ ﾐﾏｶﾘｼﾄｷ ﾂﾏ ﾖｻﾐﾉｵﾄﾒ ﾉ ﾂｸﾙ ｳﾀ｣ ﾄｼﾃﾉｯﾃｲﾙ｡"
5450 PRINT"右右右右ﾖｻﾐﾉｵﾄﾒ ｶﾞ ﾂ ﾉ ｻﾄ ﾉ ｵﾝﾅ ﾆ ﾁｶﾞｲﾅｲ｡"
5460 PRINT"右Y: ｺﾉ ｳﾀ ﾓ ﾋﾄﾏﾛ ｶﾞ ｹｯｼﾃ ﾂﾏ ﾆ ﾐﾄﾗﾚﾃ ﾍｲｱﾝﾆ ｼﾝﾀﾞ ﾉﾃﾞﾊ ﾅｲｺﾄｦ ｱﾗﾜｼﾃ ｲﾏｽ｡"
5470 PRINT"右K: ｷｮｳ ｷｮｳ ﾄ ｵｯﾄ ﾉ ｶｴﾘ ｦ ﾏｯﾃｲﾙﾉﾊ,ﾌﾀﾘ ｶﾞ ﾊﾅﾚﾊﾞﾅﾚ ﾆ ﾅｯﾃｲﾀｶﾗﾀﾞ｡"
5480 PRINT"右右右右ｽﾅﾜﾁ,ﾋﾄﾏﾛ ﾊ ｼﾞﾌﾞﾝ ｶﾞ ﾑｼﾞﾂ ﾃﾞ ｼﾇｺﾄｦ ﾅﾝﾄｶｼﾃ ﾂﾏ ﾆ ﾂｹﾞﾖｳﾄｼﾀﾉﾀﾞ｡"
5490 PRINT"右Y: ｿﾚｶﾞ ｲﾛﾊ ｳﾀ ﾆ ｢ﾄｶﾞﾅｸﾃｼｽ｣ ﾄｲｳ ｵﾄﾞﾛｸﾍﾞｷ ｱﾝｺﾞｳ ｦ ｸﾐｲﾚﾀ ｼﾝｿｳ ﾀﾞｯﾀﾉﾃﾞｽﾈ｡"
5500 PRINT"右K: ｶﾚﾊ ｻﾗﾆ ﾓｳﾋﾄﾂ ｱﾝｺﾞｳ ｦ ｸﾐｲﾚﾃ ｱｯﾀ｡"
5510 PRINT"下右ｼﾂﾓﾝ:｢ｲｼｶﾊ ﾉ ｶﾋ ﾆ ﾏｼﾞﾘﾃ ｱﾘ｣ ﾄｲｳﾉﾊ ﾄﾞﾝﾅ ｼﾆｶﾀ ｦ ﾚﾝｿｳ ｻｾﾙｶ ";CHR$(12);:INPUT K$
5520 PRINT"ⓒ"
5530 Q$=CHR$(189)+CHR$(178)+CHR$(188):IF K$=Q$ THEN 5550
5540 GOSUB 740:GOTO 5510
5550 GRAPH I2,C
5560 POSITION160,120:PATTERN-16,U$(5),-16,U$(12),-16,U$(19),-16,U$(26),-16,U$(33),-16,U$(40),-16,U$(6)
5570 PRINT"右K: ｽﾅﾜﾁ,ｲﾛﾊ ｳﾀ ﾉ 5ｷﾞｮｳﾒ ｶﾗ 6ｷﾞｮｳﾒ ﾆ ﾁｭｳﾓｸ ｽﾙﾄ ｢ﾎｦﾂﾉｺﾒﾍ｣ ﾄﾅﾙ｡"
5580 PRINT"右右右右｢ﾎ｣ ﾊ ｢ﾎﾝ｣ ﾉ ｺﾄﾃﾞ,｢ﾎﾝ ｦ ﾂ ﾉ ｺﾒﾍ ﾜﾀｼﾃ ﾎｼｲ｣ ﾄｲｳ ｲﾐ ﾆﾅﾙ｡"
5590 PRINT"右右右右ｺﾉ ﾎﾝ ｶﾞ ｲﾐ ｽﾙﾉﾊ ｼﾞｭｳﾖｳ ﾃﾞｱﾙ｡ ﾅｾﾞﾅﾗ,ﾎﾝ ﾊ ﾋﾄﾏﾛ ｶﾞ ｺﾞｸﾁｭｳ ﾃﾞ ﾐ ｦ ｹｽﾞﾙ ﾖｳﾆ"
5600 PRINT"右右右右ｶｷｼﾀﾀﾒﾃｷﾀ ｢ﾋﾄﾏﾛ ｶｼｭｳ｣ ﾃﾞｱﾘ,｢ﾏﾝﾖｳｼｭｳ｣ ﾉ ｹﾞﾝﾎﾟﾝ ﾄ ﾅｯﾀ ﾓﾉ ﾀﾞｶﾗﾀﾞ｡"
5610 PRINT"右Y: ｶｷﾉﾓﾄﾉ ﾋﾄﾏﾛ...ﾅﾝﾄｲｳ ﾃﾝｻｲ ｶｼﾞﾝ ﾅﾝﾃﾞｼｮｳ｡ ｿｼﾃ ｼﾞﾌﾞﾝ ﾉ ｳﾀ ｦ ｺｳｾｲ ﾆ ﾉｺｽﾀﾒ"
5620 PRINT"右右右右ﾅﾝﾄｲｳ ｽｺﾞｲ ｼｭｳﾈﾝ ｦ ﾓｯﾃ ｳﾝﾒｲ ﾄ ﾀｲｹﾂ ｼﾀｺﾄﾃﾞｼｮｳ｡"
5630 PRINT"右K: ﾚｷｼｼﾞｮｳ ﾃﾞ ﾑｼﾞﾂ ﾉ ﾂﾐ ﾆ ｵﾄｼｲﾚﾗﾚ ｷﾛｸ ｶﾗ ﾅﾏｴ ｦ ﾏｯｻﾂｻﾚﾃ ｼﾝﾃﾞｲｯﾀ ﾋﾄ ﾊｶｽﾞｼﾚﾅｲ｡"
5640 PRINT"右右右右ｼｶｼ ﾋﾄﾏﾛ ﾆﾊ ｴｲｴﾝﾆ ﾅ ｦ ﾄﾄﾞﾒﾙ ｺﾄﾊﾞ ｶﾞ ｱｯﾀ｡ ﾋﾄﾆ ｽｸﾞﾚﾀ ｳﾀ ﾉ ｻｲﾉｳ ｶﾞｱｯﾀ｡"
5650 GOSUB 670
5660 GRAPH I2,C
5670 POSITION160,80:PATTERN-16,U$(41),-16,U$(21),-16,U$(18),-16,U$(33),-16,U$(4)
5680 POSITION160,100:PATTERN-16,U$(27),-16,U$(32),-16,U$(11),-16,U$(16),-16,U$(30),-16,U$(45),-16,U$(26)
5690 POSITION160,120:PATTERN-16,U$(24),-16,U$(8),-16,U$(21),-16,U$(44),-16,U$(38)
5700 POSITION160,140:PATTERN-16,U$(33),-16,U$(33),-16,U$(2),-16,U$(3),-16,U$(15),-16,U$(9),-16,U$(35)
5710 POSITION160,160:PATTERN-16,U$(33),-16,U$(32),-16,U$(11),-16,U$(33),-16,U$(26),-16,U$(33),-16,U$(2)
5720 PRINT"右ﾋﾄﾏﾛ ﾊ ｼﾉ ﾏｷﾞﾜﾆ ﾐｽﾞｶﾗﾉ ｳﾀ ﾆ ｴｲｴﾝ ﾉ ｲﾉﾁ ｦ ﾀｸｼﾀ｡"
5730 PRINT"右ﾋﾄ ﾉ ｲﾉﾁｶﾞｹﾉ ｺﾄﾊﾞ ｶﾞ ｲｶﾅﾙ ｹﾝﾘｮｸ ﾖﾘﾓ ﾂﾖｸ ｼﾞﾀﾞｲ ｦ ｺｴﾃ ﾀｼｶﾆ ﾋﾄ ﾉ ｺｺﾛ ﾆﾄﾄﾞｸ"
5740 PRINT"右ﾓﾉﾃﾞｱﾙ ｺﾄｦ,ｿﾉ ﾋｹﾞｷﾃｷﾅ ｻｲｺﾞ ﾆ ｳｯﾀｴｶｹﾀ ﾉﾃﾞｱﾙ｡"
5750 PRINT"右ｿﾉﾖｳﾅ ﾃﾝｻｲ ﾃﾞｱﾚﾊﾞｺｿ,｢ｱﾒﾂﾁ｣ ｢ｲﾛﾊ ｳﾀ｣ ｿｼﾃ ﾆﾎﾝ ｺﾀﾞｲ ﾉ ｷﾁｮｳ ﾅ ｲｻﾝ ﾃﾞｱﾙ｢ﾏﾝﾖｳｼｭｳ｣"
5760 PRINT"右ｦ ﾄｷ ﾉ ｹﾝﾘｮｸ ﾆ ｼｲﾀｹﾞﾗﾚ ﾅｶﾞﾗﾓ ﾂｸﾘﾀﾞｾﾀ ﾉﾃﾞﾊ ﾅｲﾀﾞﾛｳｶ｡"
5770 PRINT"下右ｺﾄ ﾅﾗ ﾃﾞ ﾒｸﾞﾘｱｯﾀ Yoko ﾄ ｷﾐｶﾞ ｿﾉｺﾞ ﾄﾞｳﾅｯﾀｶﾊ ｿｳｿﾞｳ ﾆ ｵﾏｶｾｼﾖｳ｡"
5780 PRINT"右右右右｢ﾐﾅｿｺﾆ ｵﾌﾙﾀﾏﾓﾉ ｳﾁﾅﾋﾞｷ ｺｺﾛﾊﾖﾘﾃ ｺﾌﾙｺﾉｺﾞﾛ｣.....
5790 PRINT"右右右右｢ｲﾛﾊ ｳﾀ ﾉ ﾅｿﾞ｣ The END"
5800 MUSIC M$:END
