         TITLE 'W E L L P U T -- WYLBUR/TSO I/O INTERFACE FROM PLI'     00000100
*********************************************************************** 00000200
* WELLPUT -                                                           * 00000300
* THE PURPOSE OF THIS MODULE IS TO SIMULATE THE I/O ROUTINES TREAD    * 00000400
* AND TWRITE USED BY THE ADVENTURE GAME.                              * 00000500
*                                                                     * 00000600
* CALLING SEQUENCES:                                                  * 00000700
*                                                                     * 00000800
* TREAD (PROMPT_MESSAGE,PROMPT_LENGTH, MESSAGE_AREA,LENGTH,RTN_CODE)  * 00000900
*                                                                     * 00001000
* TWRITE (MESSAGE,MESSAGE LENGTH,RETURN CODE)                         * 00001100
*                                                                     * 00001200
*********************************************************************** 00001300
TREAD    CSECT                                                          00001400
         SAVE  (14,12),,*                                               00001500
         LR    R12,R15                                                  00001600
         USING TREAD,R12                                                00001700
*********************************************************************** 00001800
*  FIRST WE WILL DO A TPUT FOR THE PROMPT MESSAGE (IF IT EXISTS)      * 00001900
*  THEN.. ASK FOR THE INPUT.                                          * 00002000
*                                                                     * 00002100
*********************************************************************** 00002200
         LR    R5,R1               SAVE INPUT PARM PTR                  00002300
         L     R1,0(,R5)           GET THE PTR TO THE MSG TEXT          00002400
         L     R2,4(,R5)           GET THE LENGTH                       00002500
         L     R0,0(,R2)           ...                                  00002600
         LTR   R0,R0               IS IT THERE ?                        00002700
         BZ    TRE0                NO.. JUST DO TGET                    00002800
         TPUT  (1),(0),R                                                00002900
TRE0     EQU   *                                                        00003000
         CLI   TGETFLAG,X'00'      DONE THE GETSIZE?                    00003100
         BNE   TREGET              YES                                  00003200
         GTSIZE                                                         00003300
         LTR   R15,R15             DID IT WORK?                         00003400
         BNE   TRERTN              NO, RETURN                           00003500
         LTR   R0,R0               IS IT A VDU?                         00003600
         BZ    TTY                                                      00003700
         MVI   TGETFLAG,X'81'      ASIS TGET FOR VDU                    00003800
         B     TREGET                                                   00003900
TTY      MVI   TGETFLAG,X'80'      EDIT TGET FOR TTY                    00004000
TREGET   LM    R2,R4,8(R5)         PICK UP THE ADDRESS OF PARAMETERS    00004100
         LR    R1,R2               GET THE ADDRESS OF THE INPUT TEXT    00004200
         LA    R0,133              HOW MUCH WE CAN STAND                00004300
         ICM   R1,B'1000',TGETFLAG SHOW PROPER TGET STUFF               00004400
         TGET  (1),(0),R                                                00004500
         SR    R9,R9               ZERO R9                              00004600
         CLI   TGETFLAG,X'80'      TTY?                                 00004700
         BE    GOTRTN              YES, OK                              00004800
         NI    0(R2),X'0F'         PREPARE AID BYTE                     00004900
         IC    R9,0(,R2)           GET PFK NUMBER                       00005000
         LA    R10,6               R10 = 6                              00005100
         SR    R1,R10              CORRECT THE MSG LENGTH               00005200
         BP    NOTNULL             SOME TEXT TO RETURN                  00005300
         SR    R1,R1               LENGTH = 0                           00005400
         B     GOTRTN              RETURN                               00005500
NOTNULL  MVC   0(127,R2),6(R2)     OVERLAY VDU CONTROL CHARS            00005600
GOTRTN   OC    0(133,R2),BLANKS    UPPER CASE THIS SUCKER               00005700
         ST    R1,0(,R3)           STORE MESSAGE LENGTH                 00005800
         ST    R9,0(,R4)           STORE CCODE (PFK #)                  00005900
TRERTN   RETURN (14,12),RC=(15)    USE TGET RETURN CODE                 00006000
         DROP  R12                                                      00006100
         SPACE 2                                                        00006200
TGETFLAG DC    X'00'               FILLED IN AFTER GTSIZE               00006300
BLANKS   DC    CL133' '                                                 00006400
         LTORG                                                          00006500
         EJECT                                                          00006600
*********************************************************************** 00006700
* TWRITE -                                                            * 00006800
*                                                                     * 00006900
* ISSUE A TPUT FOR THE CALLING PROGRAM..                              * 00007000
*                                                                     * 00007100
*                                                                     * 00007200
*********************************************************************** 00007300
TWRITE   CSECT                                                          00007400
         SAVE  (14,12)                                                  00007500
         LR    R12,R15                                                  00007600
         USING TWRITE,R12                                               00007700
         LR    R5,R1               SAVE PTR TO INPUT PARMS              00007800
         L     R1,0(R5)            PTR TO OUTPUT TEXT                   00007900
         L     R2,4(R5)            GET OUTPUT LENGTH                    00008000
         L     R0,0(R2)            ...                                  00008100
         TPUT  (1),(0),R           DO IT                                00008200
         L     R1,8(R5)            GET THE CCODE PTR                    00008300
         ST    R15,0(R1)           SAVE IT.                             00008400
         RETURN (14,12),RC=0                                            00008500
         DROP  R12                                                      00008600
         SPACE 2                                                        00008700
         LTORG                                                          00008800
         TITLE 'RETURN TIME IN TIMER UNITS TO INIT RANDOM NUMBER'       00008900
ITIME    CSECT                                                          00009000
         STM   R14,R12,12(R13)     SAVE REGISTERS                       00009100
         LR    R12,R15             ESTAB BASE                           00009200
         USING ITIME,R12           TELL ASM                             00009300
         LA    R8,ISAV             GET A(MY SAVE)                       00009400
         ST    R8,8(R13)           BACK CHAIN                           00009500
         ST    R13,4(R8)           FORWARD CHAIN                        00009600
         LR    R13,R8              POINT TO IT                          00009700
         SPACE 3                                                        00009800
         L     R2,0(R1)            R2 -> FULLWORD PARM                  00009900
         TIME  TU                                                       00010000
         N     R0,MASK             TURN TO NUMBER 0-511                 00010100
         ST    R0,0(R2)            SAVE IN PARM                         00010200
         L     R13,4(R13)          RELOAD R13                           00010300
         LM    R14,R12,12(R13)     RESTORE REST OF REGISTERS            00010400
         SR    R15,R15             CLEAR RC                             00010500
         BR    R14                 RETURN                               00010600
         SPACE                                                          00010700
ISAV     DC    18F'0'              SAVE AREA                            00010800
MASK     DC    X'000001FF'         512-1                                00010900
         TITLE 'WIZARD WARNING MESSAGE SUBROUTINES'                     00011000
WARNMSG  CSECT                                                          00011100
         SAVE  (14,12)                                                  00011200
         LR    R12,R15                                                  00011300
         USING WARNMSG,R12                                              00011400
         L     R1,0(0,R1)               R1 --> 16 BYTE PARAMETER        00011500
         SR    R4,R4                    CLEAR REG 4                     00011600
         SR    R5,R5                    CLEAR REG 4                     00011700
         S     R4,0(0,R1)               DECODE FIRST 4 BYTES            00011800
         S     R5,4(0,R1)               DECODE SECOND 4 BYTES           00011900
         STM   R4,R5,WIZ                & STORE                         00012000
         MVI   WIZ+7,C' '               BLANK LAST BYTE OF USERID       00012100
         MVC   USR(8),8(R1)             LAST 8 BYTES = USER'S USERID    00012200
         CLI   7(R1),C'A'               IF EIGHTH BYTE = C'A' ==>       00012300
         BE    AUTHMSG                               AUTHORIZED USER    00012400
         TPUT  UNAUTH,42,EDIT,USERIDL=WIZ                               00012500
         B     WMRTN                                                    00012600
AUTHMSG  MVI   AUTH,C'A'                ADJUST MESAGE TEXT              00012700
         TPUT  AUTH,40,EDIT,USERIDL=WIZ                                 00012800
WMRTN    MVC   WIZ,USR                  ERASE TARGET USERID             00012900
         RETURN (14,12),RC=(15)         USE RETURN CODE FROM TPUT       00013000
         DROP  R12                                                      00013100
         DS    0F                                                       00013200
WIZ      DC    CL8' '                                                   00013300
UNAUTH   DC    C'Un'                                                    00013400
AUTH     DC    C'authorized access of Program by '                      00013500
USR      DC    CL8' '                                                   00013600
         LTORG                                                          00013700
         TITLE 'SUPPLY PASSWORD TYPING AREA'                            00013800
WHISPER  CSECT                                                          00013900
         SAVE  (14,12)                                                  00014000
         LR    R12,R15                                                  00014100
         USING WHISPER,R12                                              00014200
         TPUT  BUFFER,11,FULLSCR                                        00014300
RESTORE  RETURN (14,12),RC=(15)                                         00014400
         DROP  R12                                                      00014500
BUFFER   DC    X'C11D0C13'                                              00014600
         DC    CL5' '                                                   00014700
         DC    X'1D28'                                                  00014800
         LTORG                                                          00014900
         TITLE 'RETURN CURRENT YYDDD IN FIXED DEC(5,0) TO PL/1 PGM'     00015000
DECDATE  CSECT                                                          00015100
         STM   R14,R12,12(R13)                                          00015200
         L     R3,0(,R1)                                                00015300
         TIME                                                           00015400
         ST    R15,16(,R13)      STORE RETURN CODE                      00015500
         STCM  R1,7,0(R3)        PARAMETER SHOULD BE FIXED DEC(5,0)     00015600
         LM    R14,R12,12(R13)                                          00015700
         BR    R14                                                      00015800
         SPACE 5                                                        00015900
R0       EQU   0                                                        00016000
R1       EQU   1                                                        00016100
R2       EQU   2                                                        00016200
R3       EQU   3                                                        00016300
R4       EQU   4                                                        00016400
R5       EQU   5                                                        00016500
R6       EQU   6                                                        00016600
R7       EQU   7                                                        00016700
R8       EQU   8                                                        00016800
R9       EQU   9                                                        00016900
R10      EQU   10                                                       00017000
R11      EQU   11                                                       00017100
R12      EQU   12                                                       00017200
R13      EQU   13                                                       00017300
R14      EQU   14                                                       00017400
R15      EQU   15                                                       00017500
         END                                                            00017600
  