*PROCESS A,X,OP,OF,M,MAP,INT,AG,NNUM,S,LMSG,MAR(2,72,1),N('PROGRAM');   00010000
*PROCESS OPT(2),NIS,LC(56);                                             00020000
 /***              ADVENTURE  -  PL/1 VERSION 4.0                  ***/ 00030000
                                                                        00040000
  /*                                                                    00050000
     ADVENTURES                                                         00060000
                               SECRET MESSAGE:   ~ ==@ ") $ @"¦ )#:     00070000
     VERSION NUMBER RATIONALE:                                          00080000
             VERSION 0  -  ORIGINAL VERSION (WHATEVER THAT WAS)         00090000
             VERSION 1  -  COMMON FORTRAN VERSION                       00100000
             VERSION 2  -  PL/1 VERSION AS DISTRIBUTED BY SHARE         00110000
             VERSION 3  -  ENHANCED PL/1 VERSION (FROM VERSION 2)       00120000
             VERSION 4  -  THIS ENHANCED PL/1 VERSION (FROM VERSION 3)  00130000
                                                                        00140000
             FACOM VERSION MAY HAVE TO BE ENLARGED TO HANDLE            00150000
             INCREASED DATA BASE SIZE DUE TO FACOM EXTENDED ATTRIBUTE   00160000
             BYTES.  "*PROCESS" CARD OPTIONS "OPT(3),NOAIM" SHOULD BE   00170000
             USED.       GP@SECV, 4/82.                                 00180000
             (EXTENDED ATTRIBUTES NO LONGER SUPPORTED FROM C83031.)     00190000
                                                                        00200000
     CURRENT LIMITS:                                                    00210000
       11200 WORDS OF MESSAGE TEXT (LINES, LINSIZ).                     00220000
         800 TRAVEL OPTIONS (TRAVEL, TRVSIZ).                           00230000
         330 VOCABULARY WORDS (KTAB, ATAB, TABSIZ, ATABB).              00240000
         150 LOCATIONS (LTEXT, STEXT, KEY, COND, ABB, ATLOC, LOCSIZ).   00250000
         100 OBJECTS (PLAC, PLACE, FIXD, FIXED, LINK (TWICE), PTEXT,    00260000
                     PROP).                                             00270000
          50 "ACTION" VERBS (ACTSPK, VRBSIZ).                           00280000
         230 RANDOM MESSAGES (RTEXT, RTXSIZ).                           00290000
          12 DIFFERENT PLAYER CLASSIFICATIONS (CTEXT, CVAL, CLSMAX).    00300000
          20 HINTS, LESS 3 (HINTLC, HINTED, HINTS, HNTSIZ).             00310000
          55 MAGIC MESSAGES (MTEXT, MAGSIZ).                            00320000
                                                                        00330000
    THERE ARE ALSO LIMITS WHICH CANNOT BE EXCEEDED DUE TO THE           00340000
    STRUCTURE OF THE DATABASE.  (E.G., THE VOCABULARY USES              00350000
    N/1000 TO DETERMINE WORD TYPE, SO THERE CAN'T BE MORE               00360000
    THAN 1000 WORDS.) THESE UPPER LIMITS ARE:                           00370000
                                                                        00380000
       49999 MESSAGE TEXT WORDS                                         00390000
        1000 NON-SYNONYMOUS VOCABULARY WORDS                            00400000
         300 LOCATIONS                                                  00410000
         100 OBJECTS                                                    00420000
                                                                        00430000
    SUSPEND/RESTORE PROCESSING, IN-CORE HASHING AND ENCODED DATA        00440000
    BASE, THE "RED RUBY", ALL MAGIC MESSAGE AND WIZARD PROCESSING, AND  00450000
    THE CRUCIAL CLEAR SCREENS ADDED BY GP, 12/81.                       00460000
    DYNALLOC CALLS AND "LIBERATOR" PROCESSING BY GP, 7/83.              00470000
    WEEK-END ALL-HOURS FINALLY FIXED BY GP, 10/84.    Y2K - GP 8/00.    00480001
  */                                                                    00490000
                                                                        00500000
 PROGRAM: PROCEDURE (INPARM)  OPTIONS (MAIN)  REORDER;                  00510000
                                                                        00520000
       DCL  OBJECT       FILE RECORD                                    00530000
            ENVIRONMENT(F RECSIZE(80) CONSECUTIVE);                     00540000
                                                                        00550000
       DCL  SOURCE       FILE RECORD                                    00560000
            ENVIRONMENT(F RECSIZE(80) CONSECUTIVE);                     00570000
                                                                        00580000
       DCL  STORAGE      FILE RECORD                                    00590000
            ENVIRONMENT(F RECSIZE(4800) BLKSIZE(4800) CONSECUTIVE);     00600000
                                                                        00610000
       DCL  SYSPRINT     FILE OUTPUT PRINT;                             00620000
                                                                        00630000
       DCL  RANDU ENTRY (FIXED BIN(31),FIXED BIN(31),FLOAT DEC(6))      00640000
                                        OPTIONS (ASM INTER);            00650000
                                                                        00660000
       DCL  TREAD ENTRY (CHAR(133),FIXED BIN(31),CHAR(133),             00670000
            FIXED BIN(31),FIXED BIN(31)) OPTIONS (ASM INTER RETCODE);   00680000
                                                                        00690000
       DCL  TWRITE ENTRY (CHAR(133),FIXED BIN(31),FIXED BIN(31))        00700000
                                        OPTIONS (ASM INTER);            00710000
                                                                        00720000
       DCL  ITIME ENTRY (FIXED BIN(31)) OPTIONS (ASM INTER);            00730000
                                                                        00740000
       DCL  CLRSCRN             ENTRY   OPTIONS (ASM INTER RETCODE);    00750000
                                                                        00760000
       DCL  DECDATE             ENTRY   OPTIONS (ASM INTER);            00770000
                                                                        00780000
       DCL  R062A10             ENTRY   OPTIONS (ASM INTER);            00790000
                                                                        00800000
       DCL  WARNMSG             ENTRY   OPTIONS (ASM INTER RETCODE);    00810000
                                                                        00820000
       DCL  WHISPER             ENTRY   OPTIONS (ASM INTER RETCODE);    00830000
                                                                        00840000
       DCL  INPARM              CHARACTER (100)  CONNECTED VARYING;     00850000
                                                                        00860000
       DCL  (ABS,ADDR,DATETIME,INDEX,LENGTH,LOW,MAX,MIN,MOD,ONCODE,     00870001
        PLIRETC,PLIRETV,REPEAT,SUBSTR,TIME,TRANSLATE,VERIFY)  BUILTIN;  00880001
                                                                        00890000
       DCL  PLIXOPT             CHARACTER (11)  EXTERNAL VARYING        00900000
                                STATIC INIT('ISASIZE(4K)');             00910000
                                                                        00920000
      %DCL  COMPILETIME         BUILTIN;                                00930000
      %DCL  MACROTIME           CHARACTER;                              00940000
      %DCL  QUOTE               CHARACTER;                              00950000
      %DCL  XLATETO             CHARACTER;                              00960000
      %DCL  XLATEFR             CHARACTER;                              00970000
      %QUOTE = '''';                                                    00980000
      %MACROTIME = QUOTE || COMPILETIME || QUOTE;                       00990000
      %XLATETO = QUOTE || 'abcdefghijklmnopqrstuvwxyz' || QUOTE;        01000000
      %XLATEFR = QUOTE || 'ABCDEFGHIJKLMNOPQRSTUVWXYZ' || QUOTE;        01010000
                                                                        01020000
       DCL CAN                 EVENT;                                   01030000
                                                                        01040000
       DCL CARD                CHARACTER(80) STATIC INIT(' ');          01050000
       DCL COLS(40)            FIXED BIN(15) BASED(ADDR(CARD));         01060000
                                                                        01070000
       DCL MSGPRMS             CHARACTER(16) STATIC INIT(' ');          01080000
                                                                        01090000
       DCL TSOID               CHARACTER (8) STATIC INIT(' ');          01100000
       DCL TEMPNAME            CHARACTER (8) STATIC INIT(' ');          01110000
                                                                        01120000
       DCL SEQ#                CHARACTER (4) STATIC INIT('0000');       01130000
       DCL CARD#               PICTURE'9999' DEFINED SEQ#;              01140000
                                                                        01150000
       DCL DATE_STG            CHARACTER (17) STATIC INIT((17)'0');     01160001
                                                                        01170000
       DCL TIME_CHR            CHARACTER (9) DEFINED DATE_STG POS(9);   01180001
       DCL CHR_HHMM            CHARACTER (4) DEFINED DATE_STG POS(9);   01190001
                                                                        01200001
       DCL DATE_PIC            PICTURE'99999999' DEFINED DATE_STG;      01210001
       DCL PIC_YEAR            PICTURE'9999' DEFINED DATE_STG;          01220001
       DCL PIC_MONTH           PICTURE'99' DEFINED DATE_STG POS(5);     01230001
       DCL PIC_DAY             PICTURE'99' DEFINED DATE_STG POS(7);     01240001
       DCL PIC_HHMM            PICTURE'9999' DEFINED DATE_STG POS(9);   01250001
       DCL PIC_HH              PICTURE'99' DEFINED DATE_STG POS(9);     01260001
       DCL PIC_MM              PICTURE'99' DEFINED DATE_STG POS(11);    01270001
                                                                        01280000
       DCL PUTDATE             CHAR (10) STATIC INIT('    /  /  ');     01290001
                                                                        01300000
       DCL PUTHHMM             CHARACTER (5) STATIC INIT('  :  ');      01310000
                                                                        01320000
       DCL YYDDD               FIXED DEC (5) STATIC INIT(0);            01330000
       DCL YDCHR               CHARACTER (5) STATIC INIT('00000');      01340000
       DCL YDPIC               PICTURE '99999' DEFINED YDCHR;           01350000
       DCL DIGIT               PICTURE '9' DEFINED YDCHR;               01360000
                                                                        01370000
       DCL TEST_WORD           FIXED BIN(31) STATIC INIT(0);            01380000
       DCL PW                  CHARACTER (4) BASED(ADDR(TEST_WORD));    01390000
                                                                        01400000
       DCL BITPAT              BIT (8) STATIC INIT('00000010'B);        01410000
       DCL HEX02               CHARACTER (1) BASED(ADDR(BITPAT));       01420000
                                                                        01430000
       DCL LOC_LINE            CHARACTER(30) STATIC INIT(' ');          01440000
                                                                        01450000
       DCL TIMES(4)            CHARACTER (4) STATIC INIT((4)(4)'0');    01460000
                                                                        01470000
       DCL INHIB               CHARACTER (1) STATIC INIT('N');          01480000
                                                                        01490000
       DCL TTYPE               CHARACTER (1) STATIC INIT('T');          01500000
                                                                        01510000
       DCL RETRYSTR            CHAR(133) VAR STATIC INIT(' ');          01520000
                                                                        01530000
       DCL 1 PIC_VECTOR(6)     DEFINED LOC_LINE,                        01540000
             2 PLOC            PICTURE '999',                           01550000
             2 FILL            CHARACTER (2);                           01560000
                                                                        01570000
       DCL 1 TXTCOM            STATIC,                                  01580000
             2 CTEXT(12)       FIXED BIN(31) INIT((12)0),               01590000
             2 LTEXT(150)      FIXED BIN(31) INIT((150)0),              01600000
             2 MTEXT(55)       FIXED BIN(31) INIT((55)0),               01610000
             2 PTEXT(100)      FIXED BIN(31) INIT((100)0),              01620000
             2 RTEXT(230)      FIXED BIN(31) INIT((230)0),              01630000
             2 STEXT(150)      FIXED BIN(31) INIT((150)0),              01640000
             2 TRAVEL(800)     FIXED BIN(31) INIT((800)0),              01650000
             2 LINES(11200)    CHARACTER (5) INIT((11200)(5)' ');       01660000
                                                                        01670000
       DCL 1 VOCCOM            STATIC,                                  01680000
             2 KTAB(330)       FIXED BIN(31) INIT((330)0),              01690000
             2 ATAB(330)       CHARACTER (5) INIT((330)(5)' '),         01700000
             2 TABSIZ          FIXED BIN(31) INIT(330);                 01710000
                                                                        01720000
       DCL ATABB(330)          BIT(40) BASED(ADDR(ATAB));               01730000
                                                                        01740000
       DCL ACTSPK(50)          STATIC FIXED BIN(31)  INIT((50)0);       01750000
                                                                        01760000
       DCL 1 PLACOM            STATIC,                                  01770000
             2 COND(150)       FIXED BIN(31) INIT((150)0),              01780000
             2 FIXD(100)       FIXED BIN(31) INIT((100)0),              01790000
             2 KEY(150)        FIXED BIN(31) INIT((150)0),              01800000
             2 PLAC(100)       FIXED BIN(31) INIT((100)0);              01810000
                                                                        01820000
       DCL WEEK_DAY(0:6)      CHARACTER (10)  STATIC   INIT             01830000
                                             ('SUNDAY   ','MONDAY   ',  01840000
          'TUESDAY  ','WEDNESDAY','THURSDAY ','FRIDAY   ','SATURDAY '); 01850000
       DCL CMONTH(12)         CHARACTER  (9)  STATIC VARYING   INIT     01860000
          ('JANUARY','FEBRUARY','MARCH','APRIL','MAY','JUNE','JULY',    01870000
           'AUGUST','SEPTEMBER','OCTOBER','NOVEMBER','DECEMBER');       01880000
                                                                        01890000
       DCL INTEGER             FIXED BIN(15,0) STATIC INIT(0);          01900000
       DCL 1 BYTE_NUMBERS      BASED (ADDR(INTEGER)),                   01910000
             2 BYTE_FILL       CHARACTER (1),                           01920000
             2 BYTE_NUM        CHARACTER (1);                           01930000
                                                                        01940000
       DCL ADVREC              CHARACTER(4800) STATIC INIT(' ');        01950000
                                                                        01960000
   DCL 1  ADVARS STATIC,                                                01970000
       2  NAME         CHARACTER (8)  INIT(' '),                        01980000
       2  USERID       CHARACTER (8)  INIT(' '),                        01990000
       2  ABB(150)     FIXED BIN(31)  INIT((150)0),                     02000000
       2  ABBNUM       FIXED BIN(31)  INIT(5),                          02010000
       2  ATLOC(150)   FIXED BIN(31)  INIT((150)0),                     02020000
       2  ATTACK       FIXED BIN(31)  INIT(0),                          02030000
       2  AXE          FIXED BIN(31)  INIT(0),                          02040000
       2  BACK         FIXED BIN(31)  INIT(0),                          02050000
       2  BATTER       FIXED BIN(31)  INIT(0),                          02060000
       2  BEAR         FIXED BIN(31)  INIT(0),                          02070000
       2  BIRD         FIXED BIN(31)  INIT(0),                          02080000
       2  BONUS        FIXED BIN(31)  INIT(0),                          02090000
       2  BOTTLE       FIXED BIN(31)  INIT(0),                          02100000
       2  BRACELET     FIXED BIN(31)  INIT(0),                          02110000
       2  CAGE         FIXED BIN(31)  INIT(0),                          02120000
       2  CAVE         FIXED BIN(31)  INIT(0),                          02130000
       2  CCODE        FIXED BIN(31)  INIT(0),                          02140000
       2  CH           FIXED BIN(31)  INIT(0),                          02150000
       2  CHAIN        FIXED BIN(31)  INIT(0),                          02160000
       2  CHASM        FIXED BIN(31)  INIT(0),                          02170000
       2  CHEST        FIXED BIN(31)  INIT(0),                          02180000
       2  CHLOC        FIXED BIN(31)  INIT(114),                        02190000
       2  CHLOC2       FIXED BIN(31)  INIT(140),                        02200000
       2  CLAM         FIXED BIN(31)  INIT(0),                          02210000
       2  CLOCK1       FIXED BIN(31)  INIT(30),                         02220000
       2  CLOCK2       FIXED BIN(31)  INIT(50),                         02230000
       2  CLSMAX       FIXED BIN(31)  INIT(12),                         02240000
       2  CLSSES       FIXED BIN(31)  INIT(1),                          02250000
       2  CLSSIZ       FIXED BIN(31)  INIT(12),                         02260000
       2  COINS        FIXED BIN(31)  INIT(0),                          02270000
       2  CVAL(12)     FIXED BIN(31)  INIT((12)0),                      02280000
       2  DALTLC       FIXED BIN(31)  INIT(18),                         02290000
       2  DAY#         FIXED BIN(31)  INIT(0),                          02300000
       2  DETAIL       FIXED BIN(31)  INIT(0),                          02310000
       2  DFLAG        FIXED BIN(31)  INIT(0),                          02320000
       2  DKILL        FIXED BIN(31)  INIT(0),                          02330000
       2  DLOC(6)      FIXED BIN(31)  INIT(19,27,33,44,64,114),         02340000
       2  DOOR         FIXED BIN(31)  INIT(0),                          02350000
       2  DPRSSN       FIXED BIN(31)  INIT(0),                          02360000
       2  DRAGON       FIXED BIN(31)  INIT(0),                          02370000
       2  DSEEN(8)     BIT       (1)  INIT((8)(1)'0'B),                 02380000
       2  HINTED(24)   BIT       (1)  INIT((24)(1)'0'B),                02390000
       2  DTOTAL       FIXED BIN(31)  INIT(0),                          02400000
       2  DWARF        FIXED BIN(31)  INIT(0),                          02410000
       2  EGGS         FIXED BIN(31)  INIT(0),                          02420000
       2  ELAPSED      FIXED BIN(31)  INIT(0),                          02430000
       2  EMRALD       FIXED BIN(31)  INIT(0),                          02440000
       2  ENTRNC       FIXED BIN(31)  INIT(0),                          02450000
       2  FFIELD       FIXED BIN(31)  INIT(0),                          02460000
       2  FIND         FIXED BIN(31)  INIT(19),                         02470000
       2  FISSUR       FIXED BIN(31)  INIT(0),                          02480000
       2  FIXED(100)   FIXED BIN(31)  INIT((100)0),                     02490000
       2  FOO          FIXED BIN(31)  INIT(0),                          02500000
       2  FOOBAR       FIXED BIN(31)  INIT(0),                          02510000
       2  FOOD         FIXED BIN(31)  INIT(0),                          02520000
       2  FROM         FIXED BIN(31)  INIT(0),                          02530000
       2  GRATE        FIXED BIN(31)  INIT(0),                          02540000
       2  HHMM         FIXED BIN(31)  INIT(0),                          02550000
       2  HINT         FIXED BIN(31)  INIT(0),                          02560000
       2  HINTLC(20)   FIXED BIN(31)  INIT((20)0),                      02570000
       2  HINTS(20,4)  FIXED BIN(31)  INIT((80)0),                      02580000
       2  HNTMAX       FIXED BIN(31)  INIT(0),                          02590000
       2  HNTSIZ       FIXED BIN(31)  INIT(20),                         02600000
       2  HOLDNG       FIXED BIN(31)  INIT(0),                          02610000
       2  I            FIXED BIN(31)  INIT(0),                          02620000
       2  INLEN        FIXED BIN(31)  INIT(0),                          02630000
       2  INVENT       FIXED BIN(31)  INIT(20),                         02640000
       2  IWEST        FIXED BIN(31)  INIT(0),                          02650000
       2  INSTR        CHARACTER(133) INIT(' '),                        02660000
       2  JUNK1        CHARACTER (5)  INIT(' '),                        02670000
       2  JUNK2        CHARACTER (5)  INIT(' '),                        02680000
       2  JUNK3        CHARACTER (5)  INIT(' '),                        02690000
       2  IX           FIXED BIN(31)  INIT(65549),                      02700000
       2  IY           FIXED BIN(31)  INIT(0),                          02710000
       2  J            FIXED BIN(31)  INIT(0),                          02720000
       2  K            FIXED BIN(31)  INIT(0),                          02730000
       2  KEYS         FIXED BIN(31)  INIT(0),                          02740000
       2  KK           FIXED BIN(31)  INIT(0),                          02750000
       2  KKWORD       CHARACTER (2)  INIT(' '),                        02760000
       2  TKWORD(10)   CHARACTER (1)  INIT((10)(1)' '),                 02770000
       2  KNFLOC       FIXED BIN(31)  INIT(0),                          02780000
       2  KNIFE        FIXED BIN(31)  INIT(0),                          02790000
       2  K2           FIXED BIN(31)  INIT(0),                          02800000
       2  L            FIXED BIN(31)  INIT(0),                          02810000
       2  LADDER       FIXED BIN(31)  INIT(0),                          02820000
       2  LAMP         FIXED BIN(31)  INIT(0),                          02830000
       2  LIMIT        FIXED BIN(31)  INIT(0),                          02840000
       2  LINK(200)    FIXED BIN(31)  INIT((200)0),                     02850000
       2  LINSIZ       FIXED BIN(31)  INIT(11200),                      02860000
       2  LINUSE       FIXED BIN(31)  INIT(1),                          02870000
       2  LL           FIXED BIN(31)  INIT(0),                          02880000
       2  LOC          FIXED BIN(31)  INIT(0),                          02890000
       2  LOCK         FIXED BIN(31)  INIT(6),                          02900000
       2  LOCSIZ       FIXED BIN(31)  INIT(150),                        02910000
       2  LOOK         FIXED BIN(31)  INIT(0),                          02920000
       2  M            FIXED BIN(31)  INIT(0),                          02930000
       2  MAGSIZ       FIXED BIN(31)  INIT(55),                         02940000
       2  MAGZIN       FIXED BIN(31)  INIT(0),                          02950000
       2  MAXDIE       FIXED BIN(31)  INIT(0),                          02960000
       2  MAXTRS       FIXED BIN(31)  INIT(79),   /* MAX TRES. OBJ # */ 02970000
       2  MESSAG       FIXED BIN(31)  INIT(0),                          02980000
       2  MIRROR       FIXED BIN(31)  INIT(0),                          02990000
       2  MXSCOR       FIXED BIN(31)  INIT(0),                          03000000
       2  NEWLOC       FIXED BIN(31)  INIT(0),                          03010000
       2  NUGGET       FIXED BIN(31)  INIT(0),                          03020000
       2  NULLX        FIXED BIN(31)  INIT(0),                          03030000
       2  NUMDIE       FIXED BIN(31)  INIT(0),                          03040000
       2  OBJ          FIXED BIN(31)  INIT(0),                          03050000
       2  ODLOC(6)     FIXED BIN(31)  INIT((6)0),                       03060000
       2  OIL          FIXED BIN(31)  INIT(0),                          03070000
       2  OLDLC2       FIXED BIN(31)  INIT(0),                          03080000
       2  OLDLOC       FIXED BIN(31)  INIT(-1),   /* START DB READ */   03090000
       2  ORAC         FIXED BIN(31)  INIT(0),                          03100000
       2  OUTSTR       CHAR(133) VAR  INIT(' '),                        03110000
       2  REPLY        CHARACTER (5)  INIT(' '),                        03120000
       2  OYSTER       FIXED BIN(31)  INIT(0),                          03130000
       2  PEARL        FIXED BIN(31)  INIT(0),                          03140000
       2  PILLOW       FIXED BIN(31)  INIT(0),                          03150000
       2  PLACE(100)   FIXED BIN(31)  INIT((100)0),                     03160000
       2  PLANT        FIXED BIN(31)  INIT(0),                          03170000
       2  PLANT2       FIXED BIN(31)  INIT(0),                          03180000
       2  POSN         FIXED BIN(31)  INIT(0),                          03190000
       2  PROP(100)    FIXED BIN(31)  INIT((100)0),                     03200000
       2  PYRAM        FIXED BIN(31)  INIT(0),                          03210000
       2  RESTORE      FIXED BIN(31)  INIT(34),                         03220000
       2  ROD          FIXED BIN(31)  INIT(0),                          03230000
       2  ROD2         FIXED BIN(31)  INIT(0),                          03240000
       2  RTXSIZ       FIXED BIN(31)  INIT(230),                        03250000
       2  RUBY         FIXED BIN(31)  INIT(0),                          03260000
       2  RUG          FIXED BIN(31)  INIT(0),                          03270000
       2  SAY          FIXED BIN(31)  INIT(3),                          03280000
       2  SCORE        FIXED BIN(31)  INIT(0),                          03290000
       2  SECT         FIXED BIN(31)  INIT(0),                          03300000
       2  SNAKE        FIXED BIN(31)  INIT(0),                          03310000
       2  SPICES       FIXED BIN(31)  INIT(0),                          03320000
       2  SPK          FIXED BIN(31)  INIT(0),                          03330000
       2  STEPS        FIXED BIN(31)  INIT(0),                          03340000
       2  STICK        FIXED BIN(31)  INIT(0),                          03350000
       2  SUSPEND      FIXED BIN(31)  INIT(30),                         03360000
       2  SUSPEND#     FIXED BIN(31)  INIT(0),                          03370000
       2  TABLET       FIXED BIN(31)  INIT(0),                          03380000
       2  TABNDX       FIXED BIN(31)  INIT(0),                          03390000
       2  TALLY        FIXED BIN(31)  INIT(0),                          03400000
       2  TALLY2       FIXED BIN(31)  INIT(0),                          03410000
       2  TEMP         FIXED BIN(31)  INIT(0),                          03420000
       2  THROW        FIXED BIN(31)  INIT(17),                         03430000
       2  TK(20)       FIXED BIN(31)  INIT((20)0),                      03440000
       2  TODAY        FIXED BIN(31)  INIT(0),                          03450000
       2  TRIDNT       FIXED BIN(31)  INIT(0),                          03460000
       2  TROLL        FIXED BIN(31)  INIT(0),                          03470000
       2  TROLL2       FIXED BIN(31)  INIT(0),                          03480000
       2  TRVS         FIXED BIN(31)  INIT(1),                          03490000
       2  TRVSIZ       FIXED BIN(31)  INIT(800),                        03500000
       2  TURNS        FIXED BIN(31)  INIT(0),                          03510000
       2  VASE         FIXED BIN(31)  INIT(0),                          03520000
       2  VEND         FIXED BIN(31)  INIT(0),                          03530000
       2  VERB         FIXED BIN(31)  INIT(0),                          03540000
       2  VERSION      CHARACTER (4)  INIT('V4.0'),                     03550000
       2  VRBSIZ       FIXED BIN(31)  INIT(50),                         03560000
       2  WATER        FIXED BIN(31)  INIT(0),                          03570000
       2  WD1          CHARACTER (5)  INIT(' '),                        03580000
       2  WD1X         CHARACTER (5)  INIT(' '),                        03590000
       2  WD2          CHARACTER (5)  INIT(' '),                        03600000
       2  WD2X         CHARACTER (5)  INIT(' '),                        03610000
       2  WORD         FIXED BIN(31)  INIT(0),                          03620000
       2  WORDEND      FIXED BIN(31)  INIT(0),                          03630000
       2  WORDSIZE     FIXED BIN(31)  INIT(0),                          03640000
       2  WORDSTRT     FIXED BIN(31)  INIT(0),                          03650000
       2  Y            FLOAT DEC (6)  INIT(0),                          03660000
       2  ZZZZZZ(29)   FIXED BIN(31)  INIT((29)0),   /* SPARE FILLER */ 03670000
       2  KQ           FIXED BIN(15)  INIT(0),                          03680000
       2  BLKLIN       BIT       (1)  INIT('1'B),                       03690000
       2  CLOSED       BIT       (1)  INIT('0'B),                       03700000
       2  CLOSNG       BIT       (1)  INIT('0'B),                       03710000
       2  DEMOGM       BIT       (1)  INIT('0'B),                       03720000
       2  EOCARD       BIT       (1)  INIT('0'B),                       03730000
       2  GAVEUP       BIT       (1)  INIT('0'B),                       03740000
       2  LMWARN       BIT       (1)  INIT('0'B),                       03750000
       2  LOGON        BIT       (1)  INIT('0'B),                       03760000
       2  NOSTG        BIT       (1)  INIT('0'B),                       03770000
       2  PANIC        BIT       (1)  INIT('0'B),                       03780000
       2  RLD          BIT       (1)  INIT('0'B),                       03790000
       2  SCORNG       BIT       (1)  INIT('0'B),                       03800000
       2  UNAUTH       BIT       (1)  INIT('0'B),                       03810000
       2  WIZARD       BIT       (1)  INIT('0'B),                       03820000
       2  WZDARK       BIT       (1)  INIT('0'B),                       03830000
       2  YEA          BIT       (1)  INIT('0'B);                       03840000
 /*                                                                     03850000
    BLKLIN IS THE BLANK LINE FLAG FOR LINEOUT                           03860000
    CLOSED SAYS WHETHER WE'RE ALL THE WAY CLOSED                        03870000
    CLOSNG SAYS WHETHER IT'S CLOSING TIME YET                           03880000
    DEMOGM SAYS WHETHER IT'S A DEMONSTRATION GAME                       03890000
    EOCARD IS THE END OF FILE FLAG FOR CARD IMAGE FILES OBJECT & SOURCE 03900000
    GAVEUP SAYS WHETHER HE EXITED VIA "QUIT"                            03910000
    LMWARN SAYS WHETHER HE'S BEEN WARNED ABOUT LAMP GOING DIM           03920000
    LOGON IS THE SYSPRINT LOGGING FLAG                                  03930000
    NOSTG IS THE END OF FILE FLAG FOR STORAGE                           03940000
    PANIC SAYS WHETHER HE'S FOUND OUT HE'S TRAPPED IN THE CAVE          03950000
    SCORNG INDICATES TO THE SCORE ROUTINE WHETHER WE'RE DOING           03960000
     A "SCORE" COMMAND                                                  03970000
    UNAUTH SAYS WHETHER TSO USERID IS AUTHORIZED FOR THIS PROGRAM       03980000
    WIZARD SAYS WHETHER HE'S A WIZARD                                   03990000
    WZDARK SAYS WHETHER THE LOC HE'S LEAVING WAS DARK                   04000000
    YEA IS RANDOM YES/NO REPLY                                          04010000
                                                                        04020000
    INHIB  INHIBITS OUTPUT SO MESSAGE CAN HAVE VARIABLES ADDED TO IT.   04030000
           (ONLY GET FIRST LINE OF MESSAGE.)                            04040000
    RETRYSTR IS THE SAVE AREA FOR THE LAST NON-BLANK MESSAGE            04050000
             TO BE REPRINTED AFTER PA2 KEY IS USED ON A VDU.            04060000
    TTYPE  SAYS WHETHER A VDU OR A TTY IS BEING USED.                   04070000
  */                                                                    04080000
 /*  CONTROL BLOCK DATA STRUCTURES  */                                  04090000
                                                                        04100000
       DCL HEX21C              FIXED BIN(31) STATIC INIT(1000011100B);  04110000
       DCL PTR21C              POINTER BASED(ADDR(HEX21C));             04120000
       DCL PSATOLD             POINTER BASED(PTR21C);                   04130000
                                                                        04140000
       DCL 1 TCB               BASED(PSATOLD),                          04150000
             2 TCBFIL1         CHARACTER(12),                           04160000
             2 TCBTIO          POINTER,                                 04170000
             2 TCBFIL2         CHARACTER(164),                          04180000
             2 TCBJSCB         POINTER;                                 04190000
                                                                        04200000
       DCL TIOCNJOB            CHARACTER(8) BASED(TCBTIO);              04210000
                                                                        04220000
       DCL 1 JSCB              BASED(TCBJSCB),                          04230000
             2 JSCBFIL1        CHARACTER(264),                          04240000
             2 JSCBPSCB        POINTER;                                 04250000
                                                                        04260000
       DCL 1 PSCB              BASED(JSCBPSCB),                         04270000
             2 PSCBFIL1        CHARACTER(48),                           04280000
             2 PSCBRLGB        POINTER;                                 04290000
                                                                        04300000
       DCL 1 RLGB              BASED(PSCBRLGB),                         04310000
             2 RLGBFIL1        CHARACTER(4),                            04320000
             2 LMESSAGE        CHARACTER(8),                            04330000
             2 RLGBFIL2        CHARACTER(244),                          04340000
             2 RLGBECT         POINTER;                                 04350000
                                                                        04360000
       DCL 1 ECT               BASED(RLGBECT),                          04370000
             2 ECTFIL1         CHARACTER(28),                           04380000
             2 ECTSWS(8)       BIT(1);                                  04390000
                                                                        04400000
                                                                        04410000
       DCL 1 PARMLIST          STATIC,                                  04420000
             2 DDNAME          CHARACTER (8) INIT(' '),                 04430000
             2 DSNAME          CHARACTER(44) INIT(' '),                 04440000
             2 DSMEMBER        CHARACTER (8) INIT(' '),                 04450000
             2 PASSWORD        CHARACTER (8) INIT(' '),                 04460000
             2 DSSTATUS        CHARACTER (8) INIT('SHR'),               04470000
             2 DSNDISP         CHARACTER (8) INIT(' '),                 04480000
             2 DSADISP         CHARACTER (8) INIT(' '),                 04490000
             2 DSUNIT          CHARACTER (8) INIT(' '),                 04500000
             2 DSRESV1         CHARACTER (8) INIT(' '),                 04510000
             2 DSVOLSER        CHARACTER (6) INIT(' '),                 04520000
             2 DSRESV2         CHARACTER(40) INIT(' '),                 04530000
             2 DSVOLREF        CHARACTER(44) INIT(' '),                 04540000
             2 DSFREE          CHARACTER (8) INIT(' '),                 04550000
             2 DSLABEL         CHARACTER (4) INIT(' '),                 04560000
             2 DSINOUT         CHARACTER (4) INIT(' '),                 04570000
             2 DSRESV3         CHARACTER(204) INIT(' ');                04580000
 /*  DESCRIPTION OF THE DATABASE FORMAT                                 04590000
                                                                        04600000
                                                                        04610000
    THE DATA FILE CONTAINS SEVERAL SECTIONS.  EACH BEGINS               04620000
    WITH A LINE CONTAINING A NUMBER IDENTIFYING THE SECTION,            04630000
    AND ENDS WITH A LINE CONTAINING "-1".                               04640000
                                                                        04650000
    SECTION 1:  LONG FORM DESCRIPTIONS.  EACH LINE CONTAINS A           04660000
        LOCATION NUMBER, A TAB, AND A LINE OF TEXT.  THE SET            04670000
        OF (NECESSARILY ADJACENT) LINES WHOSE NUMBERS ARE X             04680000
        FORM THE LONG DESCRIPTION OF LOCATION X.                        04690000
    SECTION 2:  SHORT FORM DESCRIPTIONS.  SAME FORMAT AS LONG           04700000
        FORM.  NOT ALL PLACES HAVE SHORT DESCRIPTIONS.                  04710000
    SECTION 3:  TRAVEL TABLE.  EACH LINE CONTAINS A LOCATION            04720000
        NUMBER (X), A SECOND LOCATION NUMBER (Y), AND A LIST            04730000
        OF MOTION NUMBERS (SEE SECTION 4).  EACH MOTION                 04740000
        REPRESENTS A VERB WHICH WILL GO TO Y IF CURRENTLY AT            04750000
        X.  Y, IN TURN, IS INTERPRETED AS FOLLOWS.  LET                 04760000
        M=Y/1000, N=Y MOD 1000.                                         04770000
                IF N<=300       IT IS THE LOCATION TO GO TO.            04780000
                IF 300<N<=500   N-300 IS USED IN A COMPUTED             04790000
                                GOTO TO A SECTION OF SPECIAL            04800000
                                CODE.                                   04810000
                IF N>500        MESSAGE N-500 FROM SECTION 6            04820000
                                IS PRINTED, AND HE STAYS                04830000
                                WHEREVER HE IS.                         04840000
        MEANWHILE, M SPECIFIES THE CONDITIONS ON THE MOTION.            04850000
                IF M=0          IT'S UNCONDITIONAL.                     04860000
                IF 0<M<100      IT IS DONE WITH M%                      04870000
                                PROBABILITY.                            04880000
                IF M=100        UNCONDITIONAL, BUT FORBIDDEN            04890000
                                TO DWARFS.                              04900000
                IF 100<M<=200   HE MUST BE CARRYING OBJECT              04910000
                                M-100.                                  04920000
                IF 200<M<=300   MUST BE CARRYING OR IN SAME             04930000
                                ROOM AS OBJECT M-200.                   04940000
                IF 300<M<=400   PROP(M MOD 100) MUST *NOT* BE           04950000
                                0.                                      04960000
                IF 400<M<=500   PROP(M MOD 100) MUST *NOT* BE           04970000
                                1.                                      04980000
                IF 500<M<=600   PROP(M MOD 100) MUST *NOT* BE           04990000
                                2, ETC.                                 05000000
        IF THE CONDITION (IF ANY) IS NOT MET, THEN THE NEXT             05010000
        *DIFFERENT* "DESTINATION" VALUE IS USED (UNLESS IT              05020000
        FAILS TO MEET *ITS* CONDITIONS, IN WHICH CASE THE               05030000
        NEXT IS FOUND, ETC.).  TYPICALLY, THE NEXT DEST WILL            05040000
        BE FOR ONE OF THE SAME VERBS, SO THAT ITS ONLY USE IS           05050000
        AS THE ALTERNATE DESTINATION FOR THOSE VERBS.  FOR              05060000
        INSTANCE:                                                       05070000
            15      110022  29      31      34      35      23      43  05080000
            15      14      29                                          05090000
        THIS SAYS THAT, FROM LOC 15, ANY OF THE VERBS 29, 31,           05100000
        ETC., WILL TAKE HIM TO 22 IF HE'S CARRYING OBJECT 10,           05110000
        AND OTHERWISE WILL GO TO 14.                                    05120000
                11      303008  49                                      05130000
                11      9       50                                      05140000
        THIS SAYS THAT, FROM 11, 49 TAKES HIM TO 8 UNLESS               05150000
        PROP(3)=0, IN WHICH CASE HE GOES TO 9.  VERB 50 TAKES           05160000
        HIM TO 9 REGARDLESS OF PROP(3).                                 05170000
    SECTION 4:  VOCABULARY.  EACH LINE CONTAINS A NUMBER (N),           05180000
        A TAB, AND A FIVE-LETTER WORD.  CALL M=N/1000.  IF              05190000
        M=0, THEN THE WORD IS A MOTION VERB FOR USE IN                  05200000
        TRAVELLING (SEE SECTION 3).  ELSE, IF M=1, THE WORD             05210000
        IS AN OBJECT.  ELSE, IF M=2, THE WORD IS AN ACTION              05220000
        VERB (SUCH AS "CARRY" OR "ATTACK").  ELSE, IF M=3,              05230000
        THE WORD IS A SPECIAL CASE VERB (SUCH AS "DIG") AND N           05240000
        MOD 1000 IS AN INDEX INTO SECTION 6.  OBJECTS FROM 50           05250000
        TO (CURRENTLY, ANYWAY) 79 ARE CONSIDERED TREASURES              05260000
        (FOR PIRATE, CLOSEOUT).                                         05270000
    SECTION 5:  OBJECT DESCRIPTIONS.  EACH LINE CONTAINS A              05280000
        NUMBER (N), A TAB, AND A MESSAGE.  IF N IS FROM 1 TO            05290000
        100, THE MESSAGE IS THE "INVENTORY" MESSAGE FOR                 05300000
        OBJECT N.  OTHERWISE, N SHOULD BE 000, 100, 200,                05310000
        ETC., AND THE MESSAGE SHOULD BE THE DESCRIPTION OF              05320000
        THE PRECEDING OBJECT WHEN ITS PROP VALUE IS N/100.              05330000
        THE N/100 IS USED ONLY TO DISTINGUISH MULTIPLE                  05340000
        MESSAGES FROM MULTI-LINE MESSAGES- THE PROP INFO                05350000
        ACTUALLY REQUIRES ALL MESSAGES FOR AN OBJECT TO BE              05360000
        PRESENT AND CONSECUTIVE.  PROPERTIES WHICH PRODUCE NO           05370000
        MESSAGE SHOULD BE GIVEN THE MESSAGE ">$<".                      05380000
    SECTION 6:  ARBITRARY MESSAGES.  SAME FORMAT AS SECTIONS            05390000
        1, 2, AND 5, EXCEPT THE NUMBERS BEAR NO RELATION TO             05400000
        ANYTHING (EXCEPT FOR SPECIAL VERBS IN SECTION 4).               05410000
    SECTION 7:  OBJECT LOCATIONS.  EACH LINE CONTAINS AN                05420000
        OBJECT NUMBER AND ITS INITIAL LOCATION (ZERO (OR                05430000
        OMITTED) IF NONE).  IF THE OBJECT IS IMMOVABLE, THE             05440000
        LOCATION IS FOLLOWED BY A "-1".  IF IT HAS TWO                  05450000
        LOCATIONS (E.G.  THE GRATE) THE FIRST LOCATION IS               05460000
        FOLLOWED WITH THE SECOND, AND THE OBJECT IS ASSUMED             05470000
        TO BE IMMOVABLE.                                                05480000
    SECTION 8:  ACTION DEFAULTS.  EACH LINE CONTAINS AN                 05490000
        "ACTION-VERB" NUMBER AND THE INDEX (IN SECTION 6) OF            05500000
        THE DEFAULT MESSAGE FOR THE VERB.                               05510000
    SECTION 9:  LIQUID ASSETS, ETC.  EACH LINE CONTAINS A               05520000
        NUMBER (N) AND UP TO 20 LOCATION NUMBERS.  BIT N                05530000
        (WHERE 0 IS THE UNITS BIT) IS SET IN COND(LOC) FOR              05540000
        EACH LOC GIVEN.  THE COND BITS CURRENTLY ASSIGNED               05550000
        ARE:                                                            05560000
                0       LIGHT                                           05570000
                1       IF BIT 2 IS ON:  ON FOR OIL, OFF FOR            05580000
                        WATER                                           05590000
                2       LIQUID ASSET, SEE BIT 1                         05600000
                3       PIRATE DOESN'T GO HERE UNLESS                   05610000
                        FOLLOWING PLAYER                                05620000
        OTHER BITS ARE USED TO INDICATE AREAS OF INTEREST TO            05630000
        "HINT" ROUTINES:                                                05640000
                4       TRYING TO GET INTO CAVE                         05650000
                5       TRYING TO CATCH BIRD                            05660000
                6       TRYING TO DEAL WITH SNAKE                       05670000
                7       LOST IN MAZE                                    05680000
                8       PONDERING DARK ROOM                             05690000
                9       AT WITT'S END                                   05700000
        COND(LOC) IS SET TO 2, OVERRIDING ALL OTHER BITS, IF            05710000
        LOC HAS FORCED MOTION.                                          05720000
    SECTION 10:  CLASS MESSAGES.  EACH LINE CONTAINS A NUMBER           05730000
        (N), A TAB, AND A MESSAGE DESCRIBING A CLASSIFICATION           05740000
        OF PLAYER.  THE SCORING SECTION SELECTS THE                     05750000
        APPROPRIATE MESSAGE, WHERE EACH MESSAGE IS CONSIDERED           05760000
        TO APPLY TO PLAYERS WHOSE SCORES ARE HIGHER THAN THE            05770000
        PREVIOUS N BUT NOT HIGHER THAN THIS N.  NOTE THAT               05780000
        THESE SCORES PROBABLY CHANGE WITH EVERY MODIFICATION            05790000
        (AND PARTICULARLY EXPANSION) OF THE PROGRAM.                    05800000
    SECTION 11:  HINTS.  EACH LINE CONTAINS A HINT NUMBER               05810000
        (CORRESPONDING TO A COND BIT, SEE SECTION 9), THE               05820000
        NUMBER OF TURNS HE MUST BE AT THE RIGHT LOC(S) BEFORE           05830000
        TRIGGERING THE HINT, THE POINTS DEDUCTED FOR TAKING             05840000
        THE HINT, THE MESSAGE NUMBER (SECTION 6) OF THE                 05850000
        QUESTION, AND THE MESSAGE NUMBER OF THE HINT.  THESE            05860000
        VALUES ARE STASHED IN THE "HINTS" ARRAY.  HNTMAX IS             05870000
        SET TO THE MAX HINT NUMBER (<= HNTSIZ).  NUMBERS 1-3            05880000
        ARE UNUSABLE SINCE COND BITS ARE OTHERWISE ASSIGNED,            05890000
        SO 2 IS USED TO REMEMBER IF HE'S READ THE CLUE IN THE           05900000
        REPOSITORY, AND 3 IS USED TO REMEMBER WHETHER HE                05910000
        ASKED FOR INSTRUCTIONS (GETS MORE TURNS, BUT LOSES              05920000
        POINTS).                                                        05930000
    SECTION 12:  MAGIC MESSAGES.  IDENTICAL TO SECTION 6                05940000
        EXCEPT PUT IN A SEPARATE SECTION FOR EASIER                     05950000
        REFERENCE.  MAGIC MESSAGES ARE USED BY THE STARTUP,             05960000
        MAINTENANCE MODE, AND RELATED ROUTINES.                         05970000
    SECTION 0:  END OF DATABASE.                                        05980000
                                                                        05990000
  */                                                                    06000000
                                                                        06010000
 ON ATTENTION BEGIN;                                                    06020000
              ON ATTENTION SIGNAL ERROR;                                06030000
              LMESSAGE = ' ';                                           06040000
              ECTSWS(1) = '0'B;                       /* NO OPERANDS */ 06050000
              ECTSWS(4) = '1'B;         /* LOGON OR LOGOFF REQUESTED */ 06060000
              SUBSTR(LMESSAGE,1,1) = 'L';                               06070000
              SUBSTR(LMESSAGE,2,1) = 'O';                               06080000
              SUBSTR(LMESSAGE,3,1) = 'G';                               06090000
              SUBSTR(LMESSAGE,4,1) = 'O';                               06100000
              SUBSTR(LMESSAGE,5,1) = 'F';                               06110000
              SUBSTR(LMESSAGE,6,1) = 'F';                               06120000
              GO TO DEALLOC;                                            06130000
              END;                                                      06140000
                                                                        06150000
 ON ERROR BEGIN;                                                        06160000
          ON ERROR SYSTEM;                                              06170000
          CALL BUG(99);                                                 06180000
          END;                                                          06190000
                                                                        06200000
 ON ENDFILE (OBJECT) EOCARD = '1'B;                                     06210000
                                                                        06220000
 ON ENDFILE (SOURCE) EOCARD = '1'B;                                     06230000
                                                                        06240000
 ON ENDFILE (STORAGE) NOSTG = '1'B;                                     06250000
 /*  READ THE DATABASE IF WE HAVE NOT YET DONE SO       */              06260000
                                                                        06270000
         CALL CLRSCRN;                                                  06280000
         IF PLIRETV() = 0 THEN TTYPE = 'V';              /* ON A VDU */ 06290000
         PUT STRING (OUTSTR) EDIT ('Initializing...') (A);              06300000
         CALL LINEOUT;                                                  06310000
                                                                        06320000
 /*                                                                     06330000
    CLEAR OUT THE VARIOUS TEXT-POINTER ARRAYS.  ALL TEXT IS             06340000
    STORED IN ARRAY LINES- EACH LINE IS PRECEDED BY A WORD              06350000
    POINTING TO THE NEXT POINTER (I.E.  THE WORD FOLLOWING              06360000
    THE END OF THE LINE).  THE POINTER IS NEGATIVE IF THIS IS           06370000
    FIRST LINE OF A MESSAGE.  THE TEXT-POINTER ARRAYS CONTAIN           06380000
    INDICES OF POINTER-WORDS IN LINES.  STEXT(N) IS SHORT               06390000
    DESCRIPTION OF LOCATION N.  LTEXT(N) IS LONG DESCRIPTION.           06400000
    PTEXT(N) POINTS TO MESSAGE FOR PROP(N)=0.  SUCCESSIVE               06410000
    PROP MESSAGES ARE FOUND BY CHASING POINTERS.  RTEXT                 06420000
    CONTAINS SECTION 6'S STUFF.  CTEXT(N) POINTS TO A                   06430000
    PLAYER-CLASS MESSAGE.  MTEXT IS FOR SECTION 12.  WE ALSO            06440000
    CLEAR COND.  SEE DESCRIPTION OF SECTION 9 FOR DETAILS.              06450000
    (VARIABLES INITIALIZED IN DECLARATIONS).                            06460000
  */                                                                    06470000
                                                                        06480000
         DATE_STG = DATETIME();                                         06490001
         CALL THISDAY(OUTSTR);                                          06500000
         CALL LINEOUT;                                                  06510000
         TSOID = TIOCNJOB;                                              06520000
         SUBSTR(MSGPRMS,9,8) = TSOID;                                   06530000
         PW = SUBSTR(TSOID,1,4);                                        06540000
         TEST_WORD = -TEST_WORD;                                        06550000
         SUBSTR(USERID,1,4) = PW;                                       06560000
         PW = SUBSTR(TSOID,5,4);                                        06570000
         TEST_WORD = -TEST_WORD;                                        06580000
         SUBSTR(USERID,5,4) = SUBSTR(PW,1,3) || SUBSTR(TSOID,8,1);      06590000
         TODAY = DATE_PIC;                                              06600000
         HHMM = PIC_HHMM;                                               06610000
                                                                        06620000
         UNAUTH = '0'B;                                                 06630000
                                                                        06640000
         L = LENGTH(INPARM);                                            06650000
         IF L > 4                                                       06660000
         THEN DO;                                                       06670000
              IF SUBSTR(INPARM,1,4) = '$¢^%'                            06680000
              THEN DO;                                                  06690000
                   IF SUBSTR(INPARM,5,1) > 'Z'                          06700000
                   THEN SUBSTR(YDCHR,1,1) = SUBSTR(INPARM,5,1);         06710000
                   IF DIGIT = DAY# THEN WIZARD = '1'B;                  06720000
                   END;                                                 06730000
              IF L > 5                                                  06740000
              THEN DO;                                                  06750000
                   IF SUBSTR(INPARM,6,1) = '#'                          06760000
                   THEN DSSTATUS = 'MOD ';                              06770000
                   IF SUBSTR(INPARM,6,1) = '@'                          06780000
                   THEN GO TO PREALLOC;                                 06790000
                   END;                                                 06800000
              END;                                                      06810000
         DDNAME = 'STORAGE '; /* ALLOCATE FILES IF NOT PRE-ALLOCATED */ 06820000
         DSNAME = 'STORAGE$.STORAGE$.STORAGE$.STORAGE$.STORAGE$';       06830000
         DSMEMBER = 'STGMEMBR';                                         06840000
         PASSWORD = 'STG-PSWD';                                         06850000
         CALL R062A10(PARMLIST);  /* IF RC^=0 FILE WAS PRE-ALLOCATED */ 06860000
         DDNAME = 'OBJECT  ';                                           06870000
         DSNAME = '$OBJECT$.$OBJECT$.$OBJECT$.$OBJECT$.$OBJECT$';       06880000
         DSMEMBER = 'OBJMEMBR';                                         06890000
         PASSWORD = 'OBJ-PSWD';                                         06900000
         CALL R062A10(PARMLIST);                                        06910000
         DSSTATUS = ' ';                                                06920000
         DSMEMBER = ' ';                                                06930000
         PASSWORD = ' ';                                                06940000
 PREALLOC:                                                              06950000
         DSNAME = LOW(44);                                              06960000
                                                                        06970000
         IF WIZARD THEN GO TO AUTHOK;                                   06980000
         OPEN FILE (STORAGE) UPDATE;                                    06990000
         READ FILE (STORAGE) INTO (ADVREC);                             07000000
                                                                        07010000
         SUBSTR(MSGPRMS,1,7) = SUBSTR(ADVREC,1,7);                      07020000
         I = INDEX(ADVREC,SUBSTR(USERID,1,7));                          07030000
         IF I = 0                                                       07040000
         THEN DO;                                                       07050000
              UNAUTH = '1'B;                                            07060000
              OUTSTR = 'Userid ' || TSOID ||                            07070000
                'is not authorized to run this program.';               07080000
              CALL LINEOUT;                                             07090000
              CALL LINESKP;                                             07100000
              END;                                                      07110000
         ELSE DO;                                                       07120000
              BYTE_NUM = SUBSTR(ADVREC,I+7,1);                          07130000
              INTEGER = INTEGER + 1;                                    07140000
              SUBSTR(ADVREC,I+7,1) = BYTE_NUM;                          07150000
              REWRITE FILE (STORAGE) FROM (ADVREC);                     07160000
              END;                                                      07170000
         CLOSE FILE (STORAGE);                                          07180000
         NOSTG = '0'B;                                                  07190000
         IF SUBSTR(USERID,1,7) = SUBSTR(ADVREC,1,7) THEN GO TO AUTHOK;  07200000
                                 /* NOTIFY GRAND WIZARD IF LOGGED ON */ 07210000
         IF ^UNAUTH THEN SUBSTR(MSGPRMS,8,1) = 'A';     /* AUTH FLAG */ 07220000
         CALL WARNMSG(MSGPRMS);                                         07230000
         IF UNAUTH & PLIRETV ^= 0 /* UNAUTH & GRAND WIZ ^ LOGGED ON? */ 07240000
         THEN SIGNAL ATTENTION;             /* YES, SO BYE BYE, BABY */ 07250000
                                                                        07260000
 AUTHOK:                                                 /* GO AHEAD */ 07270000
         DO J = 1 TO 4;                         /* GET TRADING HOURS */ 07280000
              PW = SUBSTR(ADVREC,4781+J*4,4);                           07290000
              IF SUBSTR(PW,1,1) = ' ' THEN GO TO NEXTIM;                07300000
              TEST_WORD = -TEST_WORD;                                   07310000
              TIMES(J) = PW;                                            07320000
 NEXTIM: END;                                                           07330000
         CALL GETMSGS(TSOID,'A');                          /* LISTBC */ 07340000
         OPEN FILE (OBJECT) INPUT;                                      07350000
                                                                        07360000
 /* START NEW DATA SECTION.  SECT IS THE SECTION NUMBER. */             07370000
                                                                        07380000
 L1002:  READ FILE (OBJECT) INTO (CARD);                                07390000
         IF EOCARD THEN CALL BUG(10);                                   07400000
         IF SUBSTR(CARD,3,1) = 'S'                /* IGNORE ESD CARD */ 07410000
         THEN GO TO L1002;                                              07420000
         IF SUBSTR(CARD,1,1) = HEX02                                    07430000
         THEN CALL REVERT;                                              07440000
         GET STRING (CARD) EDIT (SECT) (F(8));                          07450000
         OLDLOC=-1;                                                     07460000
         PUT STRING (OUTSTR) EDIT ('Reading section #',SECT)            07470000
               (A,F(2));                                                07480000
         CALL LINEOUT;                                                  07490000
         SELECT (SECT);                                                 07500000
            WHEN (00)  GO TO L1100;        /* (0) */                    07510000
            WHEN (01)  GO TO L1004;        /* (1) */                    07520000
            WHEN (02)  GO TO L1004;        /* (2) */                    07530000
            WHEN (03)  GO TO L1030;        /* (3) */                    07540000
            WHEN (04)  GO TO L1040;        /* (4) */                    07550000
            WHEN (05)  GO TO L1004;        /* (5) */                    07560000
            WHEN (06)  GO TO L1004;        /* (6) */                    07570000
            WHEN (07)  GO TO L1050;        /* (7) */                    07580000
            WHEN (08)  GO TO L1060;        /* (8) */                    07590000
            WHEN (09)  GO TO L1070;        /* (9) */                    07600000
            WHEN (10)  GO TO L1004;       /* (10) */                    07610000
            WHEN (11)  GO TO L1080;       /* (11) */                    07620000
            WHEN (12)  GO TO L1004;       /* (12) */                    07630000
            OTHERWISE  CALL BUG(9);                                     07640000
            END;                                                        07650000
                                                                        07660000
 /* SECTIONS 1, 2, 5, 6, 10.  READ MESSAGES AND SET UP POINTERS. */     07670000
                                                                        07680000
 L1004:  READ FILE (OBJECT) INTO (CARD);                                07690000
         IF EOCARD THEN CALL BUG(10);                                   07700000
         IF SUBSTR(CARD,1,1) = HEX02                                    07710000
         THEN CALL REVERT;                                              07720000
         GET STRING (CARD) EDIT                                         07730000
             (LOC,(LINES(J) DO J = LINUSE+1 TO LINUSE+14),KKWORD)       07740000
             (F(8),14 A(5),A(2));                                       07750000
         IF KKWORD ^= ' ' THEN CALL BUG(0);                             07760000
         IF LOC = -1 THEN GOTO L1002;                                   07770000
         DO K=1 TO 14;                                                  07780000
             KK=LINUSE+15-K;                                            07790000
             IF LINES(KK) ^= ' ' THEN GOTO L1007;                       07800000
             END;                                                       07810000
         CALL BUG(1);                                                   07820000
 L1007:  YDPIC=KK+1;                                                    07830000
         LINES(LINUSE)=YDPIC;                                           07840000
         IF LOC = OLDLOC THEN GOTO L1020;                               07850000
         YDPIC=YDPIC+50000;                                             07860000
         LINES(LINUSE)=YDPIC;                                           07870000
         IF SECT = 12 THEN GOTO L1013;                                  07880000
         IF SECT = 10 THEN GOTO L1012;                                  07890000
         IF SECT = 6 THEN GOTO L1011;                                   07900000
         IF SECT = 5 THEN GOTO L1010;                                   07910000
         IF SECT = 1 THEN GOTO L1008;                                   07920000
                                                                        07930000
         STEXT(LOC)=LINUSE;                                             07940000
         GOTO L1020;                                                    07950000
                                                                        07960000
 L1008:  LTEXT(LOC)=LINUSE;                                             07970000
         GOTO L1020;                                                    07980000
                                                                        07990000
 L1010:  IF LOC > 0 & LOC <= 100 THEN PTEXT(LOC)=LINUSE;                08000000
         GOTO L1020;                                                    08010000
                                                                        08020000
 L1011:  IF LOC > RTXSIZ THEN CALL BUG(6);                              08030000
         RTEXT(LOC)=LINUSE;                                             08040000
         GOTO L1020;                                                    08050000
                                                                        08060000
 L1012:  CTEXT(CLSSES)=LINUSE;                                          08070000
         CVAL(CLSSES)=LOC;                                              08080000
         CLSSES=CLSSES+1;                                               08090000
         GOTO L1020;                                                    08100000
                                                                        08110000
 L1013:  IF LOC > MAGSIZ THEN CALL BUG(6);                              08120000
         MTEXT(LOC)=LINUSE;                                             08130000
                                                                        08140000
 L1020:  LINUSE=KK+1;                                                   08150000
         LINES(LINUSE)='-1   ';                                         08160000
         OLDLOC=LOC;                                                    08170000
         IF LINUSE+14 > LINSIZ THEN CALL BUG(2);                        08180000
         GOTO L1004;                                                    08190000
                                                                        08200000
 /*                                                                     08210000
    THE STUFF FOR SECTION 3 IS ENCODED HERE.  EACH                      08220000
    "FROM-LOCATION" GETS A CONTIGUOUS SECTION OF THE "TRAVEL"           08230000
    ARRAY.  EACH ENTRY IN TRAVEL IS NEWLOC*1000 + KEYWORD               08240000
    (FROM SECTION 4, MOTION VERBS), AND IS NEGATED IF THIS IS           08250000
    THE LAST ENTRY FOR THIS LOCATION.  KEY(N) IS THE INDEX IN           08260000
    TRAVEL OF THE FIRST OPTION AT LOCATION N.                           08270000
 */                                                                     08280000
                                                                        08290000
 L1030:  READ FILE (OBJECT) INTO (CARD);                                08300000
         IF EOCARD THEN CALL BUG(10);                                   08310000
         IF SUBSTR(CARD,1,1) = HEX02                                    08320000
         THEN CALL REVERT;                                              08330000
         GET STRING (CARD) EDIT                                         08340000
              (LOC,NEWLOC,(TK(I) DO I=1 TO 8)) (10 F(8));               08350000
         IF LOC = -1 THEN GOTO L1002;                                   08360000
         IF KEY(LOC) ^= 0 THEN GOTO L1033;                              08370000
         KEY(LOC)=TRVS;                                                 08380000
         GOTO L1035;                                                    08390000
 L1033:  TRAVEL(TRVS-1)=-TRAVEL(TRVS-1);                                08400000
 L1035:  DO L=1 TO 8;                                                   08410000
             IF TK(L) = 0 THEN GOTO L1039;                              08420000
             TRAVEL(TRVS)=NEWLOC*1000+TK(L);                            08430000
             TRVS=TRVS+1;                                               08440000
             IF TRVS = TRVSIZ THEN CALL BUG(3);                         08450000
             END;                                                       08460000
                                                                        08470000
 L1039:  TRAVEL(TRVS-1)=-TRAVEL(TRVS-1);                                08480000
         GOTO L1030;                                                    08490000
                                                                        08500000
 /*                                                                     08510000
    HERE WE READ IN THE VOCABULARY.  KTAB(N) IS THE WORD                08520000
    NUMBER, ATAB(N) IS THE CORRESPONDING WORD.  THE -1 AT THE           08530000
    END OF SECTION 4 IS LEFT IN KTAB AS AN END-MARKER.  THE             08540000
    WORDS ARE GIVEN A MINIMAL HASH TO MAKE READING THE                  08550000
    CORE-IMAGE HARDER.  NOTE THAT '/7-08' HAD BETTER NOT BE             08560000
    IN THE LIST, SINCE IT COULD HASH TO -1.  (HASHING REMOVED           08570000
    IN PL/1 VERSION..BRD) (NEW HASH ADDED..GP)                          08580000
 */                                                                     08590000
                                                                        08600000
 L1040:  DO TABNDX=1 TO TABSIZ;                                         08610000
         READ FILE (OBJECT) INTO (CARD);                                08620000
         IF EOCARD THEN CALL BUG(10);                                   08630000
         IF SUBSTR(CARD,1,1) = HEX02                                    08640000
         THEN CALL REVERT;                                              08650000
         GET STRING (CARD) EDIT                                         08660000
               (KTAB(TABNDX),ATAB(TABNDX)) (F(8),A (5));                08670000
         IF KTAB(TABNDX) = -1 THEN GOTO L1002;                          08680000
         ATABB(TABNDX) = ^ATABB(TABNDX);                                08690000
         END;                                                           08700000
         CALL BUG(4);                                                   08710000
                                                                        08720000
 /*                                                                     08730000
    READ IN THE INITIAL LOCATIONS FOR EACH OBJECT.  ALSO THE            08740000
    IMMOVABILITY INFO.  PLAC CONTAINS INITIAL LOCATIONS OF              08750000
    OBJECTS.  FIXD IS -1 FOR IMMOVABLE OBJECTS (INCLUDING THE           08760000
    SNAKE), OR = SECOND LOC FOR TWO-PLACED OBJECTS.                     08770000
 */                                                                     08780000
                                                                        08790000
 L1050:  READ FILE (OBJECT) INTO (CARD);                                08800000
         IF EOCARD THEN CALL BUG(10);                                   08810000
         IF SUBSTR(CARD,1,1) = HEX02                                    08820000
         THEN CALL REVERT;                                              08830000
         GET STRING (CARD) EDIT (OBJ,J,K) (3 F(8));                     08840000
         IF OBJ = -1 THEN GOTO L1002;                                   08850000
         PLAC(OBJ)=J;                                                   08860000
         FIXD(OBJ)=K;                                                   08870000
         GOTO L1050;                                                    08880000
                                                                        08890000
 /* READ DEFAULT MESSAGE NUMBERS FOR ACTION VERBS, STORE IN             08900000
    ACTSPK.  */                                                         08910000
                                                                        08920000
 L1060:  READ FILE (OBJECT) INTO (CARD);                                08930000
         IF EOCARD THEN CALL BUG(10);                                   08940000
         IF SUBSTR(CARD,1,1) = HEX02                                    08950000
         THEN CALL REVERT;                                              08960000
         GET STRING (CARD) EDIT (VERB,J) (2 F(8));                      08970000
         IF VERB = -1 THEN GOTO L1002;                                  08980000
         ACTSPK(VERB)=J;                                                08990000
         GOTO L1060;                                                    09000000
                                                                        09010000
 /* READ INFO ABOUT AVAILABLE LIQUIDS AND OTHER CONDITIONS,             09020000
    STORE IN COND.  */                                                  09030000
                                                                        09040000
 L1070:  READ FILE (OBJECT) INTO (CARD);                                09050000
         IF EOCARD THEN CALL BUG(10);                                   09060000
         IF SUBSTR(CARD,1,1) = HEX02                                    09070000
         THEN CALL REVERT;                                              09080000
         GET STRING (CARD) EDIT (K,(TK(I) DO I=1 TO 9))                 09090000
              (10 F(8));                                                09100000
         IF K = -1 THEN GOTO L1002;                                     09110000
         DO I=1 TO 9;                                                   09120000
             LOC=TK(I);                                                 09130000
             IF LOC = 0 THEN GOTO L1070;                                09140000
             IF BITSET(LOC,K) THEN CALL BUG(8);                         09150000
             COND(LOC)=COND(LOC)+2**K;                                  09160000
             END;                                                       09170000
         GOTO L1070;                                                    09180000
                                                                        09190000
 /* READ DATA FOR HINTS. */                                             09200000
                                                                        09210000
 L1080:  HNTMAX=0;                                                      09220000
 L1081:  READ FILE (OBJECT) INTO (CARD);                                09230000
         IF EOCARD THEN CALL BUG(10);                                   09240000
         IF SUBSTR(CARD,1,1) = HEX02                                    09250000
         THEN CALL REVERT;                                              09260000
         GET STRING (CARD) EDIT (K,(TK(I) DO I=1 TO 4))                 09270000
              (5 F(8));                                                 09280000
         IF K = -1 THEN GOTO L1002;                                     09290000
         IF K = 0 THEN GOTO L1081;                                      09300000
         IF K < 0 | K > HNTSIZ THEN CALL BUG(7);                        09310000
         DO I=1 TO 4;                                                   09320000
             HINTS(K,I)=TK(I);                                          09330000
             END;                                                       09340000
         HNTMAX=MAX(HNTMAX,K);                                          09350000
         GOTO L1081;                                                    09360000
                                                                        09370000
 /*                                                                     09380000
    FINISH CONSTRUCTING INTERNAL DATA FORMAT                            09390000
                                                                        09400000
    HAVING READ IN THE DATABASE, CERTAIN THINGS ARE NOW                 09410000
    CONSTRUCTED.  PROPS ARE SET TO ZERO.  WE FINISH SETTING             09420000
    UP COND BY CHECKING FOR FORCED-MOTION TRAVEL ENTRIES.               09430000
    THE PLAC AND FIXD ARRAYS ARE USED TO SET UP ATLOC(N) AS             09440000
    THE FIRST OBJECT AT LOCATION N, AND LINK(OBJ) AS THE NEXT           09450000
    OBJECT AT THE SAME LOCATION AS OBJ.  (OBJ>100 INDICATES             09460000
    THAT FIXED(OBJ-100)=LOC - LINK(OBJ) IS STILL THE CORRECT            09470000
    LINK TO USE.) ABB IS ZEROED- IT CONTROLS WHETHER THE                09480000
    ABBREVIATED DESCRIPTION IS PRINTED.  COUNTS MOD 5 UNLESS            09490000
    "LOOK" IS USED.                                                     09500000
 */                                                                     09510000
                                                                        09520000
 L1100:  CLOSE FILE (OBJECT);                        /* FREE BUFFERS */ 09530000
         DO I=1 TO LOCSIZ;                                              09540000
         IF LTEXT(I) = 0 | KEY(I) = 0 THEN GOTO L1102;                  09550000
         K=KEY(I);                                                      09560000
         IF MOD(ABS(TRAVEL(K)),1000) = 1 THEN COND(I)=2;                09570000
 L1102:  END;                                                           09580000
                                                                        09590000
 /*                                                                     09600000
    SET UP THE ATLOC AND LINK ARRAYS AS DESCRIBED ABOVE.                09610000
    WE'LL USE THE DROP SUBROUTINE, WHICH PREFACES NEW OBJECTS           09620000
    ON THE LISTS.  SINCE WE WANT THINGS IN THE OTHER ORDER,             09630000
    WE'LL RUN THE LOOP BACKWARDS.  IF THE OBJECT IS IN TWO              09640000
    LOCS, WE DROP IT TWICE.  THIS ALSO SETS UP "PLACE" AND              09650000
    "FIXED" AS COPIES OF "PLAC" AND "FIXD".  ALSO, SINCE                09660000
    TWO-PLACED OBJECTS ARE TYPICALLY BEST DESCRIBED LAST,               09670000
    WE'LL DROP THEM FIRST.  (ZEROED IN DECLARATIONS.)                   09680000
 */                                                                     09690000
                                                                        09700000
         DO I=1 TO 100;                                                 09710000
             K=101-I;                                                   09720000
             IF FIXD(K) > 0 THEN DO;                                    09730000
                 CALL DROP(K+100,FIXD(K));                              09740000
                 CALL DROP(K,PLAC(K));                                  09750000
                 END;                                                   09760000
             END;                                                       09770000
                                                                        09780000
         DO I=1 TO 100;                                                 09790000
             K=101-I;                                                   09800000
             FIXED(K)=FIXD(K);                                          09810000
             IF PLAC(K) ^= 0 & FIXD(K) <= 0 THEN CALL DROP(K,PLAC(K));  09820000
             END;                                                       09830000
                                                                        09840000
 /*                                                                     09850000
    TREASURES, AS NOTED EARLIER, ARE OBJECTS 50 THROUGH                 09860000
    MAXTRS (CURRENTLY 79).  THEIR PROPS ARE INITIALLY -1, AND           09870000
    ARE SET TO 0 THE FIRST TIME THEY ARE DESCRIBED.  TALLY              09880000
    KEEPS TRACK OF HOW MANY ARE NOT YET FOUND, SO WE KNOW               09890000
    WHEN TO CLOSE THE CAVE.  TALLY2 COUNTS HOW MANY CAN NEVER           09900000
    BE FOUND (E.G.  IF LOST BIRD OR BRIDGE).                            09910000
 */                                                                     09920000
                                                                        09930000
         DO I=50 TO MAXTRS;                                             09940000
             IF PTEXT(I) ^= 0 THEN PROP(I)=-1;                          09950000
             TALLY=TALLY-PROP(I);                                       09960000
             END;                                                       09970000
 /*                                                                     09980000
    CLEAR THE HINT STUFF.  HINTLC(I) IS HOW LONG HE'S BEEN AT           09990000
    LOC WITH COND BIT I.  HINTED(I) IS TRUE IFF HINT I HAS              10000000
    BEEN USED.  (DONE IN DECLARATIONS.)                                 10010000
 */                                                                     10020000
                                                                        10030000
                                                                        10040000
 /* DEFINE SOME HANDY MNEMONICS.  THESE CORRESPOND TO OBJECT            10050000
    NUMBERS.  */                                                        10060000
                                                                        10070000
         KEYS=VOCAB('KEYS',1);                                          10080000
         LAMP=VOCAB('LAMP',1);                                          10090000
         GRATE=VOCAB('GRATE',1);                                        10100000
         CAGE=VOCAB('CAGE',1);                                          10110000
         ROD=VOCAB('ROD',1);                                            10120000
         ROD2=ROD+1;                                                    10130000
         STEPS=VOCAB('STEPS',1);                                        10140000
         BIRD=VOCAB('BIRD',1);                                          10150000
         DOOR=VOCAB('DOOR',1);                                          10160000
         PILLOW=VOCAB('PILLO',1);                                       10170000
         SNAKE=VOCAB('SNAKE',1);                                        10180000
         FISSUR=VOCAB('FISSU',1);                                       10190000
         TABLET=VOCAB('TABLE',1);                                       10200000
         CLAM=VOCAB('CLAM',1);                                          10210000
         OYSTER=VOCAB('OYSTE',1);                                       10220000
         MAGZIN=VOCAB('MAGAZ',1);                                       10230000
         DWARF=VOCAB('DWARF',1);                                        10240000
         KNIFE=VOCAB('KNIFE',1);                                        10250000
         FOOD=VOCAB('FOOD',1);                                          10260000
         BOTTLE=VOCAB('BOTTL',1);                                       10270000
         WATER=VOCAB('WATER',1);                                        10280000
         OIL=VOCAB('OIL',1);                                            10290000
         MIRROR=VOCAB('MIRRO',1);                                       10300000
         PLANT=VOCAB('PLANT',1);                                        10310000
         PLANT2=PLANT+1;                                                10320000
         AXE=VOCAB('AXE',1);                                            10330000
         DRAGON=VOCAB('DRAGO',1);                                       10340000
         CHASM=VOCAB('CHASM',1);                                        10350000
         TROLL=VOCAB('TROLL',1);                                        10360000
         TROLL2=TROLL+1;                                                10370000
         BEAR=VOCAB('BEAR',1);                                          10380000
         MESSAG=VOCAB('MESSA',1);                                       10390000
         VEND=VOCAB('VENDI',1);                                         10400000
         BATTER=VOCAB('BATTE',1);                                       10410000
         LADDER=VOCAB('LADDE',1);                                       10420000
         BRACELET=VOCAB('BRACE',1);                                     10430000
         FFIELD=VOCAB('FIELD',1);                                       10440000
                                                                        10450000
 /* OBJECTS FROM 50 THROUGH WHATEVER ARE TREASURES.  HERE ARE A FEW. */ 10460000
                                                                        10470000
         NUGGET=VOCAB('GOLD',1);                                        10480000
         COINS=VOCAB('COINS',1);                                        10490000
         CHEST=VOCAB('CHEST',1);                                        10500000
         EGGS=VOCAB('EGGS',1);                                          10510000
         TRIDNT=VOCAB('TRIDE',1);                                       10520000
         VASE=VOCAB('VASE',1);                                          10530000
         EMRALD=VOCAB('EMERA',1);                                       10540000
         PYRAM=VOCAB('PYRAM',1);                                        10550000
         PEARL=VOCAB('PEARL',1);                                        10560000
         RUG=VOCAB('RUG',1);                                            10570000
         CHAIN=VOCAB('CHAIN',1);                                        10580000
         RUBY=VOCAB('RUBY',1);                                          10590000
         ORAC=VOCAB('ORAC',1);                                          10600000
                                                                        10610000
 /* THESE ARE MOTION-VERB NUMBERS. */                                   10620000
                                                                        10630000
         BACK=VOCAB('BACK',0);                                          10640000
         NULLX=VOCAB('NULL',0);                                         10650000
         DPRSSN=VOCAB('DEPRE',0);                                       10660000
         ENTRNC=VOCAB('ENTRA',0);                                       10670000
         LOOK=VOCAB('LOOK',0);                                          10680000
         CAVE=VOCAB('CAVE',0);                                          10690000
                                                                        10700000
 /* AND SOME ACTION VERBS. */                                           10710000
                                                                        10720000
 /*      SAY=VOCAB('SAY',2)   AS NUMBERS ARE USED IN SELECT STATEMENTS  10730000
         LOCK=VOCAB('LOCK',2)      THESE VOCAB CALLS DO NOT GIVE ANY    10740000
         THROW=VOCAB('THROW',2)    MORE PROGRAM INDEPENDENCE FROM DB.   10750000
         FIND=VOCAB('FIND',2)        THEREFORE, JUST INITIALIZE IN      10760000
         INVENT=VOCAB('INVEN',2)      DECLARATIONS.  (GP 1/83)          10770000
         SUSPEND=VOCAB('SUSPE',2)                                       10780000
         RESTORE=VOCAB('RESTO',2)                            */         10790000
                                                                        10800000
 /*                                                                     10810000
    INITIALIZE THE DWARFS.  DLOC IS LOC OF DWARFS,                      10820000
    HARD-WIRED IN.  ODLOC IS PRIOR LOC OF EACH DWARF,                   10830000
    INITIALLY GARBAGE.  DALTLC IS ALTERNATE INITIAL LOC FOR             10840000
    DWARF, IN CASE ONE OF THEM STARTS OUT ON TOP OF THE                 10850000
    ADVENTURER.  (NO 2 OF THE 5 INITIAL LOCS ARE ADJACENT.)             10860000
    DSEEN IS TRUE IF DWARF HAS SEEN HIM.  DFLAG CONTROLS THE            10870000
    LEVEL OF ACTIVATION OF ALL THIS:                                    10880000
         0       NO DWARF STUFF YET (WAIT UNTIL REACHES HALL            10890000
                 OF MISTS)                                              10900000
         1       REACHED HALL OF MISTS, BUT HASN'T MET FIRST DWARF      10910000
         2       MET FIRST DWARF, OTHERS START MOVING, NO               10920000
                 KNIVES THROWN YET                                      10930000
         3       A KNIFE HAS BEEN THROWN (FIRST SET ALWAYS              10940000
                 MISSES)                                                10950000
         3+      DWARFS ARE MAD (INCREASES THEIR ACCURACY)              10960000
    SIXTH DWARF IS SPECIAL (THE PIRATE).  HE ALWAYS STARTS AT           10970000
    HIS CHEST'S EVENTUAL LOCATION INSIDE THE MAZE.  THIS LOC            10980000
    IS SAVED IN CHLOC FOR REF.  THE DEAD END IN THE OTHER               10990000
    MAZE HAS ITS LOC STORED IN CHLOC2.                                  11000000
 */                                                                     11010000
                                                                        11020000
 /*                                                                     11030000
    OTHER RANDOM FLAGS AND COUNTERS, AS FOLLOWS:                        11040000
         TURNS   TALLIES HOW MANY COMMANDS HE'S GIVEN                   11050000
                 (IGNORES YES/NO)                                       11060000
         LIMIT   LIFETIME OF LAMP (NOT SET HERE)                        11070000
         IWEST   HOW MANY TIMES HE'S SAID "WEST" INSTEAD OF "W"         11080000
         KNFLOC  0 IF NO KNIFE HERE, LOC IF KNIFE HERE, -1              11090000
                 AFTER CAVEAT                                           11100000
         DETAIL  HOW OFTEN WE'VE SAID "NOT ALLOWED TO GIVE MORE DETAIL" 11110000
         ABBNUM  HOW OFTEN WE SHOULD PRINT NON-ABBREVIATED DESCRIPTIONS 11120000
         MAXDIE  NUMBER OF REINCARNATION MESSAGES AVAILABLE (UP TO 5)   11130000
         NUMDIE  NUMBER OF TIMES KILLED SO FAR                          11140000
         HOLDNG  NUMBER OF OBJECTS BEING CARRIED                        11150000
         DKILL   NUMBER OF DWARFS KILLED (UNUSED IN SCORING,            11160000
                 NEEDED FOR MSG)                                        11170000
         FOOBAR  CURRENT PROGRESS IN SAYING "FEE FIE FOE FOO".          11180000
         BONUS   USED TO DETERMINE AMOUNT OF BONUS IF HE                11190000
                 REACHES CLOSING                                        11200000
         CLOCK1  NUMBER OF TURNS FROM FINDING LAST TREASURE             11210000
                 TILL CLOSING                                           11220000
         CLOCK2  NUMBER OF TURNS FROM FIRST WARNING TILL                11230000
                 BLINDING FLASH                                         11240000
         LOGICALS WERE EXPLAINED EARLIER                                11250000
                 (INITIALIZED IN DECLARATIONS)                          11260000
 */                                                                     11270000
                                                                        11280000
         DO I=0 TO 4;                                                   11290000
             IF RTEXT(2*I+81) ^= 0 THEN MAXDIE=I+1;                     11300000
             END;                                                       11310000
                                                                        11320000
 /* REPORT ON AMOUNT OF ARRAYS ACTUALLY USED, TO PERMIT                 11330000
    REDUCTIONS. */                                                      11340000
                                                                        11350000
                                                                        11360000
         DO K=1 TO LOCSIZ;                                              11370000
             KK=LOCSIZ+1-K;                                             11380000
             IF LTEXT(KK) ^= 0 THEN GOTO L1997;                         11390000
             END;                                                       11400000
                                                                        11410000
         OBJ=0;                                                         11420000
 L1997:  DO K=1 TO 100;                                                 11430000
             IF PTEXT(K) ^= 0 THEN OBJ=OBJ+1;                           11440000
             END;                                                       11450000
                                                                        11460000
         DO K=1 TO TABNDX;                                              11470000
             IF KTAB(K)/1000 = 2 THEN VERB=KTAB(K)-2000;                11480000
             END;                                                       11490000
                                                                        11500000
         DO K=1 TO MAGSIZ;                                              11510000
             M=MAGSIZ+1-K;                                              11520000
             IF MTEXT(M) ^= 0 THEN GOTO L1990;                          11530000
             END;                                                       11540000
                                                                        11550000
 L1990:  DO K=1 TO RTXSIZ;                                              11560000
             J=RTXSIZ+1-K;                                              11570000
             IF RTEXT(J) ^= 0 THEN GOTO L1991;                          11580000
             END;                                                       11590000
                                                                        11600000
 L1991:  IF ^WIZARD THEN GO TO NOREPRT;                                 11610000
                                                                        11620000
         K=100;                                                         11630000
         CALL LINESKP;                                                  11640000
         PUT STRING (OUTSTR) EDIT (LINUSE,' of ',LINSIZ,                11650000
             ' words of messages') (F(6),A,F(6),A);                     11660000
         CALL LINEOUT;                                                  11670000
         PUT STRING (OUTSTR) EDIT (TRVS,' of ',TRVSIZ,                  11680000
             ' travel options') (F(6),A,F(6),A);                        11690000
         CALL LINEOUT;                                                  11700000
         PUT STRING (OUTSTR) EDIT (TABNDX,' of ',TABSIZ,                11710000
             ' vocabulary words') (F(6),A,F(6),A);                      11720000
         CALL LINEOUT;                                                  11730000
         PUT STRING (OUTSTR) EDIT (KK,' of ',LOCSIZ,                    11740000
             ' locations') (F(6),A,F(6),A);                             11750000
         CALL LINEOUT;                                                  11760000
         PUT STRING (OUTSTR) EDIT (OBJ,' of ',K,                        11770000
             ' objects') (F(6),A,F(6),A);                               11780000
         CALL LINEOUT;                                                  11790000
         PUT STRING (OUTSTR) EDIT (VERB,' of ',VRBSIZ,                  11800000
             ' action verbs') (F(6),A,F(6),A);                          11810000
         CALL LINEOUT;                                                  11820000
         PUT STRING (OUTSTR) EDIT (J,' of ',RTXSIZ,                     11830000
             ' rtext messages') (F(6),A,F(6),A);                        11840000
         CALL LINEOUT;                                                  11850000
         PUT STRING (OUTSTR) EDIT (M,' of ',MAGSIZ,                     11860000
             ' mtext messages') (F(6),A,F(6),A);                        11870000
         CALL LINEOUT;                                                  11880000
         PUT STRING (OUTSTR) EDIT (CLSSES,' of ',CLSSIZ,                11890000
             ' class messages') (F(6),A,F(6),A);                        11900000
         CALL LINEOUT;                                                  11910000
         PUT STRING (OUTSTR) EDIT (HNTMAX,' of ',HNTSIZ,                11920000
             ' hints') (F(6),A,F(6),A);                                 11930000
         CALL LINEOUT;                                                  11940000
         CALL LINESKP;                                                  11950000
                                                                        11960000
                                                                        11970000
 /*  FINALLY, SINCE WE'RE CLEARLY SETTING THINGS UP FOR THE             11980000
    FIRST TIME...  */                                                   11990000
                                                                        12000000
 NOREPRT:                                                               12010000
         CALL RSPEAK(205);                                              12020000
         CALL LINESKP;                                                  12030000
         CALL LINESKP;                                                  12040000
 /*  START-UP, DWARF STUFF */                                           12050000
                                                                        12060000
 L1:     CALL ITIME(I);                                                 12070000
         DO J=1 TO I;                                                   12080000
 /*         CALL RAN(1)*/                                               12090000
            END;                                                        12100000
         I=RAN(1);                                                      12110000
         HINTED(3)=YES(65,1,0);                                         12120000
         LOC,NEWLOC=1;                                                  12130000
         LIMIT=330;                                                     12140000
         IF HINTED(3) THEN LIMIT=1000;                                  12150000
                                                                        12160000
 /*  CAN'T LEAVE CAVE ONCE IT'S CLOSING (EXCEPT BY MAIN OFFICE). */     12170000
                                                                        12180000
 L2:     IF NEWLOC >= 9 | NEWLOC = 0 |  ^ CLOSNG THEN GOTO L71;         12190000
         CALL RSPEAK(130);                                              12200000
         NEWLOC=LOC;                                                    12210000
         IF  ^ PANIC THEN CLOCK2=15;                                    12220000
         PANIC='1'B;                                                    12230000
 /*                                                                     12240000
    SEE IF A DWARF HAS SEEN HIM AND HAS COME FROM WHERE HE              12250000
    WANTS TO GO.  IF SO, THE DWARF'S BLOCKING HIS WAY.  IF              12260000
    COMING FROM PLACE FORBIDDEN TO PIRATE (DWARFS ROOTED IN             12270000
    PLACE) LET HIM GET OUT (AND ATTACKED).                              12280000
 */                                                                     12290000
                                                                        12300000
 L71:    IF NEWLOC = LOC | FORCED(LOC) | BITSET(LOC,3) THEN GOTO L74;   12310000
         DO I=1 TO 5;                                                   12320000
             IF ^ (ODLOC(I) ^= NEWLOC |  ^ DSEEN(I)) THEN DO;           12330000
                 NEWLOC=LOC;                                            12340000
                 CALL RSPEAK(2);                                        12350000
                 GOTO L74;                                              12360000
                 END;                                                   12370000
             END;                                                       12380000
 L74:    LOC=NEWLOC;                                                    12390000
                                                                        12400000
 /*                                                                     12410000
    DWARF STUFF.  SEE EARLIER COMMENTS FOR DESCRIPTION OF               12420000
    VARIABLES.  REMEMBER SIXTH DWARF IS PIRATE AND IS THUS              12430000
    VERY DIFFERENT EXCEPT FOR MOTION RULES.                             12440000
                                                                        12450000
    FIRST OFF, DON'T LET THE DWARFS FOLLOW HIM INTO A PIT OR            12460000
    A WALL.  ACTIVATE THE WHOLE MESS THE FIRST TIME HE GETS             12470000
    AS FAR AS THE HALL OF MISTS (LOC 15).  IF NEWLOC IS                 12480000
    FORBIDDEN TO PIRATE (IN PARTICULAR, IF IT'S BEYOND THE              12490000
    TROLL BRIDGE), BYPASS DWARF STUFF.  THAT WAY PIRATE CAN'T           12500000
    STEAL RETURN TOLL, AND DWARFS CAN'T MEET THE BEAR.  ALSO            12510000
    MEANS DWARFS WON'T FOLLOW HIM INTO DEAD END IN MAZE, BUT            12520000
    C'EST LA VIE.  THEY'LL WAIT FOR HIM OUTSIDE THE DEAD END.           12530000
 */                                                                     12540000
                                                                        12550000
         IF LOC = 0 | FORCED(LOC) | BITSET(NEWLOC,3) THEN GOTO L2000;   12560000
         IF DFLAG ^= 0 THEN GOTO L6000;                                 12570000
         IF LOC >= 15 THEN DFLAG=1;                                     12580000
         GOTO L2000;                                                    12590000
                                                                        12600000
 /*                                                                     12610000
    WHEN WE ENCOUNTER THE FIRST DWARF, WE KILL 0, 1, OR 2 OF            12620000
    THE 5 DWARFS.  IF ANY OF THE SURVIVORS IS AT LOC,                   12630000
    REPLACE HIM WITH THE ALTERNATE.                                     12640000
 */                                                                     12650000
                                                                        12660000
 L6000:  IF DFLAG ^= 1 THEN GOTO L6010;                                 12670000
         IF LOC < 15 | PCT(95) THEN GOTO L2000;                         12680000
         DFLAG=2;                                                       12690000
         DO I=1 TO 2;                                                   12700000
             J=1+RAN(5);                                                12710000
             IF PCT(50) THEN DLOC(J)=0;                                 12720000
             END;                                                       12730000
         DO I=1 TO 5;                                                   12740000
             IF DLOC(I) = LOC THEN DLOC(I)=DALTLC;                      12750000
             ODLOC(I)=DLOC(I);                                          12760000
             END;                                                       12770000
         CALL RSPEAK(3);                                                12780000
         CALL DROP(AXE,LOC);                                            12790000
         GOTO L2000;                                                    12800000
                                                                        12810000
 /*                                                                     12820000
    THINGS ARE IN FULL SWING.  MOVE EACH DWARF AT RANDOM,               12830000
    EXCEPT IF HE'S SEEN US HE STICKS WITH US.  DWARFS NEVER             12840000
    GO TO LOCS <15.  IF WANDERING AT RANDOM, THEY DON'T BACK            12850000
    UP UNLESS THERE'S NO ALTERNATIVE.  IF THEY DON'T HAVE TO            12860000
    MOVE, THEY ATTACK.  AND, OF COURSE, DEAD DWARFS DON'T DO            12870000
    MUCH OF ANYTHING.                                                   12880000
 */                                                                     12890000
                                                                        12900000
 L6010:  DTOTAL=0;                                                      12910000
         ATTACK=0;                                                      12920000
         STICK=0;                                                       12930000
         DO I=1 TO 6;                                                   12940000
             IF DLOC(I) = 0 THEN GOTO L6030;                            12950000
             J=1;                                                       12960000
             KK=DLOC(I);                                                12970000
             KK=KEY(KK);                                                12980000
             IF KK = 0 THEN GOTO L6016;                                 12990000
 L6012:      NEWLOC=MOD(ABS(TRAVEL(KK))/1000,1000);                     13000000
             IF NEWLOC > 300 | NEWLOC < 15 | NEWLOC = ODLOC(I)          13010000
               | (J > 1 & NEWLOC = TK(J-1)) | J >= 20                   13020000
               | NEWLOC = DLOC(I) | FORCED(NEWLOC)                      13030000
               | (I = 6 & BITSET(NEWLOC,3))                             13040000
               | ABS(TRAVEL(KK))/1000000 = 100 THEN GOTO L6014;         13050000
             TK(J)=NEWLOC;                                              13060000
             J=J+1;                                                     13070000
 L6014:      KK=KK+1;                                                   13080000
             IF TRAVEL(KK-1) >= 0 THEN GOTO L6012;                      13090000
 L6016:      TK(J)=ODLOC(I);                                            13100000
             IF J >= 2 THEN J=J-1;                                      13110000
             J=1+RAN(J);                                                13120000
             ODLOC(I)=DLOC(I);                                          13130000
             DLOC(I)=TK(J);                                             13140000
             DSEEN(I)=(DSEEN(I) & LOC >= 15)                            13150000
              | (DLOC(I) = LOC | ODLOC(I) = LOC);                       13160000
             IF ^DSEEN(I) THEN GOTO L6030;                              13170000
             DLOC(I)=LOC;                                               13180000
             IF I ^= 6 THEN GOTO L6027;                                 13190000
                                                                        13200000
 /*                                                                     13210000
    THE PIRATE'S SPOTTED HIM.  HE LEAVES HIM ALONE ONCE WE'VE           13220000
    FOUND CHEST.  K COUNTS IF A TREASURE IS HERE.  IF NOT,              13230000
    AND TALLY=TALLY2 PLUS ONE FOR AN UNSEEN CHEST, LET THE              13240000
    PIRATE BE SPOTTED.                                                  13250000
 */                                                                     13260000
                                                                        13270000
             IF LOC = CHLOC | PROP(CHEST) >= 0 THEN GOTO L6030;         13280000
             K=0;                                                       13290000
             DO J=50 TO MAXTRS;                                         13300000
                                                                        13310000
 /* PIRATE WON'T TAKE PYRAMID FROM PLOVER ROOM OR DARK ROOM             13320000
    (TOO EASY!).  */                                                    13330000
                                                                        13340000
                 IF J = PYRAM & (LOC = PLAC(PYRAM)                      13350000
                  | LOC = PLAC(EMRALD)) THEN GOTO L6020;                13360000
                 IF TOTING(J) THEN GOTO L6022;                          13370000
 L6020:          IF HERE(J) THEN K=1;                                   13380000
                 END;                                                   13390000
             IF TALLY = TALLY2+1 & K = 0 & PLACE(CHEST) = 0             13400000
              & HERE(LAMP) & PROP(LAMP) = 1 THEN GOTO L6025;            13410000
             IF ODLOC(6) ^= DLOC(6) & PCT(20) THEN CALL RSPEAK(127);    13420000
             GOTO L6030;                                                13430000
                                                                        13440000
 L6022:      CALL RSPEAK(128);                                          13450000
                                                                        13460000
 /* DON'T STEAL CHEST BACK FROM TROLL! */                               13470000
                                                                        13480000
             IF PLACE(MESSAG) = 0 THEN CALL MOVE(CHEST,CHLOC);          13490000
             CALL MOVE(MESSAG,CHLOC2);                                  13500000
             DO J=50 TO MAXTRS;                                         13510000
                 IF J = PYRAM & (LOC = PLAC(PYRAM)                      13520000
                  | LOC = PLAC(EMRALD)) THEN GOTO L6023;                13530000
                 IF AT(J) & FIXED(J) = 0 THEN CALL CARRY(J,LOC);        13540000
                 IF TOTING(J) THEN CALL DROP(J,CHLOC);                  13550000
 L6023:          END;                                                   13560000
 L6024:      DLOC(6)=CHLOC;                                             13570000
             ODLOC(6)=CHLOC;                                            13580000
             DSEEN(6)='0'B;                                             13590000
             GOTO L6030;                                                13600000
                                                                        13610000
 L6025:      CALL RSPEAK(186);                                          13620000
             CALL MOVE(CHEST,CHLOC);                                    13630000
             CALL MOVE(MESSAG,CHLOC2);                                  13640000
             GOTO L6024;                                                13650000
                                                                        13660000
 /* THIS THREATENING LITTLE DWARF IS IN THE ROOM WITH HIM! */           13670000
                                                                        13680000
 L6027:      DTOTAL=DTOTAL+1;                                           13690000
             IF ODLOC(I) ^= DLOC(I) THEN GOTO L6030;                    13700000
             ATTACK=ATTACK+1;                                           13710000
             IF KNFLOC >= 0 THEN KNFLOC=LOC;                            13720000
             IF RAN(1000) < 95*(DFLAG-2) THEN STICK=STICK+1;            13730000
 L6030:      END;                                                       13740000
                                                                        13750000
 /* NOW WE KNOW WHAT'S HAPPENING.  LET'S TELL THE POOR SUCKER           13760000
    ABOUT IT.  */                                                       13770000
                                                                        13780000
         IF DTOTAL = 0 THEN GOTO L2000;                                 13790000
         IF DTOTAL = 1 THEN GOTO L75;                                   13800000
         CALL LINESKP;                                                  13810000
         INHIB = 'Y';                                                   13820000
         CALL RSPEAK(207);         /* SOME THREATENING LITTLE DWARFS */ 13830000
         PUT STRING (INHIB) EDIT (DTOTAL) (F(1));                       13840000
         SUBSTR(OUTSTR,11,1) = INHIB;                                   13850000
         INHIB = 'N';                                                   13860000
         CALL LINEOUT;                                                  13870000
         GOTO L77;                                                      13880000
 L75:    CALL RSPEAK(4);                                                13890000
 L77:    IF ATTACK = 0 THEN GOTO L2000;                                 13900000
         IF DFLAG = 2 THEN DFLAG=3;                                     13910000
                                                                        13920000
 /*                                                                     13930000
    DWARFS GET *VERY* MAD!                                              13940000
 */                                                                     13950000
                                                                        13960000
         IF ATTACK = 1 THEN GOTO L79;                                   13970000
         INHIB = 'Y';                                                   13980000
         CALL RSPEAK(208);       /* SOME OF THEM THROW KNIVES AT YOU */ 13990000
         PUT STRING (INHIB) EDIT (ATTACK) (F(1));                       14000000
         SUBSTR(OUTSTR,1,1) = INHIB;                                    14010000
         INHIB = 'N';                                                   14020000
         CALL LINEOUT;                                                  14030000
         K=6;                                                           14040000
 L82:    IF STICK > 1 THEN GOTO L83;                                    14050000
         CALL RSPEAK(K+STICK);                                          14060000
         IF STICK = 0 THEN GOTO L2000;                                  14070000
         GOTO L84;                                                      14080000
 L83:    INHIB = 'Y';                                                   14090000
         CALL RSPEAK(209);                  /* SOME OF THEM GET YOU! */ 14100000
         PUT STRING (INHIB) EDIT (STICK) (F(1));                        14110000
         SUBSTR(OUTSTR,1,1) = INHIB;                                    14120000
         INHIB = 'N';                                                   14130000
         CALL LINEOUT;                                                  14140000
 L84:    OLDLC2=LOC;                                                    14150000
         GOTO L99;                                                      14160000
                                                                        14170000
 L79:    CALL RSPEAK(5);                                                14180000
         K=52;                                                          14190000
         GOTO L82;                                                      14200000
                                                                        14210000
 /* DESCRIBE THE CURRENT LOCATION AND (MAYBE) GET NEXT COMMAND. */      14220000
                                                                        14230000
 /* PRINT TEXT FOR CURRENT LOC. */                                      14240000
                                                                        14250000
 L2000:  IF LOC = 0 THEN GOTO L99;                                      14260000
         KK=STEXT(LOC);                                                 14270000
         IF MOD(ABB(LOC),ABBNUM) = 0 | KK = 0 THEN KK=LTEXT(LOC);       14280000
         IF FORCED(LOC) |  ^ DARK(0) THEN GOTO L2001;                   14290000
         IF WZDARK & PCT(40) THEN GOTO L90;                             14300000
         KK=RTEXT(16);                                                  14310000
 L2001:  IF TOTING(BEAR) THEN CALL RSPEAK(141);                         14320000
         CALL SPEAK(KK);                                                14330000
         K=1;                                                           14340000
         IF FORCED(LOC) THEN GOTO L8;                                   14350000
         IF LOC = 33 & PCT(25) &  ^ CLOSNG THEN CALL RSPEAK(8);         14360000
                                                                        14370000
 /*                                                                     14380000
    PRINT OUT DESCRIPTIONS OF OBJECTS AT THIS LOCATION.  IF             14390000
    NOT CLOSING AND PROPERTY VALUE IS NEGATIVE, TALLY OFF               14400000
    ANOTHER TREASURE.  RUG IS SPECIAL CASE- ONCE SEEN, ITS              14410000
    PROP IS 1 (DRAGON ON IT) TILL DRAGON IS KILLED.                     14420000
    SIMILARLY FOR CHAIN- PROP IS INITIALLY 1 (LOCKED TO                 14430000
    BEAR).  THESE HACKS ARE BECAUSE PROP=0 IS NEEDED TO GET             14440000
    FULL SCORE.                                                         14450000
 */                                                                     14460000
                                                                        14470000
         IF DARK(0) THEN GOTO L2012;                                    14480000
         ABB(LOC)=ABB(LOC)+1;                                           14490000
         I=ATLOC(LOC);                                                  14500000
 L2004:  IF I = 0 THEN GOTO L2012;                                      14510000
         OBJ=I;                                                         14520000
         IF OBJ > 100 THEN OBJ=OBJ-100;                                 14530000
         IF OBJ = STEPS & TOTING(NUGGET) THEN GOTO L2008;               14540000
         IF PROP(OBJ) >= 0 THEN GOTO L2006;                             14550000
         IF CLOSED THEN GOTO L2008;                                     14560000
         PROP(OBJ)=0;                                                   14570000
         IF OBJ = RUG | OBJ = CHAIN THEN PROP(OBJ)=1;                   14580000
         TALLY=TALLY-1;                                                 14590000
                                                                        14600000
 /* IF REMAINING TREASURES TOO ELUSIVE, ZAP HIS LAMP. */                14610000
                                                                        14620000
         IF TALLY = TALLY2 & TALLY ^= 0 THEN LIMIT=MIN(35,LIMIT);       14630000
 L2006:  KK=PROP(OBJ);                                                  14640000
         IF OBJ = STEPS & LOC = FIXED(STEPS) THEN KK=1;                 14650000
         IF OBJ = LADDER & LOC = FIXED(LADDER) THEN KK=KK+1;            14660000
         CALL PSPEAK(OBJ,KK);                                           14670000
 L2008:  I=LINK(I);                                                     14680000
         GOTO L2004;                                                    14690000
                                                                        14700000
 L2009:  K=54;                                                          14710000
 L2010:  SPK=K;                                                         14720000
 L2011:  CALL RSPEAK(SPK);                                              14730000
                                                                        14740000
 L2012:  VERB=0;                                                        14750000
         OBJ=0;                                                         14760000
                                                                        14770000
 /*                                                                     14780000
    CHECK IF THIS LOC IS ELIGIBLE FOR ANY HINTS.  IF BEEN               14790000
    HERE LONG ENOUGH, BRANCH TO HELP SECTION (ON LATER PAGE).           14800000
    HINTS ALL COME BACK HERE EVENTUALLY TO FINISH THE LOOP.             14810000
    IGNORE "HINTS" < 4 (SPECIAL STUFF, SEE DATABASE NOTES).             14820000
 */                                                                     14830000
                                                                        14840000
 L2600:  DO HINT=4 TO HNTMAX;                                           14850000
             IF ^ (HINTED(HINT)) THEN DO;                               14860000
                 IF ^BITSET(LOC,HINT) THEN HINTLC(HINT)=-1;             14870000
                 HINTLC(HINT)=HINTLC(HINT)+1;                           14880000
                 IF HINTLC(HINT) >= HINTS(HINT,1) THEN GOTO L40000;     14890000
                 END;                                                   14900000
             END;                                                       14910000
                                                                        14920000
 /*                                                                     14930000
    KICK THE RANDOM NUMBER GENERATOR JUST TO ADD VARIETY TO             14940000
    THE CHASE.  ALSO, IF CLOSING TIME, CHECK FOR ANY OBJECTS            14950000
    BEING TOTED WITH PROP < 0 AND SET THE PROP TO -1-PROP.              14960000
    THIS WAY OBJECTS WON'T BE DESCRIBED UNTIL THEY'VE BEEN              14970000
    PICKED UP AND PUT DOWN SEPARATE FROM THEIR RESPECTIVE               14980000
    PILES.  DON'T TICK CLOCK1 UNLESS WELL INTO CAVE (AND NOT            14990000
    AT Y2).                                                             15000000
 */                                                                     15010000
                                                                        15020000
 L2602:  IF ^CLOSED THEN GOTO L2605;                                    15030000
         IF PROP(OYSTER) < 0 & TOTING(OYSTER)                           15040000
                THEN CALL PSPEAK(OYSTER,1);                             15050000
         DO I=1 TO 100;                                                 15060000
             IF TOTING(I) & PROP(I) < 0 THEN PROP(I)=-1-PROP(I);        15070000
             END;                                                       15080000
 L2605:  WZDARK=DARK(0);                                                15090000
         IF KNFLOC > 0 & KNFLOC ^= LOC THEN KNFLOC=0;                   15100000
         I=RAN(1);                                                      15110000
 L2606:  CALL GETIN(WD1,WD1X,WD2,WD2X);                                 15120000
                                                                        15130000
 L2608:  IF TURNS = 1500                         /* ALLOW 1500 TURNS */ 15140000
         THEN DO;                                                       15150000
              CALL CLRSCRN;                                             15160000
              CALL MSPEAK(1);                                           15170000
              IF WIZARD                                                 15180000
              THEN DO;                                                  15190000
                   TURNS = TURNS + 1;                                   15200000
                   GO TO L2606;                                         15210000
                   END;                                                 15220000
              GO TO L20000;                                             15230000
              END;                                                      15240000
                                                                        15250000
         IF TURNS = 0                                                   15260000
         THEN DO;                                                       15270000
              IF WIZARD THEN GO TO SKIPTST;                             15280000
              IF VOCAB(WD1,-1) = 2035 THEN CALL WIZPROC;    /* WIZAR */ 15290000
              IF WIZARD THEN GO TO L2606;                               15300000
              IF (DAY# = 0 | DAY# = 6) & ^UNAUTH THEN GO TO SKIPTST;    15310000
              IF (((CHR_HHMM > TIMES(1) &                               15320001
                    CHR_HHMM < TIMES(2))                                15330001
                 | (CHR_HHMM > TIMES(3) &                               15340001
                    CHR_HHMM < TIMES(4)))                               15350001
                 & ^DEMOGM)                                             15360000
               | UNAUTH                                                 15370000
              THEN DO;                                                  15380000
                   CALL DEMOCHK;                                        15390000
                   GO TO L2606;                                         15400000
                   END;                                                 15410000
 SKIPTST:     END;                                                      15420000
                                                                        15430000
         IF DEMOGM                                                      15440000
         THEN DO;                                                       15450000
              IF TURNS = 100        /* ALLOW 100 TURNS FOR DEMO GAME */ 15460000
              THEN DO;                                                  15470000
                   CALL CLRSCRN;                                        15480000
                   CALL MSPEAK(1);                                      15490000
                   GO TO L20000;                                        15500000
                   END;                                                 15510000
              END;                                                      15520000
                                                                        15530000
 /*                                                                     15540000
    EVERY INPUT, CHECK "FOOBAR" FLAG.  IF ZERO, NOTHING'S               15550000
    GOING ON.  IF POS, MAKE NEG.  IF NEG, HE SKIPPED A WORD,            15560000
    SO MAKE IT ZERO.                                                    15570000
 */                                                                     15580000
                                                                        15590000
         FOOBAR=MIN(0,-FOOBAR);                                         15600000
         TURNS=TURNS+1;                                                 15610000
         IF WD1 = '@' & WIZARD                                          15620000
         THEN DO;                        /* DISPLAY CURRENT LOCATION */ 15630000
              LOC_LINE = ' ';                                           15640000
              PIC_VECTOR(1).PLOC = LOC;                                 15650000
              OUTSTR = LOC_LINE;                                        15660000
              CALL LINEOUT;                                             15670000
              GO TO L2606;                                              15680000
              END;                                                      15690000
         IF WD1 = 'DLOCS' & WIZARD       /* DISPLAY DWARFS' LOCATION */ 15700000
         THEN DO;                                                       15710000
              DO M = 1 TO 6;                                            15720000
                   PIC_VECTOR(M).PLOC = DLOC(M);                        15730000
              END;                                                      15740000
              OUTSTR = LOC_LINE;                                        15750000
              CALL LINEOUT;                                             15760000
              GO TO L2606;                                              15770000
              END;                                                      15780000
         IF VERB = SAY & WD2 ^= '     ' THEN VERB=0;                    15790000
         IF VERB = SAY THEN GOTO L4090;                                 15800000
         IF TALLY = 0 & LOC >= 15 & LOC ^= 33 THEN CLOCK1=CLOCK1-1;     15810000
         IF CLOCK1 = 0 THEN GOTO L10000;                                15820000
         IF CLOCK1 < 0 THEN CLOCK2=CLOCK2-1;                            15830000
         IF CLOCK2 = 0 THEN GOTO L11000;                                15840000
         IF PROP(LAMP) = 1 THEN LIMIT=LIMIT-1;                          15850000
         IF LIMIT <= 30 & HERE(BATTER) & PROP(BATTER) = 0               15860000
          & HERE(LAMP) THEN GOTO L12000;                                15870000
         IF LIMIT = 0 THEN GOTO L12400;                                 15880000
         IF LIMIT < 0 & LOC <= 8 THEN GOTO L12600;                      15890000
         IF LIMIT <= 30 THEN GOTO L12200;                               15900000
 L19999: K=43;                                                          15910000
         IF LIQLOC(LOC) = WATER THEN K=70;                              15920000
         IF WD1 = 'ENTER' & (WD2 = 'STREA' | WD2 = 'WATER')             15930000
          THEN GOTO L2010;                                              15940000
         IF WD1 = 'ENTER' & WD2 ^= '    ' THEN GOTO L2800;              15950000
         IF (WD1 ^= 'WATER' & WD1 ^= 'OIL')                             15960000
          | (WD2 ^= 'PLANT' & WD2 ^= 'DOOR') THEN GOTO L2610;           15970000
         IF AT(VOCAB(WD2,1)) THEN WD2='POUR';                           15980000
 L2610:  IF WD1 ^= 'WEST' THEN GOTO L2630;                              15990000
         IWEST=IWEST+1;                                                 16000000
         IF IWEST = 10 THEN CALL RSPEAK(17);                            16010000
 L2630:  I=VOCAB(WD1,-1);                                               16020000
         IF I = -1 THEN GOTO L3000;                                     16030000
         K=MOD(I,1000);                                                 16040000
         KQ=I/1000;                                                     16050000
         SELECT (KQ);                                                   16060000
            WHEN (0)  GO TO L8;                                         16070000
            WHEN (1)  GO TO L5000;                                      16080000
            WHEN (2)  GO TO L4000;                                      16090000
            WHEN (3)  GO TO L2010;                                      16100000
            OTHERWISE CALL BUG(22);                                     16110000
            END;                                                        16120000
                                                                        16130000
 /* GET SECOND WORD FOR ANALYSIS. */                                    16140000
                                                                        16150000
 L2800:  WD1=WD2;                                                       16160000
         WD1X=WD2X;                                                     16170000
         WD2='     ';                                                   16180000
         GOTO L2610;                                                    16190000
                                                                        16200000
 /* GEE, I DON'T UNDERSTAND. */                                         16210000
                                                                        16220000
 L3000:  SPK=60;                                                        16230000
         IF PCT(20) THEN SPK=61;                                        16240000
         IF PCT(20) THEN SPK=13;                                        16250000
         CALL RSPEAK(SPK);                                              16260000
         GOTO L2600;                                                    16270000
                                                                        16280000
 /*                                                                     16290000
    ANALYSE A VERB.  REMEMBER WHAT IT WAS, GO BACK FOR OBJECT           16300000
    IF SECOND WORD UNLESS VERB IS "SAY" OR "SUSPEND", WHICH SNARFS      16310000
    ARBITRARY SECOND WORD.  IF "SUSPEND" THEN WD2 IS THE NAME OF        16320000
    THE SAVED GAME...  GP.                                              16330000
 */                                                                     16340000
                                                                        16350000
 L4000:  VERB=K;                                                        16360000
         SPK=ACTSPK(VERB);                                              16370000
         IF WD2 ^= '     ' & VERB ^= SAY &                              16380000
           VERB ^= SUSPEND & VERB ^= RESTORE                            16390000
         THEN GOTO L2800;                                               16400000
         IF VERB = SAY THEN                                             16410000
             IF WD2 = '     ' THEN GO TO L4080;                         16420000
                              ELSE GO TO L4090;                         16430000
         IF OBJ ^= 0 THEN GOTO L4090;                                   16440000
                                                                        16450000
 /* ANALYSE AN INTRANSITIVE VERB (IE, NO OBJECT GIVEN YET). */          16460000
                                                                        16470000
 L4080:  SELECT (VERB);                                                 16480000
            WHEN (01)  GO TO L8010;       /* TAKE */                    16490000
            WHEN (02)  GO TO L8000;       /* DROP */                    16500000
            WHEN (03)  GO TO L8000;       /* SAY  */                    16510000
            WHEN (04)  GO TO L8040;       /* OPEN */                    16520000
            WHEN (05)  GO TO L2009;       /* NOTH */                    16530000
            WHEN (06)  GO TO L8040;       /* LOCK */                    16540000
            WHEN (07)  GO TO L9070;       /* ON   */                    16550000
            WHEN (08)  GO TO L9080;       /* OFF  */                    16560000
            WHEN (09)  GO TO L8000;       /* WAVE */                    16570000
            WHEN (10)  GO TO L8000;       /* CALM */                    16580000
            WHEN (11)  GO TO L2011;       /* WALK */                    16590000
            WHEN (12)  GO TO L9120;       /* KILL */                    16600000
            WHEN (13)  GO TO L9130;       /* POUR */                    16610000
            WHEN (14)  GO TO L8140;       /* EAT  */                    16620000
            WHEN (15)  GO TO L9150;       /* DRNK */                    16630000
            WHEN (16)  GO TO L8000;       /* RUB  */                    16640000
            WHEN (17)  GO TO L8000;       /* TOSS */                    16650000
            WHEN (18)  GO TO L8180;       /* QUIT */                    16660000
            WHEN (19)  GO TO L8000;       /* FIND */                    16670000
            WHEN (20)  GO TO L8200;       /* INVN */                    16680000
            WHEN (21)  GO TO L8000;       /* FEED */                    16690000
            WHEN (22)  GO TO L9220;       /* FILL */                    16700000
            WHEN (23)  GO TO L9230;       /* BLST */                    16710000
            WHEN (24)  GO TO L8240;       /* SCOR */                    16720000
            WHEN (25)  GO TO L8250;       /* FOO  */                    16730000
            WHEN (26)  GO TO L8260;       /* BRF  */                    16740000
            WHEN (27)  GO TO L8270;       /* READ */                    16750000
            WHEN (28)  GO TO L8000;       /* BREK */                    16760000
            WHEN (29)  GO TO L8000;       /* WAKE */                    16770000
            WHEN (30)  GO TO L8300;       /* SAVE */                    16780000
            WHEN (31)  GO TO L8310;       /* HOUR */                    16790000
            WHEN (32)  GO TO L8320;       /* LOG  */                    16800000
            WHEN (33)  GO TO L8330;       /* LASR */                    16810000
            WHEN (34)  GO TO L8340;       /* RSTR */                    16820000
            WHEN (35)  GO TO L8350;       /* WIZD */                    16830000
            WHEN (36)  GO TO L8360;       /* ORAC */                    16840000
            OTHERWISE  CALL BUG(23);                                    16850000
            END;                                                        16860000
                                                                        16870000
                                                                        16880000
 /* ANALYSE A TRANSITIVE VERB. */                                       16890000
                                                                        16900000
 L4090:  SELECT (VERB);                                                 16910000
            WHEN (01)  GO TO L9010;       /* TAKE */                    16920000
            WHEN (02)  GO TO L9020;       /* DROP */                    16930000
            WHEN (03)  GO TO L9030;       /* SAY  */                    16940000
            WHEN (04)  GO TO L9040;       /* OPEN */                    16950000
            WHEN (05)  GO TO L2009;       /* NOTH */                    16960000
            WHEN (06)  GO TO L9040;       /* LOCK */                    16970000
            WHEN (07)  GO TO L9070;       /* ON   */                    16980000
            WHEN (08)  GO TO L9080;       /* OFF  */                    16990000
            WHEN (09)  GO TO L9090;       /* WAVE */                    17000000
            WHEN (10)  GO TO L2011;       /* CALM */                    17010000
            WHEN (11)  GO TO L2011;       /* WALK */                    17020000
            WHEN (12)  GO TO L9120;       /* KILL */                    17030000
            WHEN (13)  GO TO L9130;       /* POUR */                    17040000
            WHEN (14)  GO TO L9140;       /* EAT  */                    17050000
            WHEN (15)  GO TO L9150;       /* DRNK */                    17060000
            WHEN (16)  GO TO L9160;       /* RUB  */                    17070000
            WHEN (17)  GO TO L9170;       /* TOSS */                    17080000
            WHEN (18)  GO TO L2011;       /* QUIT */                    17090000
            WHEN (19)  GO TO L9190;       /* FIND */                    17100000
            WHEN (20)  GO TO L9190;       /* INVN */                    17110000
            WHEN (21)  GO TO L9210;       /* FEED */                    17120000
            WHEN (22)  GO TO L9220;       /* FILL */                    17130000
            WHEN (23)  GO TO L9230;       /* BLST */                    17140000
            WHEN (24)  GO TO L2011;       /* SCOR */                    17150000
            WHEN (25)  GO TO L2011;       /* FOO  */                    17160000
            WHEN (26)  GO TO L2011;       /* BRF  */                    17170000
            WHEN (27)  GO TO L9270;       /* READ */                    17180000
            WHEN (28)  GO TO L9280;       /* BREK */                    17190000
            WHEN (29)  GO TO L9290;       /* WAKE */                    17200000
            WHEN (30)  GO TO L2011;       /* SAVE */                    17210000
            WHEN (31)  GO TO L2011;       /* HOUR */                    17220000
            WHEN (32)  GO TO L2011;       /* LOG  */                    17230000
            WHEN (33)  GO TO L2011;       /* LASR */                    17240000
            WHEN (34)  GO TO L2011;       /* RSTR */                    17250000
            WHEN (35)  GO TO L2011;       /* WIZD */                    17260000
            WHEN (36)  GO TO L2011;       /* ORAC */                    17270000
            OTHERWISE  CALL BUG(24);                                    17280000
            END;                                                        17290000
                                                                        17300000
 /*                                                                     17310000
    ANALYSE AN OBJECT WORD.  SEE IF THE THING IS HERE,                  17320000
    WHETHER WE'VE GOT A VERB YET, AND SO ON.  OBJECT MUST BE            17330000
    HERE UNLESS VERB IS "FIND" OR "INVENT(ORY)" (AND NO NEW             17340000
    VERB YET TO BE ANALYSED).  WATER AND OIL ARE ALSO FUNNY,            17350000
    SINCE THEY ARE NEVER ACTUALLY DROPPED AT ANY LOCATION,              17360000
    BUT MIGHT BE HERE INSIDE THE BOTTLE OR AS A FEATURE OF              17370000
    THE LOCATION.                                                       17380000
 */                                                                     17390000
                                                                        17400000
 L5000:  OBJ=K;                                                         17410000
         IF FIXED(K) ^= LOC &  ^ HERE(K) THEN GOTO L5100;               17420000
 L5010:  IF WD2 ^= '     ' THEN GOTO L2800;                             17430000
         IF VERB ^= 0 THEN GOTO L4090;                                  17440000
         CALL A5TOA1(WD1,WD1X,TKWORD,K);                                17450000
         CALL LINESKP;                                                  17460000
         INHIB = 'Y';                                                   17470000
         CALL RSPEAK(210);        /* WHAT DO YOU WANT TO DO WITH IT? */ 17480000
         PUT STRING (OUTSTR) EDIT (OUTSTR,(TKWORD(I) DO I=1 TO K),'?')  17490000
                                          (A(32),20 A);                 17500000
         INHIB = 'N';                                                   17510000
         CALL LINEOUT;                                                  17520000
         GOTO L2600;                                                    17530000
                                                                        17540000
 L5100:  IF K ^= GRATE THEN GOTO L5110;                                 17550000
         IF LOC = 1 | LOC = 4 | LOC = 7 THEN K=DPRSSN;                  17560000
         IF LOC > 9 & LOC < 15 THEN K=ENTRNC;                           17570000
         IF K ^= GRATE THEN GOTO L8;                                    17580000
 L5110:  IF K ^= DWARF THEN GOTO L5120;                                 17590000
         DO I=1 TO 5;                                                   17600000
             IF DLOC(I) = LOC & DFLAG >= 2 THEN GOTO L5010;             17610000
             END;                                                       17620000
 L5120:  IF (LIQ(0) = K & HERE(BOTTLE))                                 17630000
                | K = LIQLOC(LOC) THEN GOTO L5010;                      17640000
         IF OBJ ^= PLANT |  ^ AT(PLANT2) | PROP(PLANT2) = 0             17650000
               THEN GOTO L5130;                                         17660000
         OBJ=PLANT2;                                                    17670000
         GOTO L5010;                                                    17680000
 L5130:  IF OBJ ^= KNIFE | KNFLOC ^= LOC THEN GOTO L5140;               17690000
         KNFLOC=-1;                                                     17700000
         SPK=116;                                                       17710000
         GOTO L2011;                                                    17720000
 L5140:  IF OBJ ^= ROD |  ^HERE(ROD2) THEN GOTO L5190;                  17730000
         OBJ=ROD2;                                                      17740000
         GOTO L5010;                                                    17750000
 L5190:  IF (VERB = FIND | VERB = INVENT) & WD2 = '     '               17760000
              THEN GOTO L5010;                                          17770000
         CALL A5TOA1(WD1,WD1X,TKWORD,K);                                17780000
         CALL LINESKP;                                                  17790000
         INHIB = 'Y';                                                   17800000
         CALL RSPEAK(220);                                              17810000
         PUT STRING (OUTSTR) EDIT                                       17820000
              (OUTSTR,(TKWORD(I) DO I=1 TO K),' here!')                 17830000
             (A(9),20 A);                                               17840000
         INHIB = 'N';                                                   17850000
         CALL LINEOUT;                                                  17860000
         GOTO L2012;                                                    17870000
 /* FIGURE OUT THE NEW LOCATION                                         17880000
                                                                        17890000
    GIVEN THE CURRENT LOCATION IN "LOC", AND A MOTION VERB              17900000
    NUMBER IN "K", PUT THE NEW LOCATION IN "NEWLOC".  THE               17910000
    CURRENT LOC IS SAVED IN "OLDLOC" IN CASE HE WANTS TO                17920000
    RETREAT.  THE CURRENT OLDLOC IS SAVED IN OLDLC2, IN CASE            17930000
    HE DIES.  (IF HE DOES, NEWLOC WILL BE LIMBO, AND OLDLOC             17940000
    WILL BE WHAT KILLED HIM, SO WE NEED OLDLC2, WHICH IS THE            17950000
    LAST PLACE HE WAS SAFE.)                                            17960000
 */                                                                     17970000
                                                                        17980000
 L8:     KK=KEY(LOC);                                                   17990000
         NEWLOC=LOC;                                                    18000000
         IF KK = 0 THEN CALL BUG(26);                                   18010000
         IF K = NULLX THEN GOTO L2;                                     18020000
         IF K = BACK THEN GOTO L20;                                     18030000
         IF K = LOOK THEN GOTO L30;                                     18040000
         IF K = CAVE THEN GOTO L40;                                     18050000
         OLDLC2=OLDLOC;                                                 18060000
         OLDLOC=LOC;                                                    18070000
                                                                        18080000
 L9:     LL=ABS(TRAVEL(KK));                                            18090000
         IF MOD(LL,1000) = 1 | MOD(LL,1000) = K THEN GOTO L10;          18100000
         IF TRAVEL(KK) < 0 THEN GOTO L50;                               18110000
         KK=KK+1;                                                       18120000
         GOTO L9;                                                       18130000
                                                                        18140000
 L10:    LL=LL/1000;                                                    18150000
 L11:    NEWLOC=LL/1000;                                                18160000
         K=MOD(NEWLOC,100);                                             18170000
         IF NEWLOC <= 300 THEN GOTO L13;                                18180000
         IF PROP(K) ^= NEWLOC/100-3 THEN GOTO L16;                      18190000
 L12:    IF TRAVEL(KK) < 0 THEN CALL BUG(25);                           18200000
         KK=KK+1;                                                       18210000
         NEWLOC=ABS(TRAVEL(KK))/1000;                                   18220000
         IF NEWLOC = LL THEN GOTO L12;                                  18230000
         LL=NEWLOC;                                                     18240000
         GOTO L11;                                                      18250000
                                                                        18260000
 L13:    IF NEWLOC <= 100 THEN GOTO L14;                                18270000
         IF TOTING(K) | (NEWLOC > 200 & AT(K)) THEN GOTO L16;           18280000
         GOTO L12;                                                      18290000
                                                                        18300000
 L14:    IF NEWLOC ^= 0 &  ^PCT(NEWLOC) THEN GOTO L12;                  18310000
 L16:    NEWLOC=MOD(LL,1000);                                           18320000
         IF NEWLOC <= 300 THEN GOTO L2;                                 18330000
         IF NEWLOC <= 500 THEN GOTO L30000;                             18340000
         CALL RSPEAK(NEWLOC-500);                                       18350000
         NEWLOC=LOC;                                                    18360000
         GOTO L2;                                                       18370000
                                                                        18380000
 /*                                                                     18390000
    SPECIAL MOTIONS COME HERE.  LABELLING CONVENTION:                   18400000
    STATEMENT NUMBERS NNNXX (XX=00-99) ARE USED FOR SPECIAL             18410000
    CASE NUMBER NNN (NNN=301-500).                                      18420000
 */                                                                     18430000
                                                                        18440000
 L30000: NEWLOC=NEWLOC-300;                                             18450000
         SELECT (NEWLOC-1);                                             18460000
             WHEN (00)  GO TO L30100;                                   18470000
             WHEN (01)  GO TO L30200;                                   18480000
             WHEN (02)  GO TO L30300;                                   18490000
             OTHERWISE  CALL BUG(20);                                   18500000
             END;                                                       18510000
                                                                        18520000
 /*                                                                     18530000
    TRAVEL 301.  PLOVER-ALCOVE PASSAGE.  CAN CARRY ONLY                 18540000
    EMERALD.  NOTE:  TRAVEL TABLE MUST INCLUDE "USELESS"                18550000
    ENTRIES GOING THROUGH PASSAGE, WHICH CAN NEVER BE USED              18560000
    FOR ACTUAL MOTION, BUT CAN BE SPOTTED BY "GO BACK".                 18570000
 */                                                                     18580000
                                                                        18590000
 L30100: NEWLOC=99+100-LOC;                                             18600000
         IF HOLDNG = 0 | (HOLDNG = 1 & TOTING(EMRALD)) THEN GOTO L2;    18610000
         NEWLOC=LOC;                                                    18620000
         CALL RSPEAK(117);                                              18630000
         GOTO L2;                                                       18640000
                                                                        18650000
 /*                                                                     18660000
    TRAVEL 302.  PLOVER TRANSPORT.  DROP THE EMERALD (ONLY              18670000
    USE SPECIAL TRAVEL IF TOTING IT), SO HE'S FORCED TO USE             18680000
    THE PLOVER-PASSAGE TO GET IT OUT.  HAVING DROPPED IT, GO            18690000
    BACK AND PRETEND HE WASN'T CARRYING IT AFTER ALL.                   18700000
 */                                                                     18710000
                                                                        18720000
 L30200: CALL DROP(EMRALD,LOC);                                         18730000
         GOTO L12;                                                      18740000
                                                                        18750000
 /*                                                                     18760000
    TRAVEL 303.  TROLL BRIDGE.  MUST BE DONE ONLY AS SPECIAL            18770000
    MOTION SO THAT DWARFS WON'T WANDER ACROSS AND ENCOUNTER             18780000
    THE BEAR.  (THEY WON'T FOLLOW THE PLAYER THERE BECAUSE              18790000
    THAT REGION IS FORBIDDEN TO THE PIRATE.) IF                         18800000
    PROP(TROLL)=1, HE'S CROSSED SINCE PAYING, SO STEP OUT AND           18810000
    BLOCK HIM.  (STANDARD TRAVEL ENTRIES CHECK FOR                      18820000
    PROP(TROLL)=0.) SPECIAL STUFF FOR BEAR.                             18830000
 */                                                                     18840000
                                                                        18850000
 L30300: IF PROP(TROLL) ^= 1 THEN GOTO L30310;                          18860000
         CALL PSPEAK(TROLL,1);                                          18870000
         PROP(TROLL)=0;                                                 18880000
         CALL MOVE(TROLL2,0);                                           18890000
         CALL MOVE(TROLL2+100,0);                                       18900000
         CALL MOVE(TROLL,PLAC(TROLL));                                  18910000
         CALL MOVE(TROLL+100,FIXD(TROLL));                              18920000
         CALL JUGGLE(CHASM);                                            18930000
         NEWLOC=LOC;                                                    18940000
         GOTO L2;                                                       18950000
                                                                        18960000
 L30310: NEWLOC=PLAC(TROLL)+FIXD(TROLL)-LOC;                            18970000
         IF PROP(TROLL) = 0 THEN PROP(TROLL)=1;                         18980000
         IF ^TOTING(BEAR) THEN GOTO L2;                                 18990000
         CALL RSPEAK(162);                                              19000000
         PROP(CHASM)=1;                                                 19010000
         PROP(TROLL)=2;                                                 19020000
         CALL DROP(BEAR,NEWLOC);                                        19030000
         FIXED(BEAR)=-1;                                                19040000
         PROP(BEAR)=3;                                                  19050000
         IF PROP(SPICES) < 0 THEN TALLY2=TALLY2+1;                      19060000
         OLDLC2=NEWLOC;                                                 19070000
         GOTO L99;                                                      19080000
                                                                        19090000
 /* END OF SPECIALS. */                                                 19100000
                                                                        19110000
 /*                                                                     19120000
    HANDLE "GO BACK".  LOOK FOR VERB WHICH GOES FROM LOC TO             19130000
    OLDLOC, OR TO OLDLC2 IF OLDLOC HAS FORCED-MOTION.  K2               19140000
    SAVES ENTRY -> FORCED LOC -> PREVIOUS LOC.                          19150000
 */                                                                     19160000
                                                                        19170000
 L20:    K=OLDLOC;                                                      19180000
         IF FORCED(K) THEN K=OLDLC2;                                    19190000
         OLDLC2=OLDLOC;                                                 19200000
         OLDLOC=LOC;                                                    19210000
         K2=0;                                                          19220000
         IF K ^= LOC THEN GOTO L21;                                     19230000
         CALL RSPEAK(91);                                               19240000
         GOTO L2;                                                       19250000
                                                                        19260000
 L21:    LL=MOD((ABS(TRAVEL(KK))/1000),1000);                           19270000
         IF LL = K THEN GOTO L25;                                       19280000
         IF LL > 300 THEN GOTO L22;                                     19290000
         J=KEY(LL);                                                     19300000
         IF FORCED(LL) & MOD((ABS(TRAVEL(J))/1000),1000) = K            19310000
              THEN K2=KK;                                               19320000
 L22:    IF TRAVEL(KK) < 0 THEN GOTO L23;                               19330000
         KK=KK+1;                                                       19340000
         GOTO L21;                                                      19350000
                                                                        19360000
 L23:    KK=K2;                                                         19370000
         IF KK ^= 0 THEN GOTO L25;                                      19380000
         CALL RSPEAK(140);                                              19390000
         GOTO L2;                                                       19400000
                                                                        19410000
 L25:    K=MOD(ABS(TRAVEL(KK)),1000);                                   19420000
         KK=KEY(LOC);                                                   19430000
         GOTO L9;                                                       19440000
                                                                        19450000
 /*                                                                     19460000
    LOOK.  CAN'T GIVE MORE DETAIL.  PRETEND IT WASN'T DARK              19470000
    (THOUGH IT MAY "NOW" BE DARK) SO HE WON'T FALL INTO A PIT           19480000
    WHILE STARING INTO THE GLOOM.                                       19490000
 */                                                                     19500000
                                                                        19510000
 L30:    CALL CLRSCRN;                                                  19520000
         IF DETAIL < 3 THEN CALL RSPEAK(15);                            19530000
         DETAIL=DETAIL+1;                                               19540000
 L31:    WZDARK='0'B;                                                   19550000
         ABB(LOC)=0;                                                    19560000
         GOTO L2;                                                       19570000
                                                                        19580000
 /* CAVE.  DIFFERENT MESSAGES DEPENDING ON WHETHER ABOVE GROUND. */     19590000
                                                                        19600000
 L40:    IF LOC < 8 THEN CALL RSPEAK(57);                               19610000
         IF LOC >= 8 THEN CALL RSPEAK(58);                              19620000
         GOTO L2;                                                       19630000
                                                                        19640000
 /* NON-APPLICABLE MOTION.  VARIOUS MESSAGES DEPENDING ON               19650000
    WORD GIVEN.  */                                                     19660000
                                                                        19670000
 L50:    SPK=12;                                                        19680000
         IF K >= 43 & K <= 50 & LOC <= 143 THEN SPK=9;                  19690000
         IF K = 29 | K = 30 THEN SPK=9;                                 19700000
         IF K = 7 | K = 36 | K = 37 THEN SPK=10;                        19710000
         IF K = 11 | K = 19 THEN SPK=11;                                19720000
         IF VERB = FIND | VERB = INVENT THEN SPK=59;                    19730000
         IF K = 62 | K = 65 | K = 78 THEN SPK=42;                       19740000
         IF K = 17 THEN SPK=80;                                         19750000
         CALL RSPEAK(SPK);                                              19760000
         GOTO L2;                                                       19770000
                                                                        19780000
 /*                                                                     19790000
    "YOU'RE DEAD, JIM."                                                 19800000
                                                                        19810000
    IF THE CURRENT LOC IS ZERO, IT MEANS THE CLOWN GOT                  19820000
    HIMSELF KILLED.  WE'LL ALLOW THIS MAXDIE TIMES.  MAXDIE             19830000
    IS AUTOMATICALLY SET BASED ON THE NUMBER OF SNIDE                   19840000
    MESSAGES AVAILABLE.  EACH DEATH RESULTS IN A MESSAGE (81,           19850000
    83, ETC.) WHICH OFFERS REINCARNATION- IF ACCEPTED, THIS             19860000
    RESULTS IN MESSAGE 82, 84, ETC.  THE LAST TIME, IF HE               19870000
    WANTS ANOTHER CHANCE, HE GETS A SNIDE REMARK AS WE EXIT.            19880000
    WHEN REINCARNATED, ALL OBJECTS BEING CARRIED GET DROPPED            19890000
    AT OLDLC2 (PRESUMABLY THE LAST PLACE PRIOR TO BEING                 19900000
    KILLED) WITHOUT CHANGE OF PROPS.  THE LOOP RUNS BACKWARDS           19910000
    TO ASSURE THAT THE BIRD IS DROPPED BEFORE THE CAGE.                 19920000
    (THIS KLUGE COULD BE CHANGED ONCE WE'RE SURE ALL                    19930000
    REFERENCES TO BIRD AND CAGE ARE DONE BY KEYWORDS.) THE              19940000
    LAMP IS A SPECIAL CASE (IT WOULDN'T DO TO LEAVE IT IN THE           19950000
    CAVE).  IT IS TURNED OFF AND LEFT OUTSIDE THE BUILDING              19960000
    (ONLY IF HE WAS CARRYING IT, OF COURSE).  HE HIMSELF IS             19970000
    LEFT INSIDE THE BUILDING (AND HEAVEN HELP HIM IF HE TRIES           19980000
    TO XYZZY BACK INTO THE CAVE WITHOUT THE LAMP!).  OLDLOC             19990000
    IS ZAPPED SO HE CAN'T JUST "RETREAT".                               20000000
                                                                        20010000
    THE EASIEST WAY TO GET KILLED IS TO FALL INTO A PIT IN              20020000
    PITCH DARKNESS.                                                     20030000
 */                                                                     20040000
                                                                        20050000
 L90:    CALL RSPEAK(23);                                               20060000
         OLDLC2=LOC;                                                    20070000
                                                                        20080000
 /* OKAY, HE'S DEAD.  LET'S GET ON WITH IT. */                          20090000
                                                                        20100000
 L99:    IF CLOSNG THEN GOTO L95;                                       20110000
         YEA=YES(81+NUMDIE*2,82+NUMDIE*2,54);                           20120000
         NUMDIE=NUMDIE+1;                                               20130000
         IF NUMDIE = MAXDIE |  ^YEA                                     20140000
         THEN GOTO L20000;                                              20150000
         PLACE(WATER)=0;                                                20160000
         PLACE(OIL)=0;                                                  20170000
         IF TOTING(LAMP) THEN PROP(LAMP)=0;                             20180000
         DO J=1 TO 100;                                                 20190000
             I=101-J;                                                   20200000
             IF ^TOTING(I) THEN GOTO L98;                               20210000
             K=OLDLC2;                                                  20220000
             IF I = LAMP THEN K=1;                                      20230000
             CALL DROP(I,K);                                            20240000
 L98:        END;                                                       20250000
         LOC=3;                                                         20260000
         OLDLOC=LOC;                                                    20270000
         GOTO L2000;                                                    20280000
                                                                        20290000
 /* HE DIED DURING CLOSING TIME.  NO RESURRECTION.  TALLY UP            20300000
    A DEATH AND EXIT.  */                                               20310000
                                                                        20320000
 L95:    CALL RSPEAK(131);                                              20330000
         NUMDIE=NUMDIE+1;                                               20340000
         GOTO L20000;                                                   20350000
                                                                        20360000
 /*                                                                     20370000
    ROUTINES FOR PERFORMING THE VARIOUS ACTION VERBS                    20380000
                                                                        20390000
    STATEMENT NUMBERS IN THIS SECTION ARE 8000 FOR                      20400000
    INTRANSITIVE VERBS, 9000 FOR TRANSITIVE, PLUS TEN TIMES             20410000
    THE VERB NUMBER.  MANY INTRANSITIVE VERBS USE THE                   20420000
    TRANSITIVE CODE, AND SOME VERBS USE CODE FOR OTHER VERBS,           20430000
    AS NOTED BELOW.                                                     20440000
                                                                        20450000
    RANDOM INTRANSITIVE VERBS COME HERE.  CLEAR OBJ JUST IN             20460000
    CASE (SEE "ATTACK").                                                20470000
 */                                                                     20480000
                                                                        20490000
 L8000:  CALL A5TOA1(WD1,WD1X,TKWORD,K);                                20500000
         CALL LINESKP;                                                  20510000
         PUT STRING (OUTSTR) EDIT                                       20520000
              ((TKWORD(I) DO I=1 TO K),' what?') (A,20 A);              20530000
         CALL LINEOUT;                                                  20540000
         OBJ=0;                                                         20550000
         GOTO L2600;                                                    20560000
                                                                        20570000
 /* CARRY, NO OBJECT GIVEN YET.  OK IF ONLY ONE OBJECT PRESENT. */      20580000
                                                                        20590000
 L8010:  IF ATLOC(LOC) = 0 | LINK(ATLOC(LOC)) ^= 0 THEN GOTO L8000;     20600000
         DO I=1 TO 5;                                                   20610000
             IF DLOC(I) = LOC & DFLAG >= 2 THEN GOTO L8000;             20620000
             END;                                                       20630000
         OBJ=ATLOC(LOC);                                                20640000
                                                                        20650000
 /*                                                                     20660000
    CARRY AN OBJECT.  SPECIAL CASES FOR BIRD AND CAGE (IF               20670000
    BIRD IN CAGE, CAN'T TAKE ONE WITHOUT THE OTHER.  LIQUIDS            20680000
    ALSO SPECIAL, SINCE THEY DEPEND ON STATUS OF BOTTLE.                20690000
    ALSO VARIOUS SIDE EFFECTS, ETC.                                     20700000
 */                                                                     20710000
                                                                        20720000
 L9010:  IF TOTING(OBJ) THEN GOTO L2011;                                20730000
         SPK=25;                                                        20740000
         IF OBJ = RUBY & ^DARK(0)                                       20750000
         THEN DO;                                                       20760000
              IF HERE(LADDER) & PROP(LADDER) = 0 THEN GO TO L8331;      20770000
              CALL RSPEAK(202);                                         20780000
              GO TO L99;                                                20790000
              END;                                                      20800000
         IF OBJ = PLANT & PROP(PLANT) <= 0 THEN SPK=115;                20810000
         IF OBJ = BEAR & PROP(BEAR) = 1 THEN SPK=169;                   20820000
         IF OBJ = CHAIN & PROP(BEAR) ^= 0 THEN SPK=170;                 20830000
         IF FIXED(OBJ) ^= 0 THEN GOTO L2011;                            20840000
         IF OBJ ^= WATER & OBJ ^= OIL THEN GOTO L9017;                  20850000
         IF HERE(BOTTLE) & LIQ(0) = OBJ THEN GOTO L9018;                20860000
         OBJ=BOTTLE;                                                    20870000
         IF TOTING(BOTTLE) & PROP(BOTTLE) = 1 THEN GOTO L9220;          20880000
         IF PROP(BOTTLE) ^= 1 THEN SPK=105;                             20890000
         IF ^TOTING(BOTTLE) THEN SPK=104;                               20900000
         GOTO L2011;                                                    20910000
 L9018:  OBJ=BOTTLE;                                                    20920000
 L9017:  IF HOLDNG < 7 THEN GOTO L9016;                                 20930000
         CALL RSPEAK(92);                                               20940000
         GOTO L2012;                                                    20950000
 L9016:  IF OBJ ^= BIRD THEN GOTO L9014;                                20960000
         IF PROP(BIRD) ^= 0 THEN GOTO L9014;                            20970000
         IF ^TOTING(ROD) THEN GOTO L9013;                               20980000
         CALL RSPEAK(26);                                               20990000
         GOTO L2012;                                                    21000000
 L9013:  IF TOTING(CAGE) THEN GOTO L9015;                               21010000
         CALL RSPEAK(27);                                               21020000
         GOTO L2012;                                                    21030000
 L9015:  PROP(BIRD)=1;                                                  21040000
 L9014:  IF (OBJ = BIRD | OBJ = CAGE) & PROP(BIRD) ^= 0                 21050000
             THEN CALL CARRY(BIRD+CAGE-OBJ,LOC);                        21060000
         IF OBJ = BRACELET & LOC = 144 THEN PROP(BRACELET)=0;           21070000
         CALL CARRY(OBJ,LOC);                                           21080000
         K=LIQ(0);                                                      21090000
         IF OBJ = BOTTLE & K ^= 0 THEN PLACE(K)=-1;                     21100000
         GOTO L2009;                                                    21110000
                                                                        21120000
 /*                                                                     21130000
    DISCARD OBJECT.  "THROW" ALSO COMES HERE FOR MOST                   21140000
    OBJECTS.  SPECIAL CASES FOR BIRD (MIGHT ATTACK SNAKE OR             21150000
    DRAGON) AND CAGE (MIGHT CONTAIN BIRD) AND VASE.  DROP               21160000
    COINS AT VENDING MACHINE FOR EXTRA BATTERIES.                       21170000
 */                                                                     21180000
                                                                        21190000
 L9020:  IF TOTING(ROD2) & OBJ = ROD &  ^ TOTING(ROD) THEN OBJ=ROD2;    21200000
         IF ^TOTING(OBJ) THEN GOTO L2011;                               21210000
         IF OBJ ^= BIRD |  ^ HERE(SNAKE) THEN GOTO L9024;               21220000
         CALL RSPEAK(30);                                               21230000
         IF CLOSED THEN GOTO L19000;                                    21240000
         CALL DSTROY(SNAKE);                                            21250000
                                                                        21260000
 /* SET PROP FOR USE BY TRAVEL OPTIONS */                               21270000
                                                                        21280000
         PROP(SNAKE)=1;                                                 21290000
 L9021:  K=LIQ(0);                                                      21300000
         IF K = OBJ THEN OBJ=BOTTLE;                                    21310000
         IF OBJ = BOTTLE & K ^= 0 THEN PLACE(K)=0;                      21320000
         IF OBJ = CAGE & PROP(BIRD) ^= 0 THEN CALL DROP(BIRD,LOC);      21330000
         IF OBJ = BIRD THEN PROP(BIRD)=0;                               21340000
         CALL DROP(OBJ,LOC);                                            21350000
         GOTO L2012;                                                    21360000
                                                                        21370000
 L9024:  IF OBJ ^= COINS |  ^ HERE(VEND) THEN GOTO L9025;               21380000
         CALL DSTROY(COINS);                                            21390000
         CALL DROP(BATTER,LOC);                                         21400000
         CALL PSPEAK(BATTER,0);                                         21410000
         GOTO L2012;                                                    21420000
                                                                        21430000
 L9025:  IF OBJ ^= BIRD |  ^ AT(DRAGON) | PROP(DRAGON) ^= 0             21440000
                THEN GOTO L9026;                                        21450000
         CALL RSPEAK(154);                                              21460000
         CALL DSTROY(BIRD);                                             21470000
         PROP(BIRD)=0;                                                  21480000
         IF PLACE(SNAKE) = PLAC(SNAKE) THEN TALLY2=TALLY2+1;            21490000
         GOTO L2012;                                                    21500000
                                                                        21510000
 L9026:  IF OBJ ^= BEAR |  ^AT(TROLL) THEN GOTO L9027;                  21520000
         CALL RSPEAK(163);                                              21530000
         CALL MOVE(TROLL,0);                                            21540000
         CALL MOVE(TROLL+100,0);                                        21550000
         CALL MOVE(TROLL2,PLAC(TROLL));                                 21560000
         CALL MOVE(TROLL2+100,FIXD(TROLL));                             21570000
         CALL JUGGLE(CHASM);                                            21580000
         PROP(TROLL)=2;                                                 21590000
         GOTO L9021;                                                    21600000
                                                                        21610000
 L9027:  IF OBJ = VASE & LOC ^= PLAC(PILLOW) THEN GOTO L9028;           21620000
         IF OBJ = BRACELET & LOC = 144 THEN PROP(BRACELET) = 1;         21630000
         CALL RSPEAK(54);                                               21640000
         GOTO L9021;                                                    21650000
                                                                        21660000
 L9028:  PROP(VASE)=2;                                                  21670000
         IF AT(PILLOW) THEN PROP(VASE)=0;                               21680000
         CALL PSPEAK(VASE,PROP(VASE)+1);                                21690000
         IF PROP(VASE) ^= 0 THEN FIXED(VASE)=-1;                        21700000
         GOTO L9021;                                                    21710000
                                                                        21720000
 /* SAY.  ECHO WD2 (OR WD1 IF NO WD2 (SAY WHAT?, ETC.).)                21730000
    MAGIC WORDS OVERRIDE.  */                                           21740000
                                                                        21750000
 L9030:  CALL A5TOA1(WD2,WD2X,TKWORD,K);                                21760000
         IF WD2 = '     ' THEN CALL A5TOA1(WD1,WD1X,TKWORD,K);          21770000
         IF WD2 ^= '     ' THEN WD1=WD2;                                21780000
         I=VOCAB(WD1,-1);                                               21790000
         IF I = 62 | I = 65 | I = 71 | I = 2025 THEN GO TO L9035;       21800000
         IF I = 1066 | I = 2036 & HERE(ORAC) THEN GO TO L9035;          21810000
         CALL LINESKP;                                                  21820000
         INHIB = 'Y';                                                   21830000
         CALL RSPEAK(221);                              /* OKAY, ".. */ 21840000
         PUT STRING (OUTSTR) EDIT                                       21850000
                (OUTSTR,(TKWORD(I) DO I=1 TO K),'".') (A(7),20 A);      21860000
         INHIB = 'N';                                                   21870000
         CALL LINEOUT;                                                  21880000
         GOTO L2012;                                                    21890000
                                                                        21900000
 L9035:  WD2='     ';                                                   21910000
         OBJ=0;                                                         21920000
         IF I = 1066 THEN SUBSTR(WD1,5,1) = '?';            /* ORAC? */ 21930000
         GOTO L2630;                                                    21940000
                                                                        21950000
 /* LOCK, UNLOCK, NO OBJECT GIVEN.  ASSUME VARIOUS THINGS IF            21960000
    PRESENT.  */                                                        21970000
                                                                        21980000
 L8040:  SPK=28;                                                        21990000
         IF HERE(CLAM) THEN OBJ=CLAM;                                   22000000
         IF HERE(OYSTER) THEN OBJ=OYSTER;                               22010000
         IF AT(DOOR) THEN OBJ=DOOR;                                     22020000
         IF AT(GRATE) THEN OBJ=GRATE;                                   22030000
         IF OBJ ^= 0 & HERE(CHAIN) THEN GOTO L8000;                     22040000
         IF HERE(CHAIN) THEN OBJ=CHAIN;                                 22050000
         IF OBJ = 0 THEN GOTO L2011;                                    22060000
                                                                        22070000
 /* LOCK, UNLOCK OBJECT.  SPECIAL STUFF FOR OPENING                     22080000
    CLAM/OYSTER AND FOR CHAIN.  */                                      22090000
                                                                        22100000
 L9040:  IF OBJ = CLAM | OBJ = OYSTER THEN GOTO L9046;                  22110000
         IF OBJ = DOOR THEN SPK=111;                                    22120000
         IF OBJ = DOOR & PROP(DOOR) = 1 THEN SPK=54;                    22130000
         IF OBJ = CAGE THEN SPK=32;                                     22140000
         IF OBJ = KEYS THEN SPK=55;                                     22150000
         IF OBJ = GRATE | OBJ = CHAIN THEN SPK=31;                      22160000
         IF SPK ^= 31 |  ^ HERE(KEYS) THEN GOTO L2011;                  22170000
         IF OBJ = CHAIN THEN GOTO L9048;                                22180000
         IF ^CLOSNG THEN GOTO L9043;                                    22190000
         K=130;                                                         22200000
         IF ^PANIC THEN CLOCK2=15;                                      22210000
         PANIC='1'B;                                                    22220000
         GOTO L2010;                                                    22230000
                                                                        22240000
 L9043:  K=34+PROP(GRATE);                                              22250000
         PROP(GRATE)=1;                                                 22260000
         IF VERB = LOCK THEN PROP(GRATE)=0;                             22270000
         K=K+2*PROP(GRATE);                                             22280000
         GOTO L2010;                                                    22290000
                                                                        22300000
 /* CLAM/OYSTER. */                                                     22310000
                                                                        22320000
 L9046:  K=0;                                                           22330000
         IF OBJ = OYSTER THEN K=1;                                      22340000
         SPK=124+K;                                                     22350000
         IF TOTING(OBJ) THEN SPK=120+K;                                 22360000
         IF ^TOTING(TRIDNT) THEN SPK=122+K;                             22370000
         IF VERB = LOCK THEN SPK=61;                                    22380000
         IF SPK ^= 124 THEN GOTO L2011;                                 22390000
         CALL DSTROY(CLAM);                                             22400000
         CALL DROP(OYSTER,LOC);                                         22410000
         CALL DROP(PEARL,105);                                          22420000
         GOTO L2011;                                                    22430000
                                                                        22440000
 /* CHAIN. */                                                           22450000
                                                                        22460000
 L9048:  IF VERB = LOCK THEN GOTO L9049;                                22470000
         SPK=171;                                                       22480000
         IF PROP(BEAR) = 0 THEN SPK=41;                                 22490000
         IF PROP(CHAIN) = 0 THEN SPK=37;                                22500000
         IF SPK ^= 171 THEN GOTO L2011;                                 22510000
         PROP(CHAIN)=0;                                                 22520000
         FIXED(CHAIN)=0;                                                22530000
         IF PROP(BEAR) ^= 3 THEN PROP(BEAR)=2;                          22540000
         FIXED(BEAR)=2-PROP(BEAR);                                      22550000
         GOTO L2011;                                                    22560000
                                                                        22570000
 L9049:  SPK=172;                                                       22580000
         IF PROP(CHAIN) ^= 0 THEN SPK=34;                               22590000
         IF LOC ^= PLAC(CHAIN) THEN SPK=173;                            22600000
         IF SPK ^= 172 THEN GOTO L2011;                                 22610000
         PROP(CHAIN)=2;                                                 22620000
         IF TOTING(CHAIN) THEN CALL DROP(CHAIN,LOC);                    22630000
         FIXED(CHAIN)=-1;                                               22640000
         GOTO L2011;                                                    22650000
                                                                        22660000
 /* LIGHT LAMP */                                                       22670000
                                                                        22680000
 L9070:  IF ^HERE(LAMP) THEN GOTO L2011;                                22690000
         SPK=184;                                                       22700000
         IF LIMIT < 0 THEN GOTO L2011;                                  22710000
         PROP(LAMP)=1;                                                  22720000
         CALL RSPEAK(39);                                               22730000
         IF WZDARK THEN GOTO L2000;                                     22740000
         GOTO L2012;                                                    22750000
                                                                        22760000
 /* LAMP OFF */                                                         22770000
                                                                        22780000
 L9080:  IF ^HERE(LAMP) THEN GOTO L2011;                                22790000
         PROP(LAMP)=0;                                                  22800000
         CALL RSPEAK(40);                                               22810000
         IF DARK(0) THEN CALL RSPEAK(16);                               22820000
         GOTO L2012;                                                    22830000
                                                                        22840000
 /* WAVE.  NO EFFECT UNLESS WAVING ROD AT FISSURE. */                   22850000
                                                                        22860000
 L9090:  IF (^TOTING(OBJ)) & (OBJ ^= ROD |  ^ TOTING(ROD2))             22870000
          THEN SPK=29;                                                  22880000
         IF OBJ ^= ROD |  ^ AT(FISSUR) |  ^ TOTING(OBJ)                 22890000
          | CLOSNG THEN GOTO L2011;                                     22900000
         PROP(FISSUR)=1-PROP(FISSUR);                                   22910000
         CALL PSPEAK(FISSUR,2-PROP(FISSUR));                            22920000
         GOTO L2012;                                                    22930000
                                                                        22940000
 /*                                                                     22950000
    ATTACK.  ASSUME TARGET IF UNAMBIGUOUS.  "THROW" ALSO                22960000
    LINKS HERE.  ATTACKABLE OBJECTS FALL INTO TWO CATEGORIES:           22970000
    ENEMIES (SNAKE, DWARF, ETC.) AND OTHERS (BIRD, CLAM).               22980000
    AMBIGUOUS IF TWO ENEMIES, OR IF NO ENEMIES BUT TWO                  22990000
    OTHERS.                                                             23000000
 */                                                                     23010000
                                                                        23020000
 L9120:  DO I=1 TO 5;                                                   23030000
             IF DLOC(I) = LOC & DFLAG >= 2 THEN GOTO L9122;             23040000
             END;                                                       23050000
         I=0;                                                           23060000
 L9122:  IF OBJ ^= 0 THEN GOTO L9124;                                   23070000
         IF I ^= 0 THEN OBJ=DWARF;                                      23080000
         IF HERE(SNAKE) THEN OBJ=OBJ*100+SNAKE;                         23090000
         IF AT(DRAGON) & PROP(DRAGON) = 0 THEN OBJ=OBJ*100+DRAGON;      23100000
         IF AT(TROLL) THEN OBJ=OBJ*100+TROLL;                           23110000
         IF HERE(BEAR) & PROP(BEAR) = 0 THEN OBJ=OBJ*100+BEAR;          23120000
         IF OBJ > 100 THEN GOTO L8000;                                  23130000
         IF OBJ ^= 0 THEN GOTO L9124;                                   23140000
                                                                        23150000
 /* CAN'T ATTACK BIRD BY THROWING AXE. */                               23160000
                                                                        23170000
         IF HERE(BIRD) & VERB ^= THROW THEN OBJ=BIRD;                   23180000
                                                                        23190000
 /* CLAM AND OYSTER BOTH TREATED AS CLAM FOR INTRANSITIVE               23200000
    CASE- NO HARM DONE.  */                                             23210000
                                                                        23220000
         IF HERE(CLAM) | HERE(OYSTER) THEN OBJ=100*OBJ+CLAM;            23230000
         IF OBJ > 100 THEN GOTO L8000;                                  23240000
 L9124:  IF OBJ ^= BIRD THEN GOTO L9125;                                23250000
         SPK=137;                                                       23260000
         IF CLOSED THEN GOTO L2011;                                     23270000
         CALL DSTROY(BIRD);                                             23280000
         PROP(BIRD)=0;                                                  23290000
         IF PLACE(SNAKE) = PLAC(SNAKE) THEN TALLY2=TALLY2+1;            23300000
         SPK=45;                                                        23310000
 L9125:  IF OBJ = 0 THEN SPK=44;                                        23320000
         IF OBJ = CLAM | OBJ = OYSTER THEN SPK=150;                     23330000
         IF OBJ = SNAKE THEN SPK=46;                                    23340000
         IF OBJ = DWARF THEN SPK=49;                                    23350000
         IF OBJ = DWARF & CLOSED THEN GOTO L19000;                      23360000
         IF OBJ = DRAGON THEN SPK=167;                                  23370000
         IF OBJ = TROLL THEN SPK=157;                                   23380000
         IF OBJ = BEAR THEN SPK=165+(PROP(BEAR)+1)/2;                   23390000
         IF OBJ ^= DRAGON | PROP(DRAGON) ^= 0 THEN GOTO L2011;          23400000
 /*                                                                     23410000
    FUN STUFF FOR DRAGON.  IF HE INSISTS ON ATTACKING IT,               23420000
    WIN!  SET PROP TO DEAD, MOVE DRAGON TO CENTRAL LOC (STILL           23430000
    FIXED), MOVE RUG THERE (NOT FIXED), AND MOVE HIM THERE,             23440000
    TOO.  THEN DO A NULL MOTION TO GET NEW DESCRIPTION.                 23450000
 */                                                                     23460000
         CALL RSPEAK(49);                                               23470000
         VERB=0;                                                        23480000
         OBJ=0;                                                         23490000
         CALL GETIN(WD1,WD1X,WD2,WD2X);                                 23500000
         IF WD1 ^= 'Y' & WD1 ^= 'YES' THEN GOTO L2608;                  23510000
         CALL PSPEAK(DRAGON,1);                                         23520000
         PROP(DRAGON)=2;                                                23530000
         PROP(RUG)=0;                                                   23540000
         K=(PLAC(DRAGON)+FIXD(DRAGON))/2;                               23550000
         CALL MOVE(DRAGON+100,-1);                                      23560000
         CALL MOVE(RUG+100,0);                                          23570000
         CALL MOVE(DRAGON,K);                                           23580000
         CALL MOVE(RUG,K);                                              23590000
         DO OBJ=1 TO 100;                                               23600000
         IF PLACE(OBJ) = PLAC(DRAGON) | PLACE(OBJ) = FIXD(DRAGON)       23610000
              THEN CALL MOVE(OBJ,K);                                    23620000
             END;                                                       23630000
         LOC=K;                                                         23640000
         K=NULLX;                                                       23650000
         GOTO L8;                                                       23660000
                                                                        23670000
 /*                                                                     23680000
    POUR.  IF NO OBJECT, OR OBJECT IS BOTTLE, ASSUME CONTENTS           23690000
    OF BOTTLE.  SPECIAL TESTS FOR POURING WATER OR OIL ON               23700000
    PLANT OR RUSTY DOOR.                                                23710000
 */                                                                     23720000
                                                                        23730000
 L9130:  IF OBJ = BOTTLE | OBJ = 0 THEN OBJ=LIQ(0);                     23740000
         IF OBJ = 0 THEN GOTO L8000;                                    23750000
         IF ^TOTING(OBJ) THEN GOTO L2011;                               23760000
         SPK=78;                                                        23770000
         IF OBJ ^= OIL & OBJ ^= WATER THEN GOTO L2011;                  23780000
         PROP(BOTTLE)=1;                                                23790000
         PLACE(OBJ)=0;                                                  23800000
         SPK=77;                                                        23810000
         IF ^(AT(PLANT) | AT(DOOR)) THEN GOTO L2011;                    23820000
                                                                        23830000
         IF AT(DOOR) THEN GOTO L9132;                                   23840000
         SPK=112;                                                       23850000
         IF OBJ ^= WATER THEN GOTO L2011;                               23860000
         CALL PSPEAK(PLANT,PROP(PLANT)+1);                              23870000
         PROP(PLANT)=MOD(PROP(PLANT)+2,6);                              23880000
         PROP(PLANT2)=PROP(PLANT)/2;                                    23890000
         K=NULLX;                                                       23900000
         GOTO L8;                                                       23910000
                                                                        23920000
 L9132:  PROP(DOOR)=0;                                                  23930000
         IF OBJ = OIL THEN PROP(DOOR)=1;                                23940000
         SPK=113+PROP(DOOR);                                            23950000
         GOTO L2011;                                                    23960000
                                                                        23970000
 /*                                                                     23980000
    EAT.  INTRANSITIVE:  ASSUME FOOD IF PRESENT, ELSE ASK               23990000
    WHAT.  TRANSITIVE:  FOOD OK, SOME THINGS LOSE APPETITE,             24000000
    REST ARE RIDICULOUS.                                                24010000
 */                                                                     24020000
                                                                        24030000
 L8140:  IF ^HERE(FOOD) THEN GOTO L8000;                                24040000
 L8142:  CALL DSTROY(FOOD);                                             24050000
         SPK=72;                                                        24060000
         GOTO L2011;                                                    24070000
                                                                        24080000
 L9140:  IF OBJ = FOOD THEN GOTO L8142;                                 24090000
         IF OBJ = BIRD | OBJ = SNAKE | OBJ = CLAM | OBJ = OYSTER        24100000
          | OBJ = DWARF | OBJ = DRAGON | OBJ = TROLL                    24110000
          | OBJ = BEAR THEN SPK=71;                                     24120000
         GOTO L2011;                                                    24130000
                                                                        24140000
 /*                                                                     24150000
    DRINK.  IF NO OBJECT, ASSUME WATER AND LOOK FOR IT HERE.            24160000
    IF WATER IS IN THE BOTTLE, DRINK THAT, ELSE MUST BE AT A            24170000
    WATER LOC, SO DRINK STREAM.                                         24180000
 */                                                                     24190000
                                                                        24200000
 L9150:  IF OBJ = 0 & LIQLOC(LOC) ^= WATER & (LIQ(0) ^= WATER           24210000
          |  ^ HERE(BOTTLE)) THEN GOTO L8000;                           24220000
         IF OBJ ^= 0 & OBJ ^= WATER THEN SPK=110;                       24230000
         IF SPK = 110 | LIQ(0) ^= WATER |  ^ HERE(BOTTLE)               24240000
              THEN GOTO L2011;                                          24250000
         PROP(BOTTLE)=1;                                                24260000
         PLACE(WATER)=0;                                                24270000
         SPK=74;                                                        24280000
         GOTO L2011;                                                    24290000
                                                                        24300000
 /* RUB.  YIELDS VARIOUS SNIDE REMARKS. */                              24310000
                                                                        24320000
 L9160:  IF OBJ ^= LAMP THEN SPK=76;                                    24330000
         GOTO L2011;                                                    24340000
                                                                        24350000
 /*                                                                     24360000
    THROW.  SAME AS DISCARD UNLESS AXE.  THEN SAME AS ATTACK            24370000
    EXCEPT IGNORE BIRD, AND IF DWARF IS PRESENT THEN ONE                24380000
    MIGHT BE KILLED.  (ONLY WAY TO DO SO!) AXE ALSO SPECIAL             24390000
    FOR DRAGON, BEAR, AND TROLL.  TREASURES SPECIAL FOR                 24400000
    TROLL.                                                              24410000
 */                                                                     24420000
                                                                        24430000
 L9170:  IF TOTING(ROD2) & OBJ = ROD &  ^ TOTING(ROD) THEN OBJ=ROD2;    24440000
         IF ^TOTING(OBJ) THEN GOTO L2011;                               24450000
         IF OBJ >= 50 & OBJ <= MAXTRS & AT(TROLL) THEN GOTO L9178;      24460000
         IF OBJ = FOOD & HERE(BEAR) THEN GOTO L9177;                    24470000
         IF OBJ ^= AXE THEN GOTO L9020;                                 24480000
         DO I=1 TO 5;                                                   24490000
                                                                        24500000
 /* NEEDN'T CHECK DFLAG IF AXE IS HERE. */                              24510000
                                                                        24520000
             IF DLOC(I) = LOC THEN GOTO L9172;                          24530000
             END;                                                       24540000
         SPK=152;                                                       24550000
         IF AT(DRAGON) & PROP(DRAGON) = 0 THEN GOTO L9175;              24560000
         SPK=158;                                                       24570000
         IF AT(TROLL) THEN GOTO L9175;                                  24580000
         IF HERE(BEAR) & PROP(BEAR) = 0 THEN GOTO L9176;                24590000
         OBJ=0;                                                         24600000
         GOTO L9120;                                                    24610000
                                                                        24620000
 L9172:  SPK=48;                                                        24630000
                                                                        24640000
                                                                        24650000
         IF RAN(3) = 0 THEN GO TO L9175;                                24660000
         DSEEN(I)='0'B;                                                 24670000
         DLOC(I)=0;                                                     24680000
         SPK=47;                                                        24690000
         DKILL=DKILL+1;                                                 24700000
         IF DKILL = 1 THEN SPK=149;                                     24710000
 L9175:  CALL RSPEAK(SPK);                                              24720000
         CALL DROP(AXE,LOC);                                            24730000
         K=NULLX;                                                       24740000
         GOTO L8;                                                       24750000
                                                                        24760000
 /* THIS'LL TEACH HIM TO THROW THE AXE AT THE BEAR! */                  24770000
                                                                        24780000
 L9176:  SPK=164;                                                       24790000
         CALL DROP(AXE,LOC);                                            24800000
         FIXED(AXE)=-1;                                                 24810000
         PROP(AXE)=1;                                                   24820000
         CALL JUGGLE(BEAR);                                             24830000
         GOTO L2011;                                                    24840000
                                                                        24850000
 /* BUT THROWING FOOD IS ANOTHER STORY. */                              24860000
                                                                        24870000
 L9177:  OBJ=BEAR;                                                      24880000
         GOTO L9210;                                                    24890000
                                                                        24900000
 L9178:  SPK=159;                                                       24910000
                                                                        24920000
 /* SNARF A TREASURE FOR THE TROLL. */                                  24930000
                                                                        24940000
         CALL DROP(OBJ,0);                                              24950000
         CALL MOVE(TROLL,0);                                            24960000
         CALL MOVE(TROLL+100,0);                                        24970000
         CALL DROP(TROLL2,PLAC(TROLL));                                 24980000
         CALL DROP(TROLL2+100,FIXD(TROLL));                             24990000
         CALL JUGGLE(CHASM);                                            25000000
         GOTO L2011;                                                    25010000
                                                                        25020000
 /* QUIT.  INTRANSITIVE ONLY.  VERIFY INTENT AND EXIT IF                25030000
    THAT'S WHAT HE WANTS.  */                                           25040000
                                                                        25050000
 L8180:  CALL CLRSCRN;                                                  25060000
         GAVEUP=YES(22,54,54);                                          25070000
 L8185:  IF GAVEUP THEN GOTO L20000;                                    25080000
         GOTO L2012;                                                    25090000
                                                                        25100000
 /* FIND.  MIGHT BE CARRYING IT, OR IT MIGHT BE HERE.  ELSE             25110000
    GIVE CAVEAT.  */                                                    25120000
                                                                        25130000
 L9190:  IF AT(OBJ) | (LIQ(0) = OBJ & AT(BOTTLE))                       25140000
          | K = LIQLOC(LOC) THEN SPK=94;                                25150000
         DO I=1 TO 5;                                                   25160000
             IF DLOC(I) = LOC & DFLAG >= 2 & OBJ = DWARF THEN SPK=94;   25170000
             END;                                                       25180000
         IF CLOSED THEN SPK=138;                                        25190000
         IF TOTING(OBJ) THEN SPK=24;                                    25200000
         GOTO L2011;                                                    25210000
                                                                        25220000
 /* INVENTORY.  IF OBJECT, TREAT SAME AS FIND.  ELSE REPORT             25230000
    ON CURRENT BURDEN.  */                                              25240000
                                                                        25250000
 L8200:  SPK=98;                                                        25260000
         DO I=1 TO 100;                                                 25270000
            IF I = BEAR |  ^ TOTING(I) THEN GOTO L8201;                 25280000
            IF SPK = 98 THEN CALL RSPEAK(99);                           25290000
            BLKLIN='0'B;                                                25300000
            CALL PSPEAK(I,-1);                                          25310000
            BLKLIN='1'B;                                                25320000
            SPK=0;                                                      25330000
 L8201:     END;                                                        25340000
         IF TOTING(BEAR) THEN SPK=141;                                  25350000
         GOTO L2011;                                                    25360000
                                                                        25370000
 /*                                                                     25380000
 FEED.  IF BIRD, NO SEED.  SNAKE, DRAGON, TROLL:  QUIP.  IF             25390000
    DWARF, MAKE HIM MAD.  BEAR, SPECIAL.                                25400000
 */                                                                     25410000
                                                                        25420000
 L9210:  IF OBJ ^= BIRD THEN GOTO L9212;                                25430000
         SPK=100;                                                       25440000
         GOTO L2011;                                                    25450000
                                                                        25460000
 L9212:  IF OBJ ^= SNAKE & OBJ ^= DRAGON & OBJ ^= TROLL THEN GOTO L9213;25470000
         SPK=102;                                                       25480000
         IF OBJ = DRAGON & PROP(DRAGON) ^= 0 THEN SPK=110;              25490000
         IF OBJ = TROLL THEN SPK=182;                                   25500000
         IF OBJ ^= SNAKE | CLOSED |  ^ HERE(BIRD) THEN GOTO L2011;      25510000
         SPK=101;                                                       25520000
         CALL DSTROY(BIRD);                                             25530000
         PROP(BIRD)=0;                                                  25540000
         TALLY2=TALLY2+1;                                               25550000
         GOTO L2011;                                                    25560000
                                                                        25570000
 L9213:  IF OBJ ^= DWARF THEN GOTO L9214;                               25580000
         IF ^HERE(FOOD) THEN GOTO L2011;                                25590000
         SPK=103;                                                       25600000
         DFLAG=DFLAG+1;                                                 25610000
         GOTO L2011;                                                    25620000
                                                                        25630000
 L9214:  IF OBJ ^= BEAR THEN GOTO L9215;                                25640000
         IF PROP(BEAR) = 0 THEN SPK=102;                                25650000
         IF PROP(BEAR) = 3 THEN SPK=110;                                25660000
         IF ^HERE(FOOD) THEN GOTO L2011;                                25670000
         CALL DSTROY(FOOD);                                             25680000
         PROP(BEAR)=1;                                                  25690000
         FIXED(AXE)=0;                                                  25700000
         PROP(AXE)=0;                                                   25710000
         SPK=168;                                                       25720000
         GOTO L2011;                                                    25730000
                                                                        25740000
 L9215:  SPK=14;                                                        25750000
         GOTO L2011;                                                    25760000
                                                                        25770000
 /* FILL.  BOTTLE MUST BE EMPTY, AND SOME LIQUID AVAILABLE.             25780000
    (VASE IS NASTY.) */                                                 25790000
                                                                        25800000
 L9220:  IF OBJ = VASE THEN GOTO L9222;                                 25810000
         IF OBJ ^= 0 & OBJ ^= BOTTLE THEN GOTO L2011;                   25820000
         IF OBJ = 0 &  ^ HERE(BOTTLE) THEN GOTO L8000;                  25830000
         SPK=107;                                                       25840000
         IF LIQLOC(LOC) = 0 THEN SPK=106;                               25850000
         IF LIQ(0) ^= 0 THEN SPK=105;                                   25860000
         IF SPK ^= 107 THEN GOTO L2011;                                 25870000
         PROP(BOTTLE)=MOD(COND(LOC),4)/2;                               25880000
         PROP(BOTTLE)=PROP(BOTTLE)*2;                                   25890000
         K=LIQ(0);                                                      25900000
         IF TOTING(BOTTLE) THEN PLACE(K)=-1;                            25910000
         IF K = OIL THEN SPK=108;                                       25920000
         GOTO L2011;                                                    25930000
                                                                        25940000
 L9222:  SPK=29;                                                        25950000
         IF LIQLOC(LOC) = 0 THEN SPK=144;                               25960000
         IF LIQLOC(LOC) = 0 |  ^TOTING(VASE) THEN GOTO L2011;           25970000
         CALL RSPEAK(145);                                              25980000
         PROP(VASE)=2;                                                  25990000
         FIXED(VASE)=-1;                                                26000000
         GOTO L9024;                                                    26010000
                                                                        26020000
 /* BLAST.  NO EFFECT UNLESS YOU'VE GOT DYNAMITE, WHICH IS A            26030000
    NEAT TRICK!  */                                                     26040000
                                                                        26050000
 L9230:  IF PROP(ROD2) < 0 |  ^ CLOSED THEN GOTO L2011;                 26060000
         BONUS=133;                                                     26070000
         IF LOC = 115 THEN BONUS=134;                                   26080000
         IF HERE(ROD2) THEN BONUS=135;                                  26090000
         CALL RSPEAK(BONUS);                                            26100000
         GOTO L20000;                                                   26110000
                                                                        26120000
 /* SCORE.  GO TO SCORING SECTION, WHICH WILL RETURN TO 8241            26130000
    IF SCORNG IS TRUE.  */                                              26140000
                                                                        26150000
 L8240:  SCORNG='1'B;                                                   26160000
         GOTO L20000;                                                   26170000
                                                                        26180000
 L8241:  SCORNG='0'B;                                                   26190000
         CALL CLRSCRN;                                                  26200000
         INHIB = 'Y';                                                   26210000
         CALL RSPEAK(213);            /* IF YOU WERE TO QUIT NOW ... */ 26220000
         PUT STRING (INSTR) EDIT (SCORE,MXSCOR) (F(4),F(4));            26230000
         SUBSTR(OUTSTR,41,4) = SUBSTR(INSTR,1,4);                       26240000
         SUBSTR(OUTSTR,63,4) = SUBSTR(INSTR,5,4);                       26250000
         INHIB = 'N';                                                   26260000
         CALL LINEOUT;                                                  26270000
         GAVEUP=YES(143,54,54);                                         26280000
         GOTO L8185;                                                    26290000
                                                                        26300000
 /*                                                                     26310000
    FEE FIE FOE FOO (AND FUM).  ADVANCE TO NEXT STATE IF GIVEN          26320000
    IN PROPER ORDER.  LOOK UP WD1 IN SECTION 3 OF VOCAB TO              26330000
    DETERMINE WHICH WORD WE'VE GOT.  LAST WORD ZIPS THE EGGS            26340000
    BACK TO THE GIANT ROOM (UNLESS ALREADY THERE).                      26350000
 */                                                                     26360000
                                                                        26370000
 L8250:  K=VOCAB(WD1,3);                                                26380000
         SPK=42;                                                        26390000
         IF FOOBAR = 1-K THEN GOTO L8252;                               26400000
         IF FOOBAR ^= 0 THEN SPK=151;                                   26410000
         GOTO L2011;                                                    26420000
                                                                        26430000
 L8252:  FOOBAR=K;                                                      26440000
         IF K ^= 4 THEN GOTO L2009;                                     26450000
         FOOBAR=0;                                                      26460000
         IF PLACE(EGGS) = PLAC(EGGS)                                    26470000
          | (TOTING(EGGS) & LOC = PLAC(EGGS)) THEN GOTO L2011;          26480000
                                                                        26490000
 /* BRING BACK TROLL IF WE STEAL THE EGGS BACK FROM HIM                 26500000
    BEFORE CROSSING.  */                                                26510000
                                                                        26520000
         IF PLACE(EGGS) = 0 & PLACE(TROLL) = 0 & PROP(TROLL) = 0        26530000
         THEN PROP(TROLL)=1;                                            26540000
         K=2;                                                           26550000
         IF HERE(EGGS) THEN K=1;                                        26560000
         IF LOC = PLAC(EGGS) THEN K=0;                                  26570000
         CALL MOVE(EGGS,PLAC(EGGS));                                    26580000
         CALL PSPEAK(EGGS,K);                                           26590000
         GOTO L2012;                                                    26600000
                                                                        26610000
 /* BRIEF.  INTRANSITIVE ONLY.  SUPPRESS LONG DESCRIPTIONS              26620000
    AFTER FIRST TIME.  */                                               26630000
                                                                        26640000
 L8260:  SPK=156;                                                       26650000
         ABBNUM=10000;                                                  26660000
         DETAIL=3;                                                      26670000
         GOTO L2011;                                                    26680000
                                                                        26690000
 /* READ.  MAGAZINES IN DWARFISH, MESSAGE WE'VE SEEN, AND .             26700000
    .  .  OYSTER?  */                                                   26710000
                                                                        26720000
 L8270:  IF HERE(MAGZIN) THEN OBJ=MAGZIN;                               26730000
         IF HERE(TABLET) THEN OBJ=OBJ*100+TABLET;                       26740000
         IF HERE(MESSAG) THEN OBJ=OBJ*100+MESSAG;                       26750000
         IF CLOSED & TOTING(OYSTER) THEN OBJ=OYSTER;                    26760000
         IF OBJ > 100 | OBJ = 0 | DARK(0) THEN GOTO L8000;              26770000
                                                                        26780000
 L9270:  IF DARK(0) THEN GOTO L5190;                                    26790000
         IF OBJ = MAGZIN THEN SPK=190;                                  26800000
         IF OBJ = TABLET THEN SPK=196;                                  26810000
         IF OBJ = MESSAG THEN SPK=191;                                  26820000
         IF OBJ = OYSTER & HINTED(2) & TOTING(OYSTER) THEN SPK=194;     26830000
         IF OBJ ^= OYSTER | HINTED(2) |  ^TOTING(OYSTER)                26840000
          |  ^CLOSED THEN GOTO L2011;                                   26850000
         HINTED(2)=YES(192,193,54);                                     26860000
         GOTO L2012;                                                    26870000
                                                                        26880000
 /* BREAK.  ONLY WORKS FOR MIRROR IN REPOSITORY AND, OF                 26890000
    COURSE, THE VASE.  */                                               26900000
                                                                        26910000
 L9280:  IF OBJ = MIRROR THEN SPK=148;                                  26920000
         IF OBJ = VASE & PROP(VASE) = 0 THEN GOTO L9282;                26930000
         IF OBJ ^= MIRROR |  ^CLOSED THEN GOTO L2011;                   26940000
         CALL RSPEAK(197);                                              26950000
         GOTO L19000;                                                   26960000
                                                                        26970000
 L9282:  SPK=198;                                                       26980000
         IF TOTING(VASE) THEN CALL DROP(VASE,LOC);                      26990000
         PROP(VASE)=2;                                                  27000000
         FIXED(VASE)=-1;                                                27010000
         GOTO L2011;                                                    27020000
                                                                        27030000
 /* WAKE.  ONLY USE IS TO DISTURB THE DWARFS. */                        27040000
                                                                        27050000
 L9290:  IF OBJ ^= DWARF |  ^CLOSED THEN GOTO L2011;                    27060000
         CALL RSPEAK(199);                                              27070000
         GOTO L19000;                                                   27080000
                                                                        27090000
 /*                                                                     27100000
    SUSPEND.  OFFER TO EXIT LEAVING THINGS RESTARTABLE, BUT             27110000
    REQUIRING A DELAY BEFORE RESTARTING (SO CAN'T SAVE THE              27120000
    WORLD BEFORE TRYING SOMETHING RISKY).  UPON RESTARTING,             27130000
    SETUP=-1 CAUSES RETURN TO 8305 TO PICK UP AGAIN.                    27140000
 */                                                                     27150000
                                                                        27160000
 L8300:  IF DEMOGM                                                      27170000
         THEN CALL RSPEAK(201);                                         27180000
         ELSE DO;                                                       27190000
              IF SUSPEND# = 10                                          27200000
              THEN DO;             /* LIMIT OF TEN SUSPENDS PER GAME */ 27210000
                   CALL MSPEAK(40);                                     27220000
                   GO TO L2012;                                         27230000
                   END;                                                 27240000
              CALL CIAO;                                                27250000
              CALL MSPEAK(41);                /* NO ROOM FOR SUSPEND */ 27260000
              CALL LINESKP;                                             27270000
              END;                                                      27280000
         GO TO L2012;                                                   27290000
                                                                        27300000
 /* HOURS.  REPORT CURRENT NON-PRIME-TIME HOURS. */                     27310000
                                                                        27320000
 L8310:  CALL MSPEAK(6);                                                27330000
         CALL HOURFMT;                                                  27340000
         GOTO L2012;                                                    27350000
                                                                        27360000
 /* LOG.  TOGGLE LOGGIN EITHER ON OR OFF */                             27370000
                                                                        27380000
 L8320:  LOGON = ^ LOGON;                                               27390000
         IF LOGON THEN CALL MSPEAK(42);          /* LOG ON */           27400000
                  ELSE CALL MSPEAK(43);          /* LOG OFF */          27410000
         CALL LINESKP;                                                  27420000
         GO TO L2012;                                                   27430000
                                                                        27440000
 L8330:  IF ^TOTING(RUBY) THEN GO TO L2011;                             27450000
 L8331:  IF HERE(LADDER) & PROP(LADDER) = 0                             27460000
         THEN DO;                                                       27470000
              PROP(LADDER) = 2;                                         27480000
              SPK = 225;                                                27490000
              END;                                                      27500000
         IF HERE(FFIELD) & PROP(FFIELD) = 0                             27510000
         THEN DO;                                                       27520000
              PROP(FFIELD) = 1;                                         27530000
              SPK = 226;                                                27540000
              END;                                                      27550000
         CALL RSPEAK(SPK);                                              27560000
         GO TO L2000;                                                   27570000
                                                                        27580000
 L8340:  CALL PUTBACK;                                                  27590000
         GO TO L31;                                                     27600000
                                                                        27610000
 L8350:  IF TTYPE ^= 'V' THEN GO TO L2011;                              27620000
         CALL WIZPROC;                                                  27630000
         GO TO L2012;                                                   27640000
                                                                        27650000
 L8360:  IF ^HERE(ORAC)           /* LET ORAC PROVIDE ASSISTANCE (IF */ 27660000
         THEN DO;         /* PIRATE HASN'T STOLEN HIM) IN NAVIGATING */ 27670000
              SPK = 29;  /* THE DIFFICULT MAZE, AND IN SOME TELEPORT */ 27680000
              GO TO L2011;  /* OPERATIONS (VIA DATA LINK TO ZEN, THE */ 27690000
              END;        /* SHIP'S COMPUTER, OF COURSE), ESPECIALLY */ 27700000
         INHIB = 'Y';        /* IF OUR POOR FRIEND HAS INADVERTENTLY */ 27710000
         CALL RSPEAK(228);      /* MELTED THE WROUGHT IRON LADDER IN */ 27720000
         INHIB = 'N';       /* HIS GREED TO GRASP THE BLOOD RED RUBY */ 27730000
         SELECT (LOC);                                                  27740000
             WHEN (41)  JUNK2 = 'south';                                27750000
             WHEN (42)  JUNK2 = 'east!';                                27760000
             WHEN (43)  JUNK2 = 'south';                                27770000
             WHEN (44)  JUNK2 = 'south';                                27780000
             WHEN (50)  JUNK2 = 'south';                                27790000
             WHEN (52)  JUNK2 = 'north';                                27800000
             WHEN (55)  JUNK2 = 'east!';                                27810000
             WHEN (57)  JUNK2 = 'east!';                                27820000
             WHEN (141) JUNK2 = 'TELEP';       /* BEAM ME UP, SCOTTY */ 27830000
             WHEN (144) JUNK2 = 'TRICK';       /* GET ME OUT OF THIS */ 27840000
             OTHERWISE  JUNK2 = '     ';                                27850000
             END;                                                       27860000
         IF SUBSTR(JUNK2,1,1) = 'T' & ^TOTING(BRACELET)                 27870000
         THEN JUNK2 = '     ';                                          27880000
         IF JUNK2 = 'TELEP'                                             27890000
         THEN DO;                                                       27900000
              LOC = 144;                    /* BACK TO TELEPORT ROOM */ 27910000
              GO TO L2000;                                              27920000
              END;                                                      27930000
         IF JUNK2 = 'TRICK'                                             27940000
         THEN DO;                                                       27950000
              IF PROP(LADDER) = 2                                       27960000
              THEN LOC = 106;  /* PROVIDE AN ESCAPE IF LADDER MELTED */ 27970000
              ELSE LOC = 142;  /* ELSE ORAC JUST GIVES US A TELEPORT */ 27980000
              GO TO L2000;                                              27990000
              END;                                                      28000000
         IF JUNK2 = '     '                                             28010000
         THEN CALL RSPEAK(227);                                         28020000
         ELSE DO;                                                       28030000
              SUBSTR(OUTSTR,55,5) = JUNK2;                              28040000
              CALL LINEOUT;                                             28050000
              END;                                                      28060000
         GO TO L2012;                                                   28070000
                                                                        28080000
 /*                                                                     28090000
    HINTS                                                               28100000
                                                                        28110000
    COME HERE IF HE'S BEEN LONG ENOUGH AT REQUIRED LOC(S) FOR           28120000
    SOME UNUSED HINT.  HINT NUMBER IS IN VARIABLE "HINT".               28130000
    BRANCH TO QUICK TEST FOR ADDITIONAL CONDITIONS, THEN COME           28140000
    BACK TO DO NEAT STUFF.  GOTO 40010 IF CONDITIONS ARE MET            28150000
    AND WE WANT TO OFFER THE HINT.  GOTO 40020 TO CLEAR                 28160000
    HINTLC BACK TO ZERO, 40030 TO TAKE NO ACTION YET.                   28170000
 */                                                                     28180000
                                                                        28190000
 L40000: SELECT (HINT-4);                                               28200000
             WHEN (00)  GO TO L40400;        /* CAVE */                 28210000
             WHEN (01)  GO TO L40500;        /* BIRD */                 28220000
             WHEN (02)  GO TO L40600;        /* SNAKE */                28230000
             WHEN (03)  GO TO L40700;        /* MAZE */                 28240000
             WHEN (04)  GO TO L40800;        /* DARK */                 28250000
             WHEN (05)  GO TO L40900;        /* WITT */                 28260000
             WHEN (06)  GO TO L41000;        /* RUBY */                 28270000
             OTHERWISE  CALL BUG(27);                                   28280000
             END;                                                       28290000
                                                                        28300000
 L40010: HINTLC(HINT)=0;                                                28310000
         IF ^YES(HINTS(HINT,3),0,54) THEN GOTO L2602;                   28320000
         CALL LINESKP;                                                  28330000
         INHIB = 'Y';                                                   28340000
         CALL RSPEAK(214);                                              28350000
         PUT STRING (KKWORD) EDIT (HINTS(HINT,2)) (F(2));               28360000
         SUBSTR(OUTSTR,56,2) = KKWORD;                                  28370000
         INHIB = 'N';                                                   28380000
         CALL LINEOUT;                                                  28390000
         HINTED(HINT)=YES(175,HINTS(HINT,4),54);                        28400000
         IF HINTED(HINT) & LIMIT > 30                                   28410000
                THEN LIMIT=LIMIT+30*HINTS(HINT,2);                      28420000
 L40020: HINTLC(HINT)=0;                                                28430000
 L40030: GOTO L2602;                                                    28440000
                                                                        28450000
 /* NOW FOR THE QUICK TESTS.  SEE DATABASE DESCRIPTION FOR              28460000
    ONE-LINE NOTES.  */                                                 28470000
                                                                        28480000
 L40400: IF PROP(GRATE) = 0 &  ^ HERE(KEYS) THEN GOTO L40010;           28490000
         GOTO L40020;                                                   28500000
                                                                        28510000
 L40500: IF HERE(BIRD) & TOTING(ROD) & OBJ = BIRD THEN GOTO L40010;     28520000
         GOTO L40030;                                                   28530000
                                                                        28540000
 L40600: IF HERE(SNAKE) &  ^ HERE(BIRD) THEN GOTO L40010;               28550000
         GOTO L40020;                                                   28560000
                                                                        28570000
 L40700: IF ATLOC(LOC) = 0 & ATLOC(OLDLOC) = 0                          28580000
          & ATLOC(OLDLC2) = 0 & HOLDNG > 1 THEN GOTO L40010;            28590000
         GOTO L40020;                                                   28600000
                                                                        28610000
 L40800: IF PROP(EMRALD) ^= -1 & PROP(PYRAM) = -1 THEN GOTO L40010;     28620000
         GOTO L40020;                                                   28630000
                                                                        28640000
 L40900: GOTO L40010;                                                   28650000
                                                                        28660000
 L41000: IF HERE(RUBY) & ^TOTING(RUBY) THEN GOTO L40010;                28670000
         GOTO L40020;                                                   28680000
                                                                        28690000
 /*                                                                     28700000
    CAVE CLOSING AND SCORING                                            28710000
                                                                        28720000
                                                                        28730000
    THESE SECTIONS HANDLE THE CLOSING OF THE CAVE.  THE CAVE            28740000
    CLOSES "CLOCK1" TURNS AFTER THE LAST TREASURE HAS BEEN              28750000
    LOCATED (INCLUDING THE PIRATE'S CHEST, WHICH MAY OF                 28760000
    COURSE NEVER SHOW UP).  NOTE THAT THE TREASURES NEED NOT            28770000
    HAVE BEEN TAKEN YET, JUST LOCATED.  HENCE CLOCK1 MUST BE            28780000
    LARGE ENOUGH TO GET OUT OF THE CAVE (IT ONLY TICKS WHILE            28790000
    INSIDE THE CAVE).  WHEN IT HITS ZERO, WE BRANCH TO 10000            28800000
    TO START CLOSING THE CAVE, AND THEN SIT BACK AND WAIT FOR           28810000
    HIM TO TRY TO GET OUT.  IF HE DOESN'T WITHIN CLOCK2                 28820000
    TURNS, WE CLOSE THE CAVE- IF HE DOES TRY, WE ASSUME HE              28830000
    PANICS, AND GIVE HIM A FEW ADDITIONAL TURNS TO GET                  28840000
    FRANTIC BEFORE WE CLOSE.  WHEN CLOCK2 HITS ZERO, WE                 28850000
    BRANCH TO 11000 TO TRANSPORT HIM INTO THE FINAL PUZZLE.             28860000
    NOTE THAT THE PUZZLE DEPENDS UPON ALL SORTS OF RANDOM               28870000
    THINGS.  FOR INSTANCE, THERE MUST BE NO WATER OR OIL,               28880000
    SINCE THERE ARE BEANSTALKS WHICH WE DON'T WANT TO BE ABLE           28890000
    TO WATER, SINCE THE CODE CAN'T HANDLE IT.  ALSO, WE CAN             28900000
    HAVE NO KEYS, SINCE THERE IS A GRATE (HAVING MOVED THE              28910000
    FIXED OBJECT!) THERE SEPARATING HIM FROM ALL THE                    28920000
    TREASURES.  MOST OF THESE PROBLEMS ARISE FROM THE USE OF            28930000
    NEGATIVE PROP NUMBERS TO SUPPRESS THE OBJECT DESCRIPTIONS           28940000
    UNTIL HE'S ACTUALLY MOVED THE OBJECTS.                              28950000
                                                                        28960000
    WHEN THE FIRST WARNING COMES, WE LOCK THE GRATE, DESTROY            28970000
    THE BRIDGE, KILL ALL THE DWARFS (AND THE PIRATE), REMOVE            28980000
    THE TROLL AND BEAR (UNLESS DEAD), AND SET "CLOSNG" TO               28990000
    TRUE.  LEAVE THE DRAGON- TOO MUCH TROUBLE TO MOVE IT.               29000000
    FROM NOW UNTIL CLOCK2 RUNS OUT, HE CANNOT UNLOCK THE                29010000
    GRATE, MOVE TO ANY LOCATION OUTSIDE THE CAVE (LOC<9), OR            29020000
    CREATE THE BRIDGE.  NOR CAN HE BE RESURRECTED IF HE DIES.           29030000
    NOTE THAT THE SNAKE IS ALREADY GONE, SINCE HE GOT TO THE            29040000
    TREASURE ACCESSIBLE ONLY VIA THE HALL OF THE MT.  KING.             29050000
    ALSO, HE'S BEEN IN GIANT ROOM (TO GET EGGS), SO WE CAN              29060000
    REFER TO IT.  ALSO ALSO, HE'S GOTTEN THE PEARL, SO WE               29070000
    KNOW THE BIVALVE IS AN OYSTER.  *AND*, THE DWARFS MUST              29080000
    HAVE BEEN ACTIVATED, SINCE WE'VE FOUND CHEST.                       29090000
 */                                                                     29100000
                                                                        29110000
 L10000: PROP(GRATE)=0;                                                 29120000
         PROP(FISSUR)=0;                                                29130000
         DO I=1 TO 6;                                                   29140000
             DSEEN(I)='0'B;                                             29150000
             END;                                                       29160000
         CALL MOVE(TROLL,0);                                            29170000
         CALL MOVE(TROLL+100,0);                                        29180000
         CALL MOVE(TROLL2,PLAC(TROLL));                                 29190000
         CALL MOVE(TROLL2+100,FIXD(TROLL));                             29200000
         CALL JUGGLE(CHASM);                                            29210000
         IF PROP(BEAR) ^= 3 THEN CALL DSTROY(BEAR);                     29220000
         PROP(CHAIN)=0;                                                 29230000
         FIXED(CHAIN)=0;                                                29240000
         PROP(AXE)=0;                                                   29250000
         FIXED(AXE)=0;                                                  29260000
         CALL RSPEAK(129);                                              29270000
         CLOCK1=-1;                                                     29280000
         CLOSNG='1'B;                                                   29290000
         GOTO L19999;                                                   29300000
                                                                        29310000
 /*                                                                     29320000
    ONCE HE'S PANICKED, AND CLOCK2 HAS RUN OUT, WE COME HERE            29330000
    TO SET UP THE STORAGE ROOM.  THE ROOM HAS TWO LOCS,                 29340000
    HARDWIRED AS 115 (NE) AND 116 (SW).  AT THE NE END, WE              29350000
    PLACE EMPTY BOTTLES, A NURSERY OF PLANTS, A BED OF                  29360000
    OYSTERS, A PILE OF LAMPS, RODS WITH STARS, SLEEPING                 29370000
    DWARFS, AND HIM.  AND THE SW END WE PLACE GRATE OVER                29380000
    TREASURES, SNAKE PIT, COVEY OF CAGED BIRDS, MORE RODS,              29390000
    AND PILLOWS.  A MIRROR STRETCHES ACROSS ONE WALL.  MANY             29400000
    OF THE OBJECTS COME FROM KNOWN LOCATIONS AND/OR STATES              29410000
    (E.G.  THE SNAKE IS KNOWN TO HAVE BEEN DESTROYED AND                29420000
    NEEDN'T BE CARRIED AWAY FROM ITS OLD "PLACE"), MAKING THE           29430000
    VARIOUS OBJECTS BE HANDLED DIFFERENTLY.  WE ALSO DROP ALL           29440000
    OTHER OBJECTS HE MIGHT BE CARRYING (LEST HE HAVE SOME               29450000
    WHICH COULD CAUSE TROUBLE, SUCH AS THE KEYS).  WE                   29460000
    DESCRIBE THE FLASH OF LIGHT AND TRUNDLE BACK.                       29470000
 */                                                                     29480000
                                                                        29490000
 L11000: PROP(BOTTLE)=PUT(BOTTLE,115,1);                                29500000
         PROP(PLANT)=PUT(PLANT,115,0);                                  29510000
         PROP(OYSTER)=PUT(OYSTER,115,0);                                29520000
         PROP(LAMP)=PUT(LAMP,115,0);                                    29530000
         PROP(ROD)=PUT(ROD,115,0);                                      29540000
         PROP(DWARF)=PUT(DWARF,115,0);                                  29550000
         LOC=115;                                                       29560000
         OLDLOC=115;                                                    29570000
         NEWLOC=115;                                                    29580000
                                                                        29590000
 /* LEAVE THE GRATE WITH NORMAL (NON-NEGATIVE PROPERTY). */             29600000
                                                                        29610000
         FOO=PUT(GRATE,116,0);                                          29620000
         PROP(SNAKE)=PUT(SNAKE,116,1);                                  29630000
         PROP(BIRD)=PUT(BIRD,116,1);                                    29640000
         PROP(CAGE)=PUT(CAGE,116,0);                                    29650000
         PROP(ROD2)=PUT(ROD2,116,0);                                    29660000
         PROP(PILLOW)=PUT(PILLOW,116,0);                                29670000
                                                                        29680000
         PROP(MIRROR)=PUT(MIRROR,115,0);                                29690000
         FIXED(MIRROR)=116;                                             29700000
                                                                        29710000
         DO I=1 TO 100;                                                 29720000
             IF TOTING(I) THEN CALL DSTROY(I);                          29730000
             END;                                                       29740000
                                                                        29750000
         CALL RSPEAK(132);                                              29760000
         CLOSED='1'B;                                                   29770000
         GOTO L2;                                                       29780000
                                                                        29790000
 /*                                                                     29800000
    ANOTHER WAY WE CAN FORCE AN END TO THINGS IS BY HAVING              29810000
    THE LAMP GIVE OUT.  WHEN IT GETS CLOSE, WE COME HERE TO             29820000
    WARN HIM.  WE GO TO 12000 IF THE LAMP AND FRESH BATTERIES           29830000
    ARE HERE, IN WHICH CASE WE REPLACE THE BATTERIES AND                29840000
    CONTINUE.  12200 IS FOR OTHER CASES OF LAMP DYING.  12400           29850000
    IS WHEN IT GOES OUT, AND 12600 IS IF HE'S WANDERED                  29860000
    OUTSIDE AND THE LAMP IS USED UP, IN WHICH CASE WE FORCE             29870000
    HIM TO GIVE UP.                                                     29880000
 */                                                                     29890000
                                                                        29900000
 L12000: CALL RSPEAK(188);                                              29910000
         PROP(BATTER)=1;                                                29920000
         IF TOTING(BATTER) THEN CALL DROP(BATTER,LOC);                  29930000
         LIMIT=LIMIT+2500;                                              29940000
         LMWARN='0'B;                                                   29950000
         GOTO L19999;                                                   29960000
                                                                        29970000
 L12200: IF LMWARN |  ^HERE(LAMP) THEN GOTO L19999;                     29980000
         LMWARN='1'B;                                                   29990000
         SPK=187;                                                       30000000
         IF PLACE(BATTER) = 0 THEN SPK=183;                             30010000
         IF PROP(BATTER) = 1 THEN SPK=189;                              30020000
         CALL RSPEAK(SPK);                                              30030000
         GOTO L19999;                                                   30040000
                                                                        30050000
 L12400: LIMIT=-1;                                                      30060000
         PROP(LAMP)=0;                                                  30070000
         IF HERE(LAMP) THEN CALL RSPEAK(184);                           30080000
         GOTO L19999;                                                   30090000
                                                                        30100000
 L12600: CALL RSPEAK(185);                                              30110000
         GAVEUP='1'B;                                                   30120000
         GOTO L20000;                                                   30130000
                                                                        30140000
 /* OH DEAR, HE'S DISTURBED THE DWARFS. */                              30150000
                                                                        30160000
 L19000: CALL RSPEAK(136);                                              30170000
                                                                        30180000
 /*                                                                     30190000
    EXIT CODE.  WILL EVENTUALLY INCLUDE SCORING.  FOR NOW, HOWEVER, ... 30200000
                                                                        30210000
    THE PRESENT SCORING ALGORITHM IS AS FOLLOWS:                        30220000
       OBJECTIVE:          POINTS:        PRESENT TOTAL POSSIBLE:       30230000
    GETTING WELL INTO CAVE   25                    25                   30240000
    EACH TREASURE < CHEST    12                    60                   30250000
    TREASURE CHEST ITSELF    14                    14                   30260000
    EACH TREASURE > CHEST    16                   144                   30270000
    SURVIVING             (MAX-NUM)*10             30                   30280000
    NOT QUITTING              4                     4                   30290000
    REACHING "CLOSNG"        25                    25                   30300000
    "CLOSED": QUIT/KILLED    10                                         30310000
              KLUTZED        25                                         30320000
              WRONG WAY      30                                         30330000
              SUCCESS        45                    45                   30340000
    CAME TO WITT'S END        1                     1                   30350000
    ROUND OUT THE TOTAL       2                     2                   30360000
                                         TOTAL:   350                   30370000
    (POINTS CAN ALSO BE DEDUCTED FOR USING HINTS.)                      30380000
 */                                                                     30390000
                                                                        30400000
 L20000: SCORE=0;                                                       30410000
         MXSCOR=0;                                                      30420000
                                                                        30430000
 /*                                                                     30440000
    FIRST TALLY UP THE TREASURES.  MUST BE IN BUILDING AND              30450000
    NOT BROKEN.  GIVE THE POOR GUY 2 POINTS JUST FOR FINDING            30460000
    EACH TREASURE.                                                      30470000
 */                                                                     30480000
                                                                        30490000
         DO I=50 TO MAXTRS;                                             30500000
             IF PTEXT(I) ^= 0 THEN DO;                                  30510000
                 K=12;                                                  30520000
                 IF I = CHEST THEN K=14;                                30530000
                 IF I > CHEST THEN K=16;                                30540000
                 IF PROP(I) >= 0 THEN SCORE=SCORE+2;                    30550000
                 IF PLACE(I) = 3 & PROP(I) = 0 THEN SCORE=SCORE+K-2;    30560000
                 MXSCOR=MXSCOR+K;                                       30570000
                 END;                                                   30580000
             END;                                                       30590000
                                                                        30600000
 /*                                                                     30610000
    NOW LOOK AT HOW HE FINISHED AND HOW FAR HE GOT.  MAXDIE             30620000
    AND NUMDIE TELL US HOW WELL HE SURVIVED.  GAVEUP SAYS               30630000
    WHETHER HE EXITED VIA QUIT.  DFLAG WILL TELL US IF HE               30640000
    EVER GOT SUITABLY DEEP INTO THE CAVE.  CLOSNG STILL                 30650000
    INDICATES WHETHER HE REACHED THE ENDGAME.  AND IF HE GOT            30660000
    AS FAR AS "CAVE CLOSED" (INDICATED BY "CLOSED"), THEN               30670000
    BONUS IS ZERO FOR MUNDANE EXITS OR 133, 134, 135 IF HE              30680000
    BLEW IT (SO TO SPEAK).                                              30690000
 */                                                                     30700000
                                                                        30710000
         SCORE=SCORE+(MAXDIE-NUMDIE)*10;                                30720000
         MXSCOR=MXSCOR+MAXDIE*10;                                       30730000
         IF ^(SCORNG | GAVEUP) THEN SCORE=SCORE+4;                      30740000
         MXSCOR=MXSCOR+4;                                               30750000
         IF DFLAG ^= 0 THEN SCORE=SCORE+25;                             30760000
         MXSCOR=MXSCOR+25;                                              30770000
         IF CLOSNG THEN SCORE=SCORE+25;                                 30780000
         MXSCOR=MXSCOR+25;                                              30790000
         IF ^CLOSED THEN GOTO L20020;                                   30800000
         IF BONUS = 0 THEN SCORE=SCORE+10;                              30810000
         IF BONUS = 135 THEN SCORE=SCORE+25;                            30820000
         IF BONUS = 134 THEN SCORE=SCORE+30;                            30830000
         IF BONUS = 133 THEN SCORE=SCORE+45;                            30840000
 L20020: MXSCOR=MXSCOR+45;                                              30850000
                                                                        30860000
 /* DID HE COME TO WITT'S END AS HE SHOULD? */                          30870000
                                                                        30880000
         IF PLACE(MAGZIN) = 108 THEN SCORE=SCORE+1;                     30890000
         MXSCOR=MXSCOR+1;                                               30900000
                                                                        30910000
 /* ROUND IT OFF. */                                                    30920000
                                                                        30930000
         SCORE=SCORE+2;                                                 30940000
         MXSCOR=MXSCOR+2;                                               30950000
                                                                        30960000
 /* DEDUCT POINTS FOR HINTS.  HINTS < 4 ARE SPECIAL- SEE                30970000
    DATABASE DESCRIPTION.  */                                           30980000
                                                                        30990000
         DO I=1 TO HNTMAX;                                              31000000
             IF HINTED(I) THEN SCORE=SCORE-HINTS(I,2);                  31010000
             END;                                                       31020000
                                                                        31030000
 /* RETURN TO SCORE COMMAND IF THAT'S WHERE WE CAME FROM. */            31040000
                                                                        31050000
         IF SCORNG THEN GOTO L8241;                                     31060000
                                                                        31070000
 /* THAT SHOULD BE GOOD ENOUGH.  LET'S TELL HIM ALL ABOUT IT. */        31080000
                                                                        31090000
         CALL LINESKP;                                                  31100000
         CALL LINESKP;                                                  31110000
         CALL LINESKP;                                                  31120000
         M = PIC_HH * 60 + PIC_MM;                                      31130000
         TIME_CHR = TIME();                                             31140001
         ELAPSED = PIC_HH * 60 + PIC_MM + ELAPSED - M;                  31150000
         INHIB = 'Y';                                                   31160000
         CALL RSPEAK(215);                         /* YOU SCORED ... */ 31170000
         PUT STRING (INSTR) EDIT (SCORE,MXSCOR,TURNS,ELAPSED)           31180000
                                    (F(4),F(4),F(4),F(4));              31190000
         SUBSTR(OUTSTR,11,4) = SUBSTR(INSTR,1,4);                       31200000
         SUBSTR(OUTSTR,33,4) = SUBSTR(INSTR,5,4);                       31210000
         SUBSTR(OUTSTR,44,4) = SUBSTR(INSTR,9,4);                       31220000
         SUBSTR(OUTSTR,57,4) = SUBSTR(INSTR,13,4);                      31230000
         INHIB = 'N';                                                   31240000
         CALL LINEOUT;                                                  31250000
                                                                        31260000
         DO I=1 TO CLSSES;                                              31270000
             IF CVAL(I) >= SCORE THEN GOTO L20210;                      31280000
             END;                                                       31290000
         CALL LINESKP;                                                  31300000
         CALL RSPEAK(216);            /* YOU JUST WENT OFF MY SCALE! */ 31310000
         GOTO L25000;                                                   31320000
                                                                        31330000
 L20210: CALL SPEAK(CTEXT(I));                                          31340000
         IF I = CLSSES-1 THEN GOTO L20220;                              31350000
         K=CVAL(I)+1-SCORE;                                             31360000
         KKWORD='s.';                                                   31370000
         IF K = 1 THEN KKWORD='. ';                                     31380000
         CALL LINESKP;                                                  31390000
         INHIB = 'Y';                                                   31400000
         CALL RSPEAK(217);    /* FOR NEXT HIGHER RATING YOU NEED ... */ 31410000
         PUT STRING (JUNK1) EDIT (K) (F(3));                            31420000
         SUBSTR(OUTSTR,44,3) = SUBSTR(JUNK1,1,3);                       31430000
         SUBSTR(OUTSTR,58,2) = KKWORD;                                  31440000
         INHIB = 'N';                                                   31450000
         CALL LINEOUT;                                                  31460000
         GOTO L25000;                                                   31470000
                                                                        31480000
 L20220: CALL LINESKP;                                                  31490000
         CALL RSPEAK(218);                                              31500000
         /* TO ACHIEVE THE NEXT HIGHER RATING WOULD BE A NEAT TRICK! */ 31510000
         CALL LINESKP;                                                  31520000
         CALL RSPEAK(219);                      /* CONGRATULATIONS!! */ 31530000
                                                                        31540000
 L25000: CALL LINESKP;                                                  31550000
         GOTO DEALLOC;                                                  31560000
                                                                        31570000
 /*  SUBROUTINES/FUNCTIONS                                              31580000
                                                                        31590000
                                                                        31600000
    TOTING(OBJ)  = TRUE IF THE OBJ IS BEING CARRIED                     31610000
    HERE(OBJ)    = TRUE IF THE OBJ IS AT "LOC" (OR IS BEING CARRIED)    31620000
    AT(OBJ)      = TRUE IF ON EITHER SIDE OF TWO-PLACED OBJECT          31630000
    LIQ(DUMMY)   = OBJECT NUMBER OF LIQUID IN BOTTLE                    31640000
    LIQLOC(LOC)  = OBJECT NUMBER OF LIQUID (IF ANY) AT LOC              31650000
    BITSET(L,N)  = TRUE IF COND(L) HAS BIT N SET (BIT 0 IS UNITS BIT)   31660000
    FORCED(LOC)  = TRUE IF LOC MOVES WITHOUT ASKING FOR INPUT (COND=2)  31670000
    DARK(DUMMY)  = TRUE IF LOCATION "LOC" IS DARK                       31680000
    PCT(N)       = TRUE N% OF THE TIME (N INTEGER FROM 0 TO 100)        31690000
                                                                        31700000
 */                                                                     31710000
                                                                        31720000
 TOTING: PROCEDURE (OBJ) RETURNS (BIT(1));                              31730000
                                                                        31740000
         DCL OBJ FIXED BIN(31);                                         31750000
                                                                        31760000
         RETURN(PLACE(OBJ) = -1);                                       31770000
         END TOTING;                                                    31780000
                                                                        31790000
 HERE:   PROCEDURE (OBJ) RETURNS (BIT(1));                              31800000
                                                                        31810000
         DCL OBJ FIXED BIN(31);                                         31820000
                                                                        31830000
         RETURN(PLACE(OBJ) = LOC | TOTING(OBJ));                        31840000
         END HERE;                                                      31850000
                                                                        31860000
 AT:     PROCEDURE (OBJ) RETURNS (BIT(1));                              31870000
                                                                        31880000
         DCL OBJ FIXED BIN (31);                                        31890000
                                                                        31900000
         RETURN(PLACE(OBJ) = LOC | FIXED (OBJ) = LOC);                  31910000
         END AT;                                                        31920000
                                                                        31930000
 LIQ:    PROCEDURE (DUMMY) RETURNS (FIXED BIN(31));                     31940000
                                                                        31950000
         DCL DUMMY FIXED BIN(31);                                       31960000
                                                                        31970000
         RETURN(LIQ2(MAX(PROP(BOTTLE),-1-PROP(BOTTLE))));               31980000
         END LIQ;                                                       31990000
                                                                        32000000
 LIQ2:   PROCEDURE (PBOTL) RETURNS (FIXED BIN(31));                     32010000
                                                                        32020000
         DCL PBOTL FIXED BIN(31);                                       32030000
         DCL LIQ2TEMP FIXED BIN(31);                                    32040000
                                                                        32050000
         LIQ2TEMP=PBOTL/2;                                              32060000
         RETURN((1-PBOTL)*WATER+(LIQ2TEMP)*(WATER+OIL));                32070000
         END LIQ2;                                                      32080000
                                                                        32090000
 LIQLOC: PROCEDURE (LOC) RETURNS (FIXED BIN(31));                       32100000
                                                                        32110000
         DCL LOC FIXED BIN(31);                                         32120000
         DCL (LIQTEMP1,LIQTEMP2) FIXED BIN(31);                         32130000
                                                                        32140000
         LIQTEMP1=COND(LOC)/2;                                          32150000
         LIQTEMP1=LIQTEMP1*2;                                           32160000
         LIQTEMP2=COND(LOC)/4;                                          32170000
         RETURN(LIQ2((MOD(LIQTEMP1,8)-5)*MOD(LIQTEMP2,2)+1));           32180000
         END LIQLOC;                                                    32190000
                                                                        32200000
 BITSET: PROCEDURE (L,N) RETURNS (BIT(1));                              32210000
                                                                        32220000
         DCL (L,N) FIXED BIN(31);                                       32230000
         DCL BITTEMP FIXED BIN(31) STATIC;                              32240000
                                                                        32250000
         BITTEMP=COND(L)/2**N;                                          32260000
         RETURN(MOD(BITTEMP,2) ^= 0);                                   32270000
         END BITSET;                                                    32280000
                                                                        32290000
 FORCED: PROCEDURE (LOC) RETURNS (BIT(1));                              32300000
                                                                        32310000
         DCL LOC FIXED BIN(31);                                         32320000
                                                                        32330000
         RETURN(COND(LOC) = 2);                                         32340000
         END FORCED;                                                    32350000
                                                                        32360000
 DARK:   PROCEDURE (DUMMY) RETURNS (BIT(1));                            32370000
                                                                        32380000
         DCL DUMMY FIXED BIN(31);                                       32390000
                                                                        32400000
         RETURN(MOD(COND(LOC),2) = 0 &                                  32410000
              (PROP(LAMP) = 0 | ^ HERE(LAMP)));                         32420000
         END DARK;                                                      32430000
                                                                        32440000
 PCT:    PROCEDURE (N) RETURNS (BIT(1));                                32450000
                                                                        32460000
         DCL N FIXED BIN(31);                                           32470000
                                                                        32480000
         RETURN(RAN(100) < N);                                          32490000
         END PCT;                                                       32500000
 /* I/O ROUTINES (SPEAK, PSPEAK, RSPEAK, MSPEAK, A5TOA1, GETIN, YES) */ 32510000
                                                                        32520000
                                                                        32530000
 SPEAK:  PROCEDURE (N);                                                 32540000
                                                                        32550000
         DCL N FIXED BIN(31);                                           32560000
         DCL (I,K,L) FIXED BIN (31);                                    32570000
                                                                        32580000
 /*                                                                     32590000
    PRINT THE MESSAGE WHICH STARTS AT LINES(N).  PRECEDE IT             32600000
    WITH A BLANK LINE UNLESS BLKLIN IS FALSE.                           32610000
    INHERENT MESSAGE TEXT WORD LIMIT INCREASED FROM 9999 TO 49999 -     32620000
                                               (GP 12/82)               32630000
 */                                                                     32640000
                                                                        32650000
         IF N = 0 THEN RETURN;                                          32660000
         IF LINES(N+1) = '>$<' THEN RETURN;                             32670000
         IF (BLKLIN) THEN CALL LINESKP;                                 32680000
         K=N;                                                           32690000
 L1:     YDCHR=LINES(K);                                                32700000
         L=MOD(YDPIC,50000)-1;                                          32710000
         K=K+1;                                                         32720000
         PUT STRING (OUTSTR) EDIT ((LINES(I) DO I=K TO L)) (14 A(5));   32730000
         IF INHIB = 'Y' THEN RETURN;                                    32740000
         CALL LINEOUT;                                                  32750000
         K=L+1;                                                         32760000
         IF SUBSTR(LINES(K),1,1) < '5' THEN GOTO L1;                    32770000
         RETURN;                                                        32780000
         END SPEAK;                                                     32790000
                                                                        32800000
                                                                        32810000
                                                                        32820000
 PSPEAK: PROCEDURE (MSG,SKIP);                                          32830000
                                                                        32840000
         DCL (MSG,SKIP) FIXED BIN(31);                                  32850000
         DCL (I,M) FIXED BIN (31);                                      32860000
                                                                        32870000
 /*                                                                     32880000
    FIND THE SKIP+1ST MESSAGE FROM MSG AND PRINT IT.  MSG               32890000
    SHOULD BE THE INDEX OF THE INVENTORY MESSAGE FOR OBJECT.            32900000
    (INVEN+N+1 MESSAGE IS PROP=N MESSAGE).                              32910000
 */                                                                     32920000
                                                                        32930000
         M=PTEXT(MSG);                                                  32940000
         IF SKIP < 0 THEN GOTO L9;                                      32950000
         DO I=0 TO SKIP;                                                32960000
 L1:         YDCHR=LINES(M);                                            32970000
             M=MOD(YDPIC,50000);                                        32980000
             IF SUBSTR(LINES(M),1,1) < '5' THEN GOTO L1;                32990000
             END;                                                       33000000
 L9:     CALL SPEAK(M);                                                 33010000
         RETURN;                                                        33020000
         END PSPEAK;                                                    33030000
                                                                        33040000
                                                                        33050000
                                                                        33060000
 RSPEAK: PROCEDURE (I);                                                 33070000
                                                                        33080000
         DCL I FIXED BIN(31);                                           33090000
                                                                        33100000
 /* PRINT THE I-TH "RANDOM" MESSAGE (SECTION 6 OF DATABASE). */         33110000
                                                                        33120000
         IF I ^= 0 THEN CALL SPEAK(RTEXT(I));                           33130000
         RETURN;                                                        33140000
         END RSPEAK;                                                    33150000
                                                                        33160000
 MSPEAK: PROCEDURE (I);                                                 33170000
                                                                        33180000
         DCL I FIXED BIN(31);                                           33190000
                                                                        33200000
 /* PRINT THE I-TH "MAGIC" MESSAGE (SECTION 12 OF DATABASE). */         33210000
                                                                        33220000
         IF I ^= 0 THEN CALL SPEAK(MTEXT(I));                           33230000
         RETURN;                                                        33240000
         END MSPEAK;                                                    33250000
                                                                        33260000
 GETIN:  PROCEDURE (WORD1,WORD1X,WORD2,WORD2X);                         33270000
                                                                        33280000
 /*                                                                     33290000
    GET A COMMAND FROM THE ADVENTURER.  SNARF OUT THE FIRST             33300000
    WORD, PAD IT WITH BLANKS, AND RETURN IT IN WORD1.  CHARS            33310000
    6 THRU 10 ARE RETURNED IN WORD1X, IN CASE WE NEED TO                33320000
    PRINT OUT THE WHOLE WORD IN AN ERROR MESSAGE.  ANY NUMBER           33330000
    OF BLANKS MAY FOLLOW THE WORD.  IF A SECOND WORD APPEARS,           33340000
    IT IS RETURNED IN WORD2 (CHARS 6 THRU 10 IN WORD2X), ELSE           33350000
    WORD2 IS SET TO ZERO.                                               33360000
 */                                                                     33370000
                                                                        33380000
         DCL (WORD1,WORD1X,WORD2,WORD2X) CHAR(5);                       33390000
                                                                        33400000
         WORD1,WORD1X,WORD2,WORD2X='     ';                             33410000
         IF LOGON THEN PUT SKIP;                                        33420000
         WORDSTRT=0;                                                    33430000
         DO WHILE (WORDSTRT = 0);                                       33440000
             IF BLKLIN THEN CALL LINESKP;                               33450000
             CALL TREAD(INSTR,0,INSTR,INLEN,CCODE);                     33460000
             IF PLIRETV() = 0                                           33470000
             THEN DO;                                                   33480000
                  IF CCODE > 0 & CCODE ^= 13                            33490000
                  THEN DO;                    /* VDU AND NOT <ENTER> */ 33500000
                       WD2 = ' ';                                       33510000
                       CALL CLRSCRN;                                    33520000
                       SELECT (CCODE);                                  33530000
                       WHEN (01) WD1 = 'H    ';                         33540000
                       WHEN (02) WD1 = 'I    ';                         33550000
                       WHEN (03) WD1 = 'Q    ';                         33560000
                       WHEN (04) WD1 = 'LOG  ';                         33570000
                       WHEN (09) IF WIZARD THEN WD1 = 'SWAP ';          33580000
                       WHEN (12) WD1 = 'EXIT ';                         33590000
                       WHEN (14) DO;               /* RESHOW FOR PA2 */ 33600000
                                 OUTSTR = RETRYSTR;                     33610000
                                 CALL LINEOUT;                          33620000
                                 GO TO RETRY;                           33630000
                                 END;                                   33640000
                       OTHERWISE GO TO ENTER;                           33650000
                       END;                                             33660000
                       RETURN;                                          33670000
                       END;                                             33680000
 ENTER:          OUTSTR=SUBSTR(INSTR,1,INLEN);                          33690000
                 WORDSTRT=VERIFY(OUTSTR,' ');                           33700000
                 END;                                                   33710000
             ELSE DO;                                                   33720000
                 IF BLKLIN THEN CALL LINESKP;                           33730000
                 PUT STRING (OUTSTR) EDIT                               33740000
                    ('Terminal error..reenter.') (A);                   33750000
                 CALL LINEOUT;                                          33760000
                 END;                                                   33770000
 RETRY:      END;                                 /* END OF DO WHILE */ 33780000
         IF LOGON THEN PUT SKIP EDIT (OUTSTR) (A);                      33790000
         OUTSTR=SUBSTR(OUTSTR,WORDSTRT);                                33800000
         WORDEND=INDEX(OUTSTR,' ')-1;                                   33810000
         IF WORDEND=-1 THEN WORDEND=LENGTH(OUTSTR);                     33820000
         WORDSIZE=MIN(WORDEND,5);                                       33830000
         WORD1=SUBSTR(OUTSTR,1,WORDSIZE);                               33840000
         IF WORDEND > 5 THEN DO;                                        33850000
             WORDSIZE=MIN(WORDEND-5,5);                                 33860000
             WORD1X=SUBSTR(OUTSTR,6,WORDSIZE);                          33870000
             END;                                                       33880000
         IF WORDEND=LENGTH(OUTSTR) THEN RETURN;                         33890000
         OUTSTR=SUBSTR(OUTSTR,WORDEND+1);                               33900000
         WORDSTRT=VERIFY(OUTSTR,' ');                                   33910000
         IF WORDSTRT = 0 THEN RETURN;                                   33920000
         OUTSTR=SUBSTR(OUTSTR,WORDSTRT);                                33930000
         WORDEND=INDEX(OUTSTR,' ')-1;                                   33940000
         IF WORDEND = -1 THEN WORDEND=LENGTH(OUTSTR);                   33950000
         WORDSIZE=MIN(WORDEND,5);                                       33960000
         WORD2=SUBSTR(OUTSTR,1,WORDSIZE);                               33970000
         IF WORDEND > 5 THEN DO;                                        33980000
             WORDSIZE=MIN(WORDEND-5,5);                                 33990000
             WORD2X=SUBSTR(OUTSTR,6,WORDSIZE);                          34000000
             END;                                                       34010000
         RETURN;                                                        34020000
         END GETIN;                                                     34030000
                                                                        34040000
                                                                        34050000
                                                                        34060000
 YES:    PROCEDURE (X,Y,Z) RETURNS (BIT(1));                            34070000
                                                                        34080000
         DCL (X,Y,Z) FIXED BIN(31);                                     34090000
                                                                        34100000
 /*                                                                     34110000
    PRINT MESSAGE X, WAIT FOR YES/NO ANSWER.  IF YES, PRINT Y           34120000
    AND LEAVE YEA TRUE- IF NO, PRINT Z AND LEAVE YEA FALSE.             34130000
 */                                                                     34140000
                                                                        34150000
                                                                        34160000
 L1:     IF X > 0 THEN CALL RSPEAK(X);                                  34170000
         IF X < 0 THEN CALL MSPEAK(-X);                                 34180000
         CALL GETIN(REPLY,JUNK1,JUNK2,JUNK3);                           34190000
         IF REPLY = 'YES' | REPLY = 'Y' THEN GOTO L10;                  34200000
         IF REPLY = 'NO' | REPLY = 'N' THEN GOTO L20;                   34210000
         CALL LINESKP;                                                  34220000
         CALL RSPEAK(206);                                              34230000
         GOTO L1;                                                       34240000
 L10:    IF Y > 0 THEN CALL RSPEAK(Y);                                  34250000
         IF Y < 0 THEN CALL MSPEAK(-Y);                                 34260000
         RETURN('1'B);                                                  34270000
 L20:    IF Z > 0 THEN CALL RSPEAK(Z);                                  34280000
         IF Z < 0 THEN CALL MSPEAK(-Z);                                 34290000
         RETURN('0'B);                                                  34300000
         END YES;                                                       34310000
                                                                        34320000
                                                                        34330000
                                                                        34340000
 A5TOA1: PROCEDURE (A,B,CHARS,LENG);                                    34350000
                                                                        34360000
 /*                                                                     34370000
   A AND B CONTAIN A 1-10 CHARACTER WORD IN A5 FORMAT.                  34380000
   THEY ARE CONCATENATED AND MOVED INTO A CHAR(1)                       34390000
   ARRAY UNTIL A BLANK IS ENCOUNTERED.  THE TOTAL                       34400000
   LENGTH IS RETURNED IN LENG.                                          34410000
                                                                        34420000
 */                                                                     34430000
                                                                        34440000
         DCL (A,B) CHAR(5);                                             34450000
         DCL LENG FIXED BIN(31);                                        34460000
         DCL CHARS(10) CHAR(1) CONNECTED;                               34470000
                                                                        34480000
         DCL WORDS(2) CHAR(5);                                          34490000
                                                                        34500000
         WORDS(1)=TRANSLATE(A,XLATETO,                                  34510000
                              XLATEFR);                                 34520000
         WORDS(2)=TRANSLATE(B,XLATETO,                                  34530000
                              XLATEFR);                                 34540000
         LENG=0;                                                        34550000
         DO WORD=1 TO 2;                                                34560000
             DO CH=1 TO 5;                                              34570000
                 CHARS(LENG+1)=SUBSTR(WORDS(WORD),CH,1);                34580000
                 IF CHARS(LENG+1) = ' ' THEN RETURN;                    34590000
                 LENG=LENG+1;                                           34600000
                 END;                                                   34610000
             END;                                                       34620000
         RETURN;                                                        34630000
         END A5TOA1;                                                    34640000
 /*                                                                     34650000
    DATA STRUCTURE ROUTINES (VOCAB, DSTROY, JUGGLE, MOVE,               34660000
    PUT, CARRY, DROP)                                                   34670000
 */                                                                     34680000
                                                                        34690000
 VOCAB: PROCEDURE (ID,INIT) RETURNS(FIXED BIN(31));                     34700000
                                                                        34710000
        DCL ID CHAR(5);                                                 34720000
        DCL INIT FIXED BIN(31);                                         34730000
        DCL I    FIXED BIN(31);                                         34740000
        DCL VOCRTN FIXED BIN(31);                                       34750000
        DCL IDB  BIT(40) BASED(ADDR(ID));                               34760000
                                                                        34770000
 /*                                                                     34780000
    LOOK UP ID IN THE VOCABULARY (ATAB) AND RETURN ITS                  34790000
    "DEFINITION" (KTAB), OR -1 IF NOT FOUND.  IF INIT IS NON-           34800000
    NEGATIVE, THIS IS AN INITIALISATION CALL SETTING UP A               34810000
    KEYWORD VARIABLE, AND NOT FINDING IT CONSTITUTES A BUG.             34820000
    IT ALSO MEANS THAT ONLY KTAB VALUES WHICH TAKEN OVER 1000           34830000
    EQUAL INIT MAY BE CONSIDERED.  (THUS "STEPS", WHICH IS A            34840000
    MOTION VERB AS WELL AS AN OBJECT, MAY BE LOCATED AS AN              34850000
    OBJECT.)  AND IT ALSO MEANS THE KTAB VALUE IS TAKEN MOD             34860000
    1000.                                                               34870000
 */                                                                     34880000
                                                                        34890000
                                                                        34900000
         IDB = ^IDB;                                                    34910000
         DO I=1 TO TABSIZ;                                              34920000
             IF KTAB(I) = -1 THEN GOTO L2;                              34930000
             IF INIT >= 0 & KTAB(I)/1000 ^= INIT THEN GOTO L1;          34940000
             IF ATAB(I) = ID THEN GOTO L3;                              34950000
 L1:         END;                                                       34960000
         CALL BUG(21);                                                  34970000
                                                                        34980000
 L2:     IDB = ^IDB;                                                    34990000
         IF INIT < 0 THEN RETURN(-1);                                   35000000
         CALL BUG(5);                                                   35010000
                                                                        35020000
 L3:     VOCRTN=KTAB(I);                                                35030000
         IF INIT >= 0 THEN VOCRTN=MOD(VOCRTN,1000);                     35040000
         IDB = ^IDB;                                                    35050000
         RETURN(VOCRTN);                                                35060000
         END VOCAB;                                                     35070000
                                                                        35080000
                                                                        35090000
                                                                        35100000
 DSTROY: PROCEDURE (OBJECT);                                            35110000
                                                                        35120000
         DCL OBJECT FIXED BIN(31);                                      35130000
                                                                        35140000
 /*                                                                     35150000
    PERMANENTLY ELIMINATE "OBJECT" BY MOVING TO A                       35160000
    NON-EXISTANT LOCATION.                                              35170000
 */                                                                     35180000
                                                                        35190000
                                                                        35200000
         CALL MOVE(OBJECT,0);                                           35210000
         RETURN;                                                        35220000
         END DSTROY;                                                    35230000
                                                                        35240000
                                                                        35250000
                                                                        35260000
 JUGGLE: PROCEDURE (OBJECT);                                            35270000
                                                                        35280000
         DCL OBJECT FIXED BIN(31);                                      35290000
         DCL (I,J)  FIXED BIN(31);                                      35300000
                                                                        35310000
 /*                                                                     35320000
    JUGGLE AN OBJECT BY PICKING IT UP AND PUTTING IT DOWN               35330000
    AGAIN, THE PURPOSE BEING TO GET THE OBJECT TO THE FRONT             35340000
    OF THE CHAIN OF THINGS AT ITS LOC.                                  35350000
 */                                                                     35360000
                                                                        35370000
         I=PLACE(OBJECT);                                               35380000
         J=FIXED(OBJECT);                                               35390000
         CALL MOVE(OBJECT,I);                                           35400000
         CALL MOVE(OBJECT+100,J);                                       35410000
         RETURN;                                                        35420000
         END JUGGLE;                                                    35430000
                                                                        35440000
                                                                        35450000
                                                                        35460000
 MOVE:   PROCEDURE (OBJECT,WHERE);                                      35470000
                                                                        35480000
         DCL (OBJECT,WHERE) FIXED BIN(31);                              35490000
                                                                        35500000
 /*                                                                     35510000
    PLACE ANY OBJECT ANYWHERE BY PICKING IT UP AND DROPPING             35520000
    IT.  MAY ALREADY BE TOTING, IN WHICH CASE THE CARRY IS A            35530000
    NO-OP.  MUSTN'T PICK UP OBJECTS WHICH ARE NOT AT ANY LOC,           35540000
    SINCE CARRY WANTS TO REMOVE OBJECTS FROM ATLOC CHAINS.              35550000
 */                                                                     35560000
                                                                        35570000
         IF OBJECT > 100 THEN GOTO L1;                                  35580000
         FROM=PLACE(OBJECT);                                            35590000
         GOTO L2;                                                       35600000
 L1:     FROM=FIXED(OBJECT-100);                                        35610000
 L2:     IF FROM > 0 & FROM <= 300 THEN CALL CARRY(OBJECT,FROM);        35620000
         CALL DROP(OBJECT,WHERE);                                       35630000
         RETURN;                                                        35640000
         END MOVE;                                                      35650000
                                                                        35660000
                                                                        35670000
                                                                        35680000
 PUT:    PROCEDURE (OBJECT,WHERE,PVAL) RETURNS(FIXED BIN(31));          35690000
                                                                        35700000
         DCL (OBJECT,WHERE,PVAL) FIXED BIN(31);                         35710000
                                                                        35720000
 /*                                                                     35730000
    PUT IS THE SAME AS MOVE, EXCEPT IT RETURNS A VALUE USED             35740000
    TO SET UP THE NEGATED PROP VALUES FOR THE REPOSITORY                35750000
    OBJECTS.                                                            35760000
 */                                                                     35770000
                                                                        35780000
         CALL MOVE(OBJECT,WHERE);                                       35790000
         RETURN((-1)-PVAL);                                             35800000
         END PUT;                                                       35810000
                                                                        35820000
                                                                        35830000
                                                                        35840000
 CARRY:  PROCEDURE (OBJECT,WHERE);                                      35850000
                                                                        35860000
         DCL (OBJECT,WHERE) FIXED BIN(31);                              35870000
                                                                        35880000
 /*                                                                     35890000
    START TOTING AN OBJECT, REMOVING IT FROM THE LIST OF                35900000
    THINGS AT ITS FORMER LOCATION.  INCR HOLDNG UNLESS IT WAS           35910000
    ALREADY BEING TOTED.  IF OBJECT>100 (MOVING "FIXED"                 35920000
    SECOND LOC), DON'T CHANGE PLACE OR HOLDNG.                          35930000
 */                                                                     35940000
                                                                        35950000
                                                                        35960000
                                                                        35970000
         IF OBJECT > 100 THEN GOTO L5;                                  35980000
         IF PLACE(OBJECT) = -1 THEN RETURN;                             35990000
         PLACE(OBJECT)=-1;                                              36000000
         HOLDNG=HOLDNG+1;                                               36010000
 L5:     IF ATLOC(WHERE) ^= OBJECT THEN GOTO L6;                        36020000
         ATLOC(WHERE)=LINK(OBJECT);                                     36030000
         RETURN;                                                        36040000
 L6:     TEMP=ATLOC(WHERE);                                             36050000
 L7:     IF LINK(TEMP) = OBJECT THEN GOTO L8;                           36060000
         TEMP=LINK(TEMP);                                               36070000
         GOTO L7;                                                       36080000
 L8:     LINK(TEMP)=LINK(OBJECT);                                       36090000
         RETURN;                                                        36100000
         END CARRY;                                                     36110000
                                                                        36120000
                                                                        36130000
                                                                        36140000
 DROP:   PROCEDURE (OBJECT,WHERE);                                      36150000
                                                                        36160000
         DCL (OBJECT,WHERE) FIXED BIN(31);                              36170000
                                                                        36180000
 /*                                                                     36190000
    PLACE AN OBJECT AT A GIVEN LOC, PREFIXING IT ONTO THE               36200000
    ATLOC LIST.  DECR HOLDNG IF THE OBJECT WAS BEING TOTED.             36210000
 */                                                                     36220000
                                                                        36230000
         IF OBJECT > 100 THEN GOTO L1;                                  36240000
         IF PLACE(OBJECT) = -1 THEN HOLDNG=HOLDNG-1;                    36250000
         PLACE(OBJECT)=WHERE;                                           36260000
         GOTO L2;                                                       36270000
 L1:     FIXED(OBJECT-100)=WHERE;                                       36280000
 L2:     IF WHERE <= 0 THEN RETURN;                                     36290000
         LINK(OBJECT)=ATLOC(WHERE);                                     36300000
         ATLOC(WHERE)=OBJECT;                                           36310000
         RETURN;                                                        36320000
         END DROP;                                                      36330000
                                                                        36340000
 /*  UTILITY ROUTINES (RAN, CIAO, BUG, LINESKP, LINEOUT, HOURFMT) */    36350000
                                                                        36360000
 CIAO:   PROCEDURE;                              /*** SUSPEND GAME ***/ 36370000
                                                                        36380000
         OPEN FILE (STORAGE) UPDATE;                                    36390000
         DO J = 1 TO 2;                                                 36400000
            READ FILE (STORAGE) INTO (ADVREC);  /* SKIP FIRST RECORD */ 36410000
            IF NOSTG THEN GO TO BUST;                                   36420000
         END;                                                           36430000
         IF WD2 = ' '                                                   36440000
         THEN NAME = LOW(8);                                            36450000
         ELSE DO;                                                       36460000
              PW = SUBSTR(WD2,1,4);                                     36470000
              TEST_WORD = -TEST_WORD;                                   36480000
              SUBSTR(NAME,1,4) = PW;                                    36490000
              PW = SUBSTR(WD2,5,1) || SUBSTR(WD2X,1,3);                 36500000
              TEST_WORD = -TEST_WORD;                                   36510000
              SUBSTR(NAME,5,4) = PW;                                    36520000
              END;                                                      36530000
 GETRD:  READ FILE (STORAGE) INTO (ADVREC);                             36540000
         IF NOSTG THEN GO TO BUST;                                      36550000
         M = PIC_HH * 60 + PIC_MM;                                      36560000
         DATE_STG = DATETIME();                                         36570001
         TODAY = DATE_PIC;                                              36580000
         HHMM = PIC_HHMM;                                               36590000
         ELAPSED = PIC_HH * 60 + PIC_MM + ELAPSED - M;                  36600000
         IF ELAPSED > 150 & ^WIZARD             /* ALLOW 150 MINUTES */ 36610000
         THEN DO;                                                       36620000
              CALL CLRSCRN;                                             36630000
              CALL MSPEAK(1);                                           36640000
              GO TO L20000;                                             36650000
              END;                                                      36660000
         IF ADVREC = ' ' | SUBSTR(ADVREC,1,16) = NAME || USERID         36670000
         THEN DO;              /* REMOVE TELL-TALE CHARACTER STRINGS */ 36680000
              INSTR,JUNK1,JUNK2,JUNK3,REPLY,WD1,WD1X,WD2,WD2X = ' ';    36690000
              TKWORD = ' ';                                             36700000
              OUTSTR = INSTR;                                           36710000
              SUSPEND# = SUSPEND# + 1;                                  36720000
              REWRITE FILE (STORAGE) FROM (ADVARS);                     36730000
              CLOSE FILE (STORAGE);                                     36740000
              CALL RSPEAK(205);                                         36750000
              CALL LINESKP;                                             36760000
              GOTO DEALLOC;                                             36770000
              END;                                                      36780000
         GO TO GETRD;                                                   36790000
 BUST:   CLOSE FILE (STORAGE);                                          36800000
         NOSTG = '0'B;                                                  36810000
         RETURN;                                                        36820000
         END CIAO;                                                      36830000
                                                                        36840000
 BUG:    PROCEDURE (NUM);                                               36850000
                                                                        36860000
         DCL NUM FIXED BIN(31);                                         36870000
                                                                        36880000
 /*                                                                     36890000
    THE FOLLOWING CONDITIONS ARE CURRENTLY CONSIDERED FATAL             36900000
    BUGS.  NUMBERS < 20 ARE DETECTED WHILE READING THE                  36910000
    DATABASE- THE OTHERS OCCUR AT "RUN TIME".                           36920000
         0       MESSAGE LINE > 70 CHARACTERS                           36930000
         1       NULL LINE IN MESSAGE                                   36940000
         2       TOO MANY WORDS OF MESSAGES                             36950000
         3       TOO MANY TRAVEL OPTIONS                                36960000
         4       TOO MANY VOCABULARY WORDS                              36970000
         5       REQUIRED VOCABULARY WORD NOT FOUND                     36980000
         6       TOO MANY RTEXT OR MTEXT MESSAGES                       36990000
         7       TOO MANY HINTS                                         37000000
         8       LOCATION HAS COND BIT BEING SET TWICE                  37010000
         9       INVALID SECTION NUMBER IN DATABASE                     37020000
        10       END OF FILE RAISED FOR DATABASE                        37030000
        20       SPECIAL TRAVEL (500>L>300) EXCEEDS GOTO LIST           37040000
        21       RAN OFF END OF VOCABULARY TABLE                        37050000
        22       VOCABULARY TYPE (N/1000) NOT BETWEEN 0 AND 3           37060000
        23       INTRANSITIVE ACTION VERB EXCEEDS GOTO LIST             37070000
        24       TRANSITIVE ACTION VERB EXCEEDS GOTO LIST               37080000
        25       CONDITIONAL TRAVEL ENTRY WITH NO ALTERNATIVE           37090000
        26       LOCATION HAS NO TRAVEL ENTRIES                         37100000
        27       HINT NUMBER EXCEEDS GOTO LIST                          37110000
        28       INVALID MONTH RETURNED BY DATE FUNCTION                37120000
        35       OPERATOR REPLIED "OK" (SVC 35)                         37130000
        93       UNRECOVERABLE TERMINAL I/O ERROR (SVC 93)              37140000
        99       PL/1 ERROR (SEE SYSPRINT OUTPUT)                       37150000
 */                                                                     37160000
                                                                        37170000
                                                                        37180000
         PUT STRING (OUTSTR) EDIT ('Fatal error # ',NUM) (A,F(2));      37190000
         IF NUM = 93                                                    37200000
         THEN PUT SKIP EDIT (OUTSTR) (A);                               37210000
         ELSE CALL LINEOUT;                                             37220000
         GOTO DEALLOC;                                                  37230000
         END BUG;                                                       37240000
                                                                        37250000
 LINESKP: PROCEDURE;                         /* OUTPUTS A BLANK LINE */ 37260000
                                                                        37270000
         OUTSTR=' ';                                                    37280000
         CALL LINEOUT;                                                  37290000
         RETURN;                                                        37300000
         END LINESKP;                                                   37310000
                                                                        37320000
 LINEOUT: PROCEDURE;                      /* OUTPUT A LINE TO MILTEN */ 37330000
                                                                        37340000
         INSTR=OUTSTR;                                                  37350000
         IF OUTSTR ^= ' '                                               37360000
         THEN DO;                                                       37370000
              IF LOGON THEN PUT SKIP EDIT (OUTSTR) (A);                 37380000
              RETRYSTR = OUTSTR;                                        37390000
              END;                                                      37400000
         DO L = 1 TO 50;                                                37410000
             CALL TWRITE(INSTR,LENGTH(OUTSTR),CCODE);                   37420000
             IF CCODE = 0 THEN RETURN;                                  37430000
             END;                                                       37440000
         CALL BUG(93);                                                  37450000
         END LINEOUT;                                                   37460000
                                                                        37470000
 RAN:    PROCEDURE (N) RETURNS (FIXED BIN(31));                         37480000
                                                                        37490000
                          /* RETURNS RANDOM NUMBER BETWEEN 0 AND N-1 */ 37500000
                                                                        37510000
         DCL N      FIXED BIN(31);                                      37520000
         DCL RANRTN FIXED BIN(31);                                      37530000
                                                                        37540000
         RANRTN=N;                                                      37550000
         DO WHILE (RANRTN = N);                                         37560000
             CALL RANDU(IX,IY,Y);                                       37570000
             IX=IY;                                                     37580000
             RANRTN=Y*N;                                                37590000
             END;                                                       37600000
         RETURN(RANRTN);                                                37610000
         END RAN;                                                       37620000
                                                                        37630000
 HOURFMT: PROCEDURE;                           /* DISPLAY OPEN HOURS */ 37640000
                                                                        37650000
         OUTSTR = 'before ' ||                                          37660000
         SUBSTR(TIMES(1),1,2) || ':' || SUBSTR(TIMES(1),3,2) || ', ' || 37670000
         SUBSTR(TIMES(2),1,2) || ':' || SUBSTR(TIMES(2),3,2) || ' to '  37680000
   || SUBSTR(TIMES(3),1,2) || ':' || SUBSTR(TIMES(3),3,2) || ', after ' 37690000
      || SUBSTR(TIMES(4),1,2) || ':' || SUBSTR(TIMES(4),3,2)            37700000
      || ', and at weekends.';                                          37710000
         CALL LINEOUT;                                                  37720000
         RETURN;                                                        37730000
         END HOURFMT;                                                   37740000
                                                                        37750000
 /*  WIZARD ROUTINES (REVERT, WIZPROC, DEMOCHK, PUTBACK, SCANSTG) */    37760000
                                                                        37770000
 REVERT: PROCEDURE;                                                     37780000
         IF SUBSTR(CARD,2,2) = 'EN'                                     37790000
         THEN DO;                                                       37800000
              COLS(4) = -COLS(4);                                       37810000
              SUBSTR(CARD,33,20) = ' ';                                 37820000
              END;                                                      37830000
         ELSE DO I = 3 TO 36;                                           37840000
              IF COLS(I) = 0                                            37850000
              THEN SUBSTR(CARD,I*2-1,2) = ' ';                          37860000
              ELSE COLS(I) = - COLS(I);                                 37870000
              END;                                                      37880000
         SUBSTR(CARD,1,4) = ' ';                                        37890000
         IF SUBSTR(CARD,73,2) = 'PR'                                    37900000
         THEN SUBSTR(CARD,73,2) = ' ';                                  37910000
         ELSE COLS(37) = -COLS(37);                                     37920000
         IF SUBSTR(CARD,75,2) = 'OG'                                    37930000
         THEN SUBSTR(CARD,75,2) = ' ';                                  37940000
         ELSE COLS(38) = -COLS(38);                                     37950000
         IF SUBSTR(CARD,77,2) >= '00'                                   37960000
         THEN SUBSTR(CARD,77,2) = ' ';                                  37970000
         ELSE COLS(39) = -COLS(39);                                     37980000
         IF SUBSTR(CARD,79,2) >= '00'                                   37990000
         THEN SUBSTR(CARD,79,2) = ' ';                                  38000000
         ELSE COLS(40) = -COLS(40);                                     38010000
         RETURN;                                                        38020000
         END REVERT;                                                    38030000
                                                                        38040000
 WIZPROC: PROCEDURE;                                                    38050000
                                                                        38060000
         DCL CANMSG           CHARACTER(43);                            38070000
         DCL MSGUID           CHARACTER (8);                            38080000
                                                                        38090000
         IF WIZARD                                                      38100000
         THEN DO;                                /* BEEN HERE BEFORE */ 38110000
              CALL RSPEAK(205);                                         38120000
              GO TO GETCMD;                                             38130000
              END;                                                      38140000
         CALL MSPEAK(17);                                               38150000
 REASK1: CALL WHISPER;                    /* SUPPLY ECHO SUPPRESSION */ 38160000
         CALL TREAD(INSTR,0,INSTR,INLEN,CCODE);                         38170000
         TEST_WORD = PLIRETV();                  /* SAVE RETURN CODE */ 38180000
         CALL CLRSCRN;                                                  38190000
         IF TEST_WORD ^= 0 THEN GO TO REASK1;                           38200000
         IF CCODE = 11 & SUBSTR(INSTR,1,5) = 'RC=04'                    38210000
         THEN;                      /* SORRY TO HAVE BOTHERED YOU... */ 38220000
         ELSE DO;                                                       38230000
              IF SUBSTR(INSTR,1,5) = 'RC=04'                            38240000
              THEN DO;                  /* LET HIM PLAY IN OFF HOURS */ 38250000
                   CALL MSPEAK(20);                                     38260000
                   TURNS = TURNS + 1;                                   38270000
                   RETURN;                                              38280000
                   END;                                                 38290000
              CALL MSPEAK(18);               /* GIVE HIM ANOTHER TRY */ 38300000
 REASK2:      CALL WHISPER;                                             38310000
              CALL TREAD(INSTR,0,INSTR,INLEN,CCODE);                    38320000
              TEST_WORD = PLIRETV();             /* SAVE RETURN CODE */ 38330000
              CALL CLRSCRN;                                             38340000
              IF TEST_WORD ^= 0 THEN GO TO REASK2;                      38350000
              IF CCODE = 11 & SUBSTR(INSTR,1,5) = 'RC=04'               38360000
              THEN;                 /* SORRY TO HAVE BOTHERED YOU... */ 38370000
              ELSE DO;                                                  38380000
                   CALL MSPEAK(20);                                     38390000
                   IF SUBSTR(INSTR,1,5) = 'RC=04'                       38400000
                   THEN DO;             /* LET HIM PLAY IN OFF HOURS */ 38410000
                        TURNS = TURNS + 1;                              38420000
                        RETURN;                                         38430000
                        END;                                            38440000
                   INHIB = 'Y';                                         38450000
                   CALL MSPEAK(33);                                     38460000
                   SUBSTR(OUTSTR,24,8) = TSOID;     /* PLEASE CANCEL */ 38470000
                   CANMSG = OUTSTR;                                     38480000
 WTOR:             DISPLAY (CANMSG)  REPLY (KKWORD)  EVENT (CAN);       38490000
                   WAIT (CAN);                                          38500000
                   IF KKWORD = 'OK'                                     38510000
                   THEN CALL BUG(35);                                   38520000
                   ELSE GO TO WTOR;                                     38530000
                   END;                                                 38540000
              END;                                                      38550000
         CALL MSPEAK(19);                                               38560000
         WIZARD = '1'B;                                                 38570000
                                                                        38580000
 GETCMD: CALL GETIN(WD1,WD1X,WD2,WD2X);         /* GET WIZARD'S WISH */ 38590000
                                                                        38600000
         J = VOCAB(WD1,-1);                                             38610000
         SELECT (J);                                                    38620000
             WHEN (0011) GO TO DEALLOC;               /* LEAVE */       38630000
             WHEN (0057) GO TO L31;                   /* LOOK  */       38640000
             WHEN (2002) GO TO DUMP;                  /* DROP  */       38650000
             WHEN (2003) GO TO SEND;                  /* SAY   */       38660000
             WHEN (2008) WIZARD = '0'B;               /* OFF   */       38670000
             WHEN (2011) GO TO EXPLORE;               /* GO TO */       38680000
             WHEN (2019) GO TO DESCRIBE;              /* WHERE */       38690000
             WHEN (2027) CALL GETMSGS(TSOID,'W');     /* READ  */       38700000
             WHEN (2031) GO TO HOURS;                 /* HOURS */       38710000
             WHEN (2035) GO TO ACTION;                /* SWAP  */       38720000
             WHEN (2032) GO TO SETLOG;                /* HARDC */       38730000
             WHEN (3051) CALL MSPEAK(52);             /* HELP  */       38740000
             WHEN (3142) GO TO HISTORY;               /* INFO  */       38750000
             OTHERWISE GO TO WDCMPR;                                    38760000
             END;                                                       38770000
         GO TO GETCMD;                                                  38780000
                                                                        38790000
 WDCMPR: SELECT (WD1);                                                  38800000
             WHEN ('ACTIO') GO TO ACTION;                               38810000
             WHEN ('ADD  ') GO TO ADDUSER;                              38820000
             WHEN ('DECOD') GO TO DECODE;                               38830000
             WHEN ('DLOCS') GO TO DLOCS;                                38840000
             WHEN ('DEL  ') GO TO DELUSER;                              38850000
             WHEN ('ENCOD') GO TO ENCODE;                               38860000
             WHEN ('HIST ') GO TO HISTORY;                              38870000
             WHEN ('LISTB') CALL GETMSGS(TSOID,'A');                    38880000
             WHEN ('LISTI') GO TO LISTIDS;                              38890000
             WHEN ('LOGOF') SIGNAL ATTENTION;                           38900000
             WHEN ('SAUCE') GO TO SAUCE;                                38910000
             WHEN ('SCAN ') CALL SCANSTG;                               38920000
             WHEN ('SEND ') GO TO SEND;                                 38930000
             WHEN ('STG  ') GO TO PUTBLNK;                              38940000
             OTHERWISE DO;                                              38950000
                       SPK=60;                                          38960000
                       IF PCT(20) THEN SPK=61;                          38970000
                       IF PCT(20) THEN SPK=13;                          38980000
                       CALL RSPEAK(SPK);                                38990000
                       END;                                             39000000
             END;                                                       39010000
         GO TO GETCMD;                                                  39020000
                                                                        39030000
 LISTIDS:                                   /* LIST AUTHORIZED USERS */ 39040000
         OPEN FILE (STORAGE) INPUT;                                     39050000
         READ FILE (STORAGE) INTO (ADVREC);                             39060000
         CLOSE FILE (STORAGE);                                          39070000
         IF NOSTG                                                       39080000
         THEN DO;                                                       39090000
              CALL MSPEAK(34);                         /* EMPTY FILE */ 39100000
              NOSTG = '0'B;                                             39110000
         GO TO GETCMD;                                                  39120000
         END;                                                           39130000
         IF WD2 = ' '                                                   39140000
         THEN DO M = 0 TO 74;                             /* LISTIDS */ 39150000
              OUTSTR = SUBSTR(ADVREC,M*64+1,64);                        39160000
                   DO KQ = 0 TO 7;                                      39170000
                   IF SUBSTR(OUTSTR,KQ*8+1,1) ^= ' '                    39180000
                   THEN DO;                                             39190000
                        PW = SUBSTR(OUTSTR,KQ*8+1,4);                   39200000
                        TEST_WORD = -TEST_WORD;                         39210000
                        SUBSTR(OUTSTR,KQ*8+1,4) = PW;                   39220000
                        PW = SUBSTR(OUTSTR,KQ*8+5,3) || ' ';            39230000
                        TEST_WORD = -TEST_WORD;                         39240000
                        SUBSTR(PW,4,1) = ' ';                           39250000
                        SUBSTR(OUTSTR,KQ*8+5,4) = PW;                   39260000
                        END;                                            39270000
                   END;                                                 39280000
                   IF M = 74 THEN OUTSTR = SUBSTR(OUTSTR,1,48);         39290000
                   IF OUTSTR ^= ' ' THEN CALL LINEOUT;                  39300000
              END;                                                      39310000
         ELSE DO;                                /* OPERAND SUPPLIED */ 39320000
              IF WD2 = 'ALL  '                                          39330000
              THEN DO M = 0 TO 597;        /* LIST ALL USERS & STATS */ 39340000
                   IF SUBSTR(ADVREC,M*8+1,1) = ' '                      39350000
                   THEN GO TO NOUSER;                                   39360000
                   MSGUID = SUBSTR(ADVREC,M*8+1,7) || ' ';              39370000
                   PW = SUBSTR(MSGUID,1,4);                             39380000
                   TEST_WORD = -TEST_WORD;                              39390000
                   SUBSTR(MSGUID,1,4) = PW;                             39400000
                   PW = SUBSTR(MSGUID,5,4);                             39410000
                   TEST_WORD = -TEST_WORD;                              39420000
                   SUBSTR(MSGUID,5,3) = SUBSTR(PW,1,3);                 39430000
                   BYTE_NUM = SUBSTR(ADVREC,M*8+8,1);                   39440000
                   PUT STRING (OUTSTR) EDIT (MSGUID,INTEGER)            39450000
                                            (A,F(3));                   39460000
                   CALL LINEOUT;                                        39470000
 NOUSER:           END;                                    /* NEXT M */ 39480000
              ELSE DO;                     /* LIST A PARTICULAR USER */ 39490000
                   PW = SUBSTR(WD2,1,4);                                39500000
                   TEST_WORD = -TEST_WORD;                              39510000
                   SUBSTR(MSGUID,1,4) = PW;                             39520000
                   PW = SUBSTR(WD2,5,1) || SUBSTR(WD2X,1,2) || ' ';     39530000
                   TEST_WORD = -TEST_WORD;                              39540000
                   SUBSTR(MSGUID,5,4) = PW;                             39550000
                   M = INDEX(ADVREC,SUBSTR(MSGUID,1,7));                39560000
                   IF M = 0                                             39570000
                   THEN DO;                      /* USERID NOT FOUND */ 39580000
                        CALL A5TOA1(WD2,WD2X,TKWORD,K);                 39590000
                        INHIB = 'Y';                                    39600000
                        CALL RSPEAK(220);                               39610000
                        PUT STRING (OUTSTR) EDIT                        39620000
                             (OUTSTR,(TKWORD(I) DO I=1 TO K),' here!')  39630000
                            (A(9),20 A);                                39640000
                        INHIB = 'N';                                    39650000
                        CALL LINEOUT;                                   39660000
                        END;                                            39670000
                   ELSE DO;                                             39680000
                        BYTE_NUM = SUBSTR(ADVREC,M+7,1);                39690000
                        PUT STRING (OUTSTR) EDIT (WD2,WD2X,INTEGER)     39700000
                                                 (A,A,F(3));            39710000
                        CALL LINEOUT;                                   39720000
                        END;                                            39730000
                   END;                                                 39740000
              END;                                                      39750000
         ADVREC = ' ';                                                  39760000
         GO TO GETCMD;                                                  39770000
                                                                        39780000
 DLOCS:                                 /* DISPLAY DWARFS' LOCATIONS */ 39790000
         DO M = 1 TO 6;                                                 39800000
              PIC_VECTOR(M).PLOC = DLOC(M);                             39810000
         END;                                                           39820000
         OUTSTR = LOC_LINE;                                             39830000
         CALL LINEOUT;                                                  39840000
         GO TO GETCMD;                                                  39850000
                                                                        39860000
 HOURS:  IF YES(-10,-6,0)                                               39870000
         THEN DO;                                       /* SEE HOURS */ 39880000
              CALL HOURFMT;                                             39890000
              GO TO GETCMD;                                             39900000
              END;                                                      39910000
         IF ^YES(-11,-21,-7)                                            39920000
         THEN GO TO GETCMD;                                             39930000
         CALL GETIN(WD1,WD1X,WD2,WD2X);              /* CHANGE HOURS */ 39940000
         TIMES(1) = SUBSTR(WD1,1,4);                                    39950000
         TIMES(2) = SUBSTR(WD2,1,4);                                    39960000
         CALL GETIN(WD1,WD1X,WD2,WD2X);                                 39970000
         TIMES(3) = SUBSTR(WD1,1,4);                                    39980000
         TIMES(4) = SUBSTR(WD2,1,4);                                    39990000
         OPEN FILE (STORAGE) UPDATE;                                    40000000
         READ FILE (STORAGE) INTO (ADVREC);                             40010000
         IF NOSTG THEN GO TO NO_STORAGE;                                40020000
         DO M = 1 TO 4;                                                 40030000
              PW = TIMES(M);                                            40040000
              TEST_WORD = -TEST_WORD;                                   40050000
              SUBSTR(ADVREC,4781+M*4,4) = PW;                           40060000
         END;                                                           40070000
         REWRITE FILE (STORAGE) FROM (ADVREC);                          40080000
         CLOSE FILE (STORAGE);                                          40090000
         CALL LINESKP;                                                  40100000
         CALL MSPEAK(22);                                               40110000
         CALL HOURFMT;                                                  40120000
         GO TO GETCMD;                                                  40130000
                                                                        40140000
 EXPLORE:                        /* ZAP THE WIZARD TO A NEW LOCATION */ 40150000
         GET STRING (WD2) EDIT (L) (F(5));                              40160000
         IF L < 0 | L > 300                                             40170000
         THEN CALL RSPEAK(25);            /* INVALID LOCATION NUMBER */ 40180000
         ELSE DO;                                                       40190000
              LOC = L;                                                  40200000
              OLDLOC = 0;                                               40210000
              OLDLC2 = 0;                                               40220000
              CALL RSPEAK(205);                                         40230000
              END;                                                      40240000
         GO TO GETCMD;                                                  40250000
                                                                        40260000
 DUMP:                                             /* DROP AN OBJECT */ 40270000
         IF WD2 = ' '                                                   40280000
         THEN DO;                                                       40290000
              OUTSTR = 'OBJ?';                                          40300000
              CALL LINEOUT;                                             40310000
              CALL GETIN(WD1,WD1X,WD2,WD2X);                            40320000
              WD2 = WD1;                                                40330000
              END;                                                      40340000
         OBJ = VOCAB(WD2,-1);                                           40350000
         IF OBJ < 1001 | OBJ > 1100                                     40360000
         THEN DO;                                                       40370000
              IF OBJ = -1                                               40380000
              THEN CALL RSPEAK(60);                                     40390000
              ELSE CALL RSPEAK(12);                                     40400000
              GO TO GETCMD;                                             40410000
              END;                                                      40420000
         OBJ = OBJ - 1000;                                              40430000
         OUTSTR = 'LOC?';                                               40440000
         CALL LINEOUT;                                                  40450000
         CALL GETIN(WD1,WD1X,WD2,WD2X);                                 40460000
         GET STRING (WD1) EDIT (L) (F(5));                              40470000
         IF L < 0 | L > 300                                             40480000
         THEN DO;                                                       40490000
              CALL RSPEAK(25);            /* INVALID LOCATION NUMBER */ 40500000
              GO TO GETCMD;                                             40510000
              END;                                                      40520000
         CALL MOVE(OBJ,L);                            /* DUMP OBJECT */ 40530000
         CALL RSPEAK(205);                                              40540000
         GO TO GETCMD;                                                  40550000
                                                                        40560000
 DESCRIBE:                                    /* DESCRIBE A LOCATION */ 40570000
         GET STRING (WD2) EDIT (L) (F(5));                              40580000
         IF L < 0 | L > 300                                             40590000
         THEN DO;                                                       40600000
              CALL RSPEAK(25);            /* INVALID LOCATION NUMBER */ 40610000
              GO TO GETCMD;                                             40620000
              END;                                                      40630000
         IF L = 0                                                       40640000
         THEN DO;                                                       40650000
              PUT STRING (OUTSTR) EDIT (LOC) (F(3));                    40660000
              CALL LINEOUT;                                             40670000
              END;                                                      40680000
         ELSE CALL SPEAK(LTEXT(L));                                     40690000
         GO TO GETCMD;                                                  40700000
                                                                        40710000
 SETLOG:                                                                40720000
         LOGON = ^ LOGON;          /* TOGGLE SYSPRINT LOGGING SWITCH */ 40730000
         IF LOGON THEN CALL MSPEAK(42);          /* LOG ON */           40740000
                  ELSE CALL MSPEAK(43);          /* LOG OFF */          40750000
         GO TO GETCMD;                                                  40760000
                                                                        40770000
 ENCODE:                                          /* ENCODE DATABASE */ 40780000
         OPEN FILE (OBJECT) UPDATE;                                     40790000
         CARD# = 0;                                                     40800000
 RD1:    READ FILE (OBJECT) INTO (CARD);                                40810000
         IF EOCARD THEN GO TO SHUT1;                                    40820000
         CARD# = CARD# + 1;                                             40830000
 /*                                                                     40840000
      DATABASE IS DISGUISED AS AN OBJECT DECK:                          40850000
    ESD'S ARE REAL.  (COULD PROMOTE SECTION 4 TO TOP OF DECK & USE IT.) 40860000
    TXT'S ARE SECTIONS 1 TO 11.                                         40870000
    RLD'S ARE SECTION 12.                                               40880000
    END IS SECTION 0.                                                   40890000
                                                                        40900000
 */                                                                     40910000
         IF SUBSTR(CARD,1,1) = HEX02         /* IGNORE ENCODED CARDS */ 40920000
         THEN GO TO RD1;                                                40930000
         IF SUBSTR(CARD,6,11) = ' 12        '                           40940000
         THEN RLD = '1'B;                                               40950000
         SUBSTR(CARD,1,1) = HEX02;                                      40960000
         IF RLD                                                         40970000
         THEN IF SUBSTR(CARD,7,3) = ' 0 '                               40980000
              THEN DO;                                                  40990000
                   CALL DECDATE(YYDDD);  /* GET DATE IN YYDDD FORMAT */ 41000000
                   SUBSTR(CARD,2,1) = SUBSTR(XLATEFR,5,1);              41010000
                   SUBSTR(CARD,3,1) = SUBSTR(XLATEFR,14,1);             41020000
                   SUBSTR(CARD,4,1) = SUBSTR(XLATEFR,4,1);              41030000
                   YDPIC = YYDDD;                                       41040000
                   SUBSTR(CARD,33,6) = '15734-';                        41050000
                   SUBSTR(CARD,39,1) = SUBSTR(XLATEFR,16,1);            41060000
                   SUBSTR(CARD,40,1) = SUBSTR(XLATEFR,12,1);            41070000
                   SUBSTR(CARD,41,7) = '1  0400';                       41080000
                   SUBSTR(CARD,48,5) = YDPIC;                           41090000
                   END;                                                 41100000
              ELSE DO;                                                  41110000
                   SUBSTR(CARD,2,1) = SUBSTR(XLATEFR,18,1);             41120000
                   SUBSTR(CARD,3,1) = SUBSTR(XLATEFR,12,1);             41130000
                   SUBSTR(CARD,4,1) = SUBSTR(XLATEFR,4,1);              41140000
                   END;                                                 41150000
         ELSE DO;                                                       41160000
              SUBSTR(CARD,2,1) = SUBSTR(XLATEFR,20,1);                  41170000
              SUBSTR(CARD,3,1) = SUBSTR(XLATEFR,24,1);                  41180000
              SUBSTR(CARD,4,1) = SUBSTR(XLATEFR,20,1);                  41190000
              END;                                                      41200000
         IF SUBSTR(CARD,2,2) = 'EN'                                     41210000
         THEN COLS(4) = -COLS(4);                                       41220000
         ELSE DO I = 3 TO 36;                                           41230000
              IF SUBSTR(CARD,I*2-1,2) = ' '                             41240000
              THEN COLS(I) = 0;                                         41250000
              ELSE COLS(I) = -COLS(I);                                  41260000
              END;                                                      41270000
         IF SUBSTR(CARD,73,2) = '  '                                    41280000
         THEN SUBSTR(CARD,73,2) = 'PR';                                 41290000
         ELSE COLS(37) = -COLS(37);                                     41300000
         IF SUBSTR(CARD,75,2) = '  '                                    41310000
         THEN SUBSTR(CARD,75,2) = 'OG';                                 41320000
         ELSE COLS(38) = -COLS(38);                                     41330000
         IF SUBSTR(CARD,77,2) = '  '                                    41340000
         THEN SUBSTR(CARD,77,2) = SUBSTR(SEQ#,1,2);                     41350000
         ELSE COLS(39) = -COLS(39);                                     41360000
         IF SUBSTR(CARD,79,2) = '  '                                    41370000
         THEN SUBSTR(CARD,79,2) = SUBSTR(SEQ#,3,2);                     41380000
         ELSE COLS(40) = -COLS(40);                                     41390000
         REWRITE FILE (OBJECT) FROM (CARD);                             41400000
         GO TO RD1;                                                     41410000
 SHUT1:  CLOSE FILE (OBJECT);                                           41420000
         EOCARD = '0'B;                                                 41430000
         CALL RSPEAK(205);                                              41440000
         GO TO GETCMD;                                                  41450000
                                                                        41460000
 DECODE:                              /* DECODE DATABASE FOR EDITING */ 41470000
         OPEN FILE (OBJECT) UPDATE;                                     41480000
 RD2:    READ FILE (OBJECT) INTO (CARD);                                41490000
         IF EOCARD THEN GO TO SHUT2;                                    41500000
         IF SUBSTR(CARD,2,2) = 'ES'              /* IGNORE ESD CARDS */ 41510000
         THEN GO TO RD2;                                                41520000
         IF SUBSTR(CARD,1,1) = HEX02         /* IGNORE DECODED CARDS */ 41530000
         THEN CALL REVERT;                                              41540000
         REWRITE FILE (OBJECT) FROM (CARD);                             41550000
         GO TO RD2;                                                     41560000
 SHUT2:  CLOSE FILE (OBJECT);                                           41570000
         EOCARD = '0'B;                                                 41580000
         CALL RSPEAK(205);                                              41590000
         GO TO GETCMD;                                                  41600000
                                                                        41610000
 SAUCE:                                                                 41620000
         OPEN FILE (SOURCE) UPDATE;                                     41630000
 RD3:    READ FILE (SOURCE) INTO (CARD);                                41640000
         IF EOCARD THEN GO TO SHUT3;                                    41650000
         DO I = 1 TO 40;                                                41660000
              IF SUBSTR(CARD,I*2-1,2) = ' '                             41670000
              THEN COLS(I) = 0;                                         41680000
              ELSE DO;                                                  41690000
                   IF COLS(I) = 0                                       41700000
                   THEN SUBSTR(CARD,I*2-1,2) = ' ';                     41710000
                   ELSE COLS(I) = -COLS(I);                             41720000
                   END;                                                 41730000
              END;                                                      41740000
         REWRITE FILE (SOURCE) FROM (CARD);                             41750000
         GO TO RD3;                                                     41760000
 SHUT3:  CLOSE FILE (SOURCE);                                           41770000
         EOCARD = '0'B;                                                 41780000
         CALL RSPEAK(205);                                              41790000
         GO TO GETCMD;                                                  41800000
                                                                        41810000
 HISTORY:                           /* DISPLAY PROGRAM & D/B HISTORY */ 41820000
         OPEN FILE (OBJECT) INPUT;                                      41830000
 RD4:    READ FILE (OBJECT) INTO (CARD);                                41840000
         IF EOCARD THEN GO TO SHUT4;                                    41850000
         IF SUBSTR(CARD,2,2) = 'EN'                                     41860000
         THEN DO;                                                       41870000
              OUTSTR = 'DB: V' || SUBSTR(CARD,44,2) || '.' ||           41880000
                  SUBSTR(CARD,46,2) || ' last updated on ' ||           41890000
                  SUBSTR(CARD,48,2) || '.' || SUBSTR(CARD,50,3) ||      41900000
                  ' and has ' || SUBSTR(CARD,77,4) || ' cards';         41910000
              CALL LINEOUT;                                             41920000
              END;                                                      41930000
         ELSE GO TO RD4;                                                41940000
 SHUT4:  CLOSE FILE (OBJECT);                                           41950000
         EOCARD = '0'B;                                                 41960000
         OUTSTR = 'Program was compiled on ' || MACROTIME;              41970000
         CALL LINEOUT;                                                  41980000
         GO TO GETCMD;                                                  41990000
                                                                        42000000
 SEND:                                               /* SEND MESSAGE */ 42010000
         OPEN FILE (STORAGE) UPDATE;                                    42020000
         DO I = 1 TO 2;                                                 42030000
              READ FILE (STORAGE) INTO (ADVREC);                        42040000
              IF NOSTG THEN GO TO NO_STORAGE;                           42050000
         END;                                                           42060000
         CALL MSPEAK(23);                                               42070000
         DO J = 0 TO 79;                                                42080000
              CARD = SUBSTR(ADVREC,J*80+1,80);                          42090000
              IF SUBSTR(CARD,1,1) ^= ' '                                42100000
              THEN DO;                                                  42110000
                   DO L = 1 TO 40;                                      42120000
                   COLS(L) = -COLS(L);                                  42130000
                   END;                                                 42140000
                   IF WD2 = ' '                                         42150000
                   THEN IF SUBSTR(CARD,80,1) ^= '*' THEN GO TO NXT_J;   42160000
                        ELSE;                                           42170000
                   ELSE IF SUBSTR(CARD,73,7) ^= WD2 || SUBSTR(WD2X,1,2) 42180000
                        THEN GO TO NXT_J;                               42190000
                   END;                                                 42200000
              OUTSTR = SUBSTR(CARD,1,79);                               42210000
 SEND_RETRY:  CALL LINEOUT;                                             42220000
 SENDRD:      CALL TREAD(INSTR,0,INSTR,INLEN,CCODE);                    42230000
              IF CCODE = 14 THEN GO TO SEND_RETRY;                      42240000
              IF CCODE = 3 THEN GO TO DSPTCH;                           42250000
              IF INLEN > 79                                             42260000
              THEN DO;                                                  42270000
                   CALL MSPEAK(24);                                     42280000
                   GO TO SENDRD;                                        42290000
                   END;                                                 42300000
              IF INLEN > 0                                              42310000
              THEN SUBSTR(CARD,1,INLEN) = SUBSTR(INSTR,1,INLEN);        42320000
              IF WD2 = ' '                                              42330000
              THEN SUBSTR(CARD,80,1) = '*';                             42340000
              ELSE SUBSTR(CARD,73,8) = WD2 || SUBSTR(WD2X,1,3);         42350000
              DO L = 1 TO 40;                                           42360000
                   COLS(L) = -COLS(L);                                  42370000
                   END;                                                 42380000
              SUBSTR(ADVREC,J*80+1,80) = CARD;                          42390000
 NXT_J:  END;                                                           42400000
         CALL MSPEAK(25);                                               42410000
 DSPTCH: REWRITE FILE (STORAGE) FROM (ADVREC);                          42420000
         CLOSE FILE (STORAGE);                                          42430000
         CALL RSPEAK(205);                                              42440000
         GO TO GETCMD;                                                  42450000
                                                                        42460000
 PUTBLNK:                 /* INCREASE MAX # OF SIMIULT. STORED GAMES */ 42470000
         GET STRING (WD2) EDIT (M) (F(5));                              42480000
         INHIB = 'Y';                                                   42490000
         CALL MSPEAK(48);               /* ADDING TO MOD FILE, OKAY? */ 42500000
         SUBSTR(OUTSTR,8,5) = WD2;                                      42510000
         INHIB = 'N';                                                   42520000
         CALL LINEOUT;                                                  42530000
         CALL GETIN(REPLY,JUNK1,JUNK2,JUNK3);                           42540000
         IF SUBSTR(REPLY,1,1) = 'N'                                     42550000
         THEN GO TO GETCMD;                                             42560000
         ADVREC = ' ';                                                  42570000
         OPEN FILE (STORAGE) OUTPUT;                                    42580000
         DO I = 1 TO M;                                                 42590000
              WRITE FILE (STORAGE) FROM (ADVREC);                       42600000
         END;                                                           42610000
         CLOSE FILE (STORAGE);                                          42620000
         CALL RSPEAK(205);                                              42630000
         GO TO GETCMD;                                                  42640000
                                                                        42650000
 ADDUSER:                      /* AUTHORIZE A USER TO PLAY ADVENTURE */ 42660000
         OPEN FILE (STORAGE) UPDATE;                                    42670000
         READ FILE (STORAGE) INTO (ADVREC);                             42680000
         IF NOSTG THEN GO TO NO_STORAGE;                                42690000
         PW = SUBSTR(WD2,1,4);                                          42700000
         TEST_WORD = -TEST_WORD;                                        42710000
         SUBSTR(MSGUID,1,4) = PW;                                       42720000
         PW = SUBSTR(WD2,5,1) || SUBSTR(WD2X,1,3);                      42730000
         TEST_WORD = -TEST_WORD;                                        42740000
         SUBSTR(MSGUID,5,4) = PW;                                       42750000
         DO I = 0 TO 599;                                               42760000
              IF SUBSTR(ADVREC,I*8+1,7) = SUBSTR(MSGUID,1,7)            42770000
              THEN DO;                                                  42780000
                   M = 36;                                              42790000
                   GO TO ADDEND;                                        42800000
                   END;                                                 42810000
              IF SUBSTR(ADVREC,I*8+1,8) = ' '                           42820000
              THEN DO;                                                  42830000
                   SUBSTR(ADVREC,I*8+1,7) = SUBSTR(MSGUID,1,7);         42840000
                   SUBSTR(ADVREC,I*8+8,1) = LOW(1);                     42850000
                   REWRITE FILE (STORAGE) FROM (ADVREC);                42860000
                   M = 39;                                              42870000
                   GO TO ADDEND;                                        42880000
                   END;                                                 42890000
         END;                                                           42900000
         M = 37;                                                        42910000
 ADDEND: CLOSE FILE (STORAGE);                                          42920000
         CALL MSPEAK(M);                                                42930000
         GO TO GETCMD;                                                  42940000
                                                                        42950000
 DELUSER:                         /* WITHDRAW A USER'S AUTHORIZATION */ 42960000
         OPEN FILE (STORAGE) UPDATE;                                    42970000
         READ FILE (STORAGE) INTO (ADVREC);                             42980000
         IF NOSTG THEN GO TO NO_STORAGE;                                42990000
         PW = SUBSTR(WD2,1,4);                                          43000000
         TEST_WORD = -TEST_WORD;                                        43010000
         SUBSTR(MSGUID,1,4) = PW;                                       43020000
         PW = SUBSTR(WD2,5,1) || SUBSTR(WD2X,1,3);                      43030000
         TEST_WORD = -TEST_WORD;                                        43040000
         SUBSTR(MSGUID,5,4) = PW;                                       43050000
         DO I = 0 TO 597;                                               43060000
              IF SUBSTR(ADVREC,I*8+1,7) = SUBSTR(MSGUID,1,7)            43070000
              THEN DO;                                                  43080000
                   SUBSTR(ADVREC,I*8+1,8) = ' ';                        43090000
                   CALL MSPEAK(38);                       /* DELETED */ 43100000
                   END;                                                 43110000
         END;                                                           43120000
         REWRITE FILE (STORAGE) FROM (ADVREC);                          43130000
         CLOSE FILE (STORAGE);                                          43140000
         MSGUID = WD2 || SUBSTR(WD2X,1,3);                              43150000
         CALL GETMSGS(MSGUID,'M');                                      43160000
         CALL RSPEAK(205);                                              43170000
         GO TO GETCMD;                                                  43180000
                                                                        43190000
 NO_STORAGE:                                                            43200000
         CLOSE FILE (STORAGE);                                          43210000
         CALL MSPEAK(35);                                               43220000
         NOSTG = '0'B;                                                  43230000
         GO TO GETCMD;                                                  43240000
                                                                        43250000
 ACTION:                                           /* LET'S GO PLAY! */ 43260000
         CALL CLRSCRN;                                                  43270000
         CALL MSPEAK(7);                                                43280000
         RETURN;                                                        43290000
                                                                        43300000
         END WIZPROC;                                                   43310000
                                                                        43320000
 DEMOCHK: PROCEDURE;                                                    43330000
                                                                        43340000
         IF TTYPE = 'T'                                                 43350000
         THEN DO;                                                       43360000
              CALL MSPEAK(3);                                           43370000
              CALL HOURFMT;                                             43380000
              GO TO DEMO;                                               43390000
              END;                                                      43400000
         CALL MSPEAK(4);                                                43410000
         IF YES(-16,0,0)                                                43420000
         THEN DO;                                                       43430000
              CALL WIZPROC;                                             43440000
              GO TO L31;                                                43450000
              END;                                                      43460000
 DEMO:   DEMOGM = YES(-5,-7,-7);                    /* NOT A WIZARD */  43470000
         CALL LINESKP;                                                  43480000
         IF ^DEMOGM THEN GO TO DEALLOC;                                 43490000
         TURNS = TURNS + 1;                                             43500000
         RETURN;                                                        43510000
         END DEMOCHK;                                                   43520000
                                                                        43530000
                                                                        43540000
 PUTBACK: PROCEDURE;                                                    43550000
                                                                        43560000
 /*                                                                     43570000
         RESTORE SUSPENDED GAME:                                        43580000
         CARD# IS USED TO COUNT NUMBER OF SAVED GAMES THIS USER HAS     43590000
         ADVREC IS USED AS A TEMPORARY STORAGE AREA                     43600000
           BYTES  1 -> 8      ENCODED USERID                            43610000
           BYTES  9 -> 16     NAME OF GAME                              43620000
           BYTES 17 -> 24     ENCODED NAME OF GAME                      43630000
 */                                                                     43640000
                                                                        43650000
         CARD# = 0;                                                     43660000
         SUBSTR(ADVREC,1,8) = USERID;                                   43670000
         SUBSTR(ADVREC,9,8) = WD2 || SUBSTR(WD2X,1,3);                  43680000
         IF WD2 = ' '                                                   43690000
         THEN SUBSTR(ADVREC,17,8) = LOW(8);                             43700000
         ELSE DO;                                                       43710000
              PW = SUBSTR(ADVREC,9,4);                                  43720000
              TEST_WORD = -TEST_WORD;                                   43730000
              SUBSTR(ADVREC,17,4) = PW;                                 43740000
              PW = SUBSTR(ADVREC,13,4);                                 43750000
              TEST_WORD = -TEST_WORD;                                   43760000
              SUBSTR(ADVREC,21,4) = PW;                                 43770000
              END;                                                      43780000
         OPEN FILE (STORAGE) UPDATE;                                    43790000
 BRWSE:  READ FILE (STORAGE) INTO (ADVARS);                             43800000
         IF NOSTG                                                       43810000
         THEN DO;                                                       43820000
              CLOSE FILE (STORAGE);                                     43830000
              CALL CLRSCRN;                                             43840000
              CALL MSPEAK(47);           /* SUSPENDED GAME NOT FOUND */ 43850000
              INHIB = 'Y';                                              43860000
              CALL MSPEAK(49);       /* REPORT NUMBER OF GAMES FOUND */ 43870000
              SUBSTR(OUTSTR,1,4) = SEQ#;                                43880000
              SUBSTR(OUTSTR,22,8) = TSOID;                              43890000
              CALL LINEOUT;                                             43900000
              IF SUBSTR(ADVREC,9,1) ^= ' '         /* NAME WAS GIVEN */ 43910000
              THEN DO;                                                  43920000
                   INHIB = 'Y';                                         43930000
                   CALL MSPEAK(50);                /* GAME NOT SAVED */ 43940000
                   SUBSTR(OUTSTR,1,8) = SUBSTR(ADVREC,9,8);             43950000
                   SUBSTR(OUTSTR,29,8) = TSOID;                         43960000
                   INHIB = 'N';                                         43970000
                   CALL LINEOUT;                                        43980000
                   END;                                                 43990000
              CALL LINESKP;                                             44000000
              GOTO DEALLOC;                                             44010000
              END;                                                      44020000
         IF USERID ^= SUBSTR(ADVREC,1,8) THEN GO TO BRWSE;              44030000
         CARD# = CARD# + 1;                                             44040000
         IF NAME ^= SUBSTR(ADVREC,17,8) THEN GO TO BRWSE;               44050000
                                                                        44060000
         IF VERSION ^= 'V4.0'                      /*** FOUND GAME ***/ 44070000
         THEN DO;                            /** INCOMPATIBLE LEVEL **/ 44080000
              CLOSE FILE (STORAGE);                                     44090000
              CALL MSPEAK(46);                                          44100000
              CALL LINESKP;                                             44110000
              GOTO DEALLOC;                                             44120000
              END;                                                      44130000
         IF DATE_PIC = TODAY                                            44140000
         THEN DO;                        /* GAME WAS SUSPENDED TODAY */ 44150000
              IF PIC_HHMM - HHMM < 100                                  44160000
              THEN DO;                      /* LESS THAN AN HOUR AGO */ 44170000
                   CLOSE FILE (STORAGE);                                44180000
                   CALL CLRSCRN;                                        44190000
                   CALL MSPEAK(2);                                      44200000
                   CALL MSPEAK(9);                                      44210000
                   CALL LINESKP;                                        44220000
                   GOTO DEALLOC;                                        44230000
                   END;                                                 44240000
              IF PIC_HHMM - HHMM < 200 & ^ WIZARD                       44250000
              THEN DO;                      /* LESS THAN 2 HOURS AGO */ 44260000
                   CLOSE FILE (STORAGE);                                44270000
                   CALL CLRSCRN;                                        44280000
                   CALL MSPEAK(8);                                      44290000
                   CALL MSPEAK(9);                                      44300000
                   CALL LINESKP;                                        44310000
                   GOTO DEALLOC;                                        44320000
                   END;                                                 44330000
              END;                                                      44340000
         ADVREC = ' ';                                                  44350000
         REWRITE FILE (STORAGE) FROM (ADVREC);                          44360000
         CLOSE FILE (STORAGE);                                          44370000
         INHIB = 'Y';                                                   44380000
         CALL MSPEAK(51);                    /* REPORT RESTORE STATS */ 44390000
         PUT STRING (INSTR) EDIT (SUSPEND#,TURNS,ELAPSED)               44400000
                                         (F(3),F(4),F(4));              44410000
         SUBSTR(OUTSTR,12,3) = SUBSTR(INSTR,1,3);                       44420000
         SUBSTR(OUTSTR,21,4) = SUBSTR(INSTR,4,4);                       44430000
         SUBSTR(OUTSTR,34,4) = SUBSTR(INSTR,8,4);                       44440000
         INHIB = 'N';                                                   44450000
         CALL LINEOUT;                                                  44460000
         CALL LINESKP;                                                  44470000
         CARD# = 0;                                                     44480000
         RETURN;                                                        44490000
         END PUTBACK;                                                   44500000
                                                                        44510000
 GETMSGS: PROCEDURE (UID,X);                                            44520000
                                                                        44530000
         DCL UID   CHARACTER(8);                                        44540000
         DCL X     CHARACTER(1);                                        44550000
         DCL UPDTE CHARACTER(1);                                        44560000
                                                                        44570000
 /*                                                                     44580000
       UPDTE SAYS WHETHER THE MESSAGE RECORD HAS TO BE REWRITTEN.       44590000
       X: A - ALL MESSAGES                    (MAIL, NOTICES)           44600000
          B - BROADCAST MESSAGES ONLY         (NOMAIL, NOTICES)         44610000
          M - MAIL ONLY                       (MAIL, NONOTICES)         44620000
          W - WIZARD LISTING MSG USE  (EVERYBODY'S MAIL, NOTICES)       44630000
                                                                     */ 44640000
                                                                        44650000
         UPDTE = 'N';                                                   44660000
         OPEN FILE (STORAGE) UPDATE;                                    44670000
         DO J = 1 TO 2;                                                 44680000
              READ FILE (STORAGE) INTO (ADVREC);                        44690000
              IF NOSTG                                                  44700000
              THEN DO;                                                  44710000
                   NOSTG = '0'B;                                        44720000
                   CLOSE FILE (STORAGE);                                44730000
                   IF J = 1                                             44740000
                   THEN CALL MSPEAK(34);               /* EMPTY FILE */ 44750000
                   ELSE CALL MSPEAK(35);               /* NO STORAGE */ 44760000
                   RETURN;                                              44770000
                   END;                                                 44780000
         END;                                                           44790000
         DO J = 0 TO 59;                                                44800000
              CARD = SUBSTR(ADVREC,J*80+1,80);                          44810000
              IF SUBSTR(CARD,1,1) = ' ' THEN GO TO NOMAIL; /* NEXT J */ 44820000
              DO L = 1 TO 40;                                           44830000
                   COLS(L) = -COLS(L);                                  44840000
                   END;                                                 44850000
              IF X = 'M' THEN GO TO MAIL;                               44860000
              IF SUBSTR(CARD,80,1) = '*' |     /* BROADCAST MESSAGES */ 44870000
                (X = 'W' & SUBSTR(CARD,73,1) ^= ' ')  /* ALL FOR WIZ */ 44880000
              THEN DO;                                                  44890000
                   OUTSTR = SUBSTR(CARD,1,79);                          44900000
                   CALL LINEOUT;                                        44910000
                   END;                                                 44920000
              IF X = 'B' THEN GO TO NOMAIL;       /* NOTICES, NOMAIL */ 44930000
 MAIL:        IF SUBSTR(CARD,73,7) = SUBSTR(UID,1,7)                    44940000
              THEN DO;                                                  44950000
                   OUTSTR = SUBSTR(CARD,1,72);                          44960000
                   CALL LINEOUT;                                        44970000
                   SUBSTR(ADVREC,J*80+1,80) = ' ';                      44980000
                   UPDTE = 'Y';                                         44990000
                   END;                                                 45000000
 NOMAIL:      END;                                                      45010000
         IF UPDTE = 'Y'                                                 45020000
         THEN REWRITE FILE (STORAGE) FROM (ADVREC);                     45030000
         CLOSE FILE (STORAGE);                                          45040000
         RETURN;                                                        45050000
                                                                        45060000
         END GETMSGS;                                                   45070000
                                                                        45080000
  /*  CONVERT THE SUPPLIED DATE TO AN EDCDIC STRING OF FORM:         */ 45090001
  /*  WWWWWW---  DD MMM------ YYYY    EX:  FRIDAY  31 DECEMBER 1999  */ 45100000
  /*  ZELLERS CONGRUENCE FORMULA IS USED TO DETERMINE THE DAY OF THE */ 45110000
  /*  WEEK: INDEX-INTO-WEEKDAY-NAME-TABLE (0-6) =                    */ 45120000
  /*    MOD((MM-2) * 2.6 - 0.2 + DD + YY + (CC/4) - (CC * 2)),7)     */ 45130000
  /*  NOTE: INTEGER ARITHMETIC IS USED IN ALL CALCULATIONS THUS      */ 45140000
  /*        DROPPING ANY FRACTIONS/REMAINDERS                        */ 45150000
                                                                        45160000
 THISDAY: PROCEDURE (RSTRING);                                          45170000
                                                                        45180000
    DCL RSTRING                  CHARACTER(133)  VARYING;               45190000
    DCL DAY                      FIXED DEC(3,0),                        45200000
        MONTH                    CHARACTER  (9)  VARYING,               45210000
        YEAR                     FIXED DEC(5,0),                        45220000
        (IM, MM, DD, CC, YY)     FIXED BIN(15,0);                       45230000
    DCL (WORKBIN1, WORKBIN2, WORKBIN3, WORKBIN4) FIXED BIN (15,0);      45240000
                                                                        45250000
    YY = PIC_YEAR;                                                      45260001
    IM = PIC_MONTH;                                                     45270001
    DAY = PIC_DAY;                                                      45280001
    MONTH = CMONTH(IM);          /* EBCDIC MONTH            */          45290001
                                                                        45300001
   /*   ZELLERS CONGRUENCE USED TO DETERMINE DAY OF WEEK            */  45310000
    DD = DAY;                                                           45320000
    CC = YY / 100;           /* CENTURY       */                        45330001
    YY = YY - (CC * 100);    /* YEAR IN CENTURY */                      45340001
    MM = IM - 2;                                                        45350000
    IF MM <= 0 THEN                                                     45360000
    DO;                                                                 45370000
      MM = MM + 12;          /* MONTHS + 12   */                        45380000
      YY = YY - 1;           /* YEAR - 1      */                        45390000
      IF YY < 0 THEN                                                    45400000
      DO;                                                               45410000
        YY = 99;                                                        45420000
        CC = CC - 1;         /* CENTURY - 1   */                        45430000
      END;                                                              45440000
    END;                                                                45450000
    WORKBIN1 = (((MM * 26) - 2) / 10);                                  45460000
    WORKBIN2 = (YY / 4);                                                45470000
    WORKBIN3 = (CC / 4);                                                45480000
    WORKBIN4 = (CC * 2);                                                45490000
    DAY# = MOD((WORKBIN1 + DD + YY + WORKBIN2 + WORKBIN3 - WORKBIN4),7);45500000
    PUT STRING(RSTRING) EDIT(WEEK_DAY(DAY#),DAY,MONTH,PIC_YEAR)         45510001
                            (A,P'Z9',X(1),A,X(1),A);                    45520001
                                                                        45530000
    END THISDAY;                                                        45540000
                                                                        45550000
 SCANSTG: PROCEDURE;                                                    45560000
                                                                        45570000
         OPEN FILE (STORAGE) UPDATE;                                    45580000
         READ FILE (STORAGE) INTO (ADVREC);                             45590000
         IF NOSTG                                                       45600000
         THEN DO;                                                       45610000
              CLOSE FILE (STORAGE);                                     45620000
              CALL MSPEAK(34);                         /* EMPTY FILE */ 45630000
              RETURN;                                                   45640000
              END;                                                      45650000
         DO M = 0 TO 74;                                                45660000
              OUTSTR = SUBSTR(ADVREC,M*64+1,64);                        45670000
              DO KQ = 0 TO 7;                                           45680000
                   IF SUBSTR(OUTSTR,KQ*8+1,1) ^= ' '                    45690000
                   THEN DO;                                             45700000
                        PW = SUBSTR(OUTSTR,KQ*8+1,4);                   45710000
                        TEST_WORD = -TEST_WORD;                         45720000
                        SUBSTR(OUTSTR,KQ*8+1,4) = PW;                   45730000
                        IF M = 74 & (KQ = 6 | KQ = 7)                   45740000
 /* HOURS */            THEN DO;                                        45750000
                             PW = SUBSTR(OUTSTR,KQ*8+5,4);              45760000
                             TEST_WORD = -TEST_WORD;                    45770000
                             SUBSTR(OUTSTR,KQ*8+5,4) = PW;              45780000
                             END;                                       45790000
 /* USERS */            ELSE DO;                                        45800000
                             PW = SUBSTR(OUTSTR,KQ*8+5,3) || ' ';       45810000
                             TEST_WORD = -TEST_WORD;                    45820000
                             SUBSTR(PW,4,1) = ' ';                      45830000
                             SUBSTR(OUTSTR,KQ*8+5,4) = PW;              45840000
                             END;                                       45850000
                        END;                                            45860000
                   END;                                                 45870000
              IF OUTSTR ^= ' ' THEN CALL LINEOUT;                       45880000
              END;                                                      45890000
         READ FILE (STORAGE) INTO (ADVREC);                             45900000
         IF NOSTG THEN GO TO LOOPND;                                    45910000
         CARD = SUBSTR(ADVREC,1,80);     /* FIRST BIT OF MSG RECORD */  45920000
         IF CARD ^= ' '                                                 45930000
         THEN DO L = 1 TO 40;                                           45940000
              COLS(L) = -COLS(L);                                       45950000
              END;                                                      45960000
         OUTSTR = SUBSTR(CARD,1,79);                                    45970000
         CALL LINEOUT;                                                  45980000
         ADVREC = ' ';                                                  45990000
         CALL GETIN(REPLY,JUNK1,JUNK2,JUNK3);                           46000000
         L = VOCAB(REPLY,-1);                                           46010000
         IF SUBSTR(REPLY,1,3) = 'DEL' | L =1028 | L = 2012              46020000
         THEN DO;                                                       46030000
              REWRITE FILE (STORAGE) FROM (ADVREC);                     46040000
              CALL MSPEAK(38);                            /* DELETED */ 46050000
              CALL LINESKP;                                             46060000
              END;                                                      46070000
 RDLOOP: READ FILE (STORAGE) INTO (ADVARS);                             46080000
         IF NOSTG THEN GO TO LOOPND;                                    46090000
         IF USERID = ' '                                                46100000
         THEN DO;                                                       46110000
              CALL MSPEAK(44);                       /* EMPTY RECORD */ 46120000
              GO TO RDLOOP;                                             46130000
              END;                                                      46140000
         PW = SUBSTR(USERID,1,4);                                       46150000
         TEST_WORD = -TEST_WORD;                                        46160000
         SUBSTR(TSOID,1,4) = PW;                                        46170000
         PW = SUBSTR(USERID,5,4);                                       46180000
         TEST_WORD = -TEST_WORD;                                        46190000
         SUBSTR(TSOID,5,4) = SUBSTR(PW,1,3) || SUBSTR(USERID,8,1);      46200000
         PW = SUBSTR(NAME,1,4);                                         46210000
         TEST_WORD = -TEST_WORD;                                        46220000
         SUBSTR(TEMPNAME,1,4) = PW;                                     46230000
         PW = SUBSTR(NAME,5,4);                                         46240000
         TEST_WORD = -TEST_WORD;                                        46250000
         SUBSTR(TEMPNAME,5,4) = PW;                                     46260000
         DATE_PIC = TODAY;                                              46270000
         PIC_HHMM = HHMM;                                               46280000
         SUBSTR(PUTDATE,1,4) = SUBSTR(DATE_STG,1,4);                    46290001
         SUBSTR(PUTDATE,6,2) = SUBSTR(DATE_STG,5,2);                    46300001
         SUBSTR(PUTDATE,9,2) = SUBSTR(DATE_STG,7,2);                    46310001
         SUBSTR(PUTHHMM,1,2) = SUBSTR(DATE_STG,9,2);                    46320001
         SUBSTR(PUTHHMM,4,2) = SUBSTR(DATE_STG,11,2);                   46330001
         PUT STRING (OUTSTR) EDIT (TSOID,TEMPNAME,' suspend no.',       46340000
         SUSPEND#,' on ',PUTDATE,' at ',PUTHHMM,' at location ',LOC)    46350000
          (A,A,A,F(2),A,A,A,A,A,F(3));                                  46360000
         CALL LINEOUT;                                                  46370000
         PUT STRING (OUTSTR) EDIT ('   after',ELAPSED,' minutes and',   46380000
         TURNS,' turns?') (A,F(4),A,F(4),A);                            46390000
         IF DEMOGM THEN OUTSTR = OUTSTR || '?';                         46400000
         IF WIZARD THEN OUTSTR = OUTSTR || '!';                         46410000
         CALL LINEOUT;                                                  46420000
         CALL GETIN(REPLY,JUNK1,JUNK2,JUNK3);                           46430000
         L = VOCAB(REPLY,-1);                                           46440000
         IF L = 2027 THEN GO TO RDLOOP;   /* DO NOT UPDATE DISK FILE */ 46450000
         IF L = 57 | L = 2001                                           46460000
         THEN DO;                                                       46470000
              CLOSE FILE (STORAGE);                                     46480000
              RETURN;                                                   46490000
              END;                                                      46500000
         IF SUBSTR(REPLY,1,3) = 'DEL' | L =1028 | L = 2012              46510000
         THEN DO;                                                       46520000
              REWRITE FILE (STORAGE) FROM (ADVREC);                     46530000
              CALL MSPEAK(38);                            /* DELETED */ 46540000
              CALL LINESKP;                                             46550000
              GO TO RDLOOP;                                             46560000
              END;                                                      46570000
         IF REPLY = 'DEMO '                                             46580000
         THEN DO;                  /* GAME CANNOT BE SUSPENDED AGAIN */ 46590000
              DEMOGM = '1'B;                                            46600000
              END;                                                      46610000
         IF REPLY = '^DEMO'                                             46620000
         THEN DO;                                   /* UNDO A "DEMO" */ 46630000
              DEMOGM = '0'B;                                            46640000
              END;                                                      46650000
         IF L = 2008                                                    46660000
         THEN DO;                               /* RESET WIZARD FLAG */ 46670000
              WIZARD = '0'B;                                            46680000
              END;                                                      46690000
         INSTR,JUNK1,JUNK2,JUNK3,REPLY,WD1,WD1X,WD2,WD2X = ' ';         46700000
         TKWORD = ' ';                                                  46710000
         OUTSTR = INSTR;                                                46720000
         REWRITE FILE (STORAGE) FROM (ADVARS);                          46730000
         CALL MSPEAK(7);                                                46740000
         CALL LINESKP;                                                  46750000
         GO TO RDLOOP;                                                  46760000
 LOOPND: CALL MSPEAK(45);                     /* END OF FILE REACHED */ 46770000
         CLOSE FILE (STORAGE);                                          46780000
         CALL LINESKP;                                                  46790000
         GOTO DEALLOC;                                                  46800000
         END SCANSTG;                                                   46810000
                                                                        46820000
 DEALLOC:                              /* DEALLOCATE FILES AND STOP. */ 46830000
     DDNAME = 'STORAGE ';                                               46840000
     CALL R062A10(PARMLIST);                                            46850000
     DDNAME = 'OBJECT  ';                                               46860000
     CALL R062A10(PARMLIST);                                            46870000
     CALL PLIRETC(0);                        /***  COND CODE 0000  ***/ 46880000
                                                                        46890000
     END PROGRAM;                                                       46900000

