10 REM ﾐｽﾃﾘｰ << M ﾉ ﾋｹﾞｷ >>
20 CLR:CONSOLEC80,S0,24,GN:CCOLOR@7,0:COLOR,O7,W0
30 DIM M$(3)
40 DATA 240,240,240,120,124,126,119,115,113,112,112,112,112,112,112,248
50 DATA 15,15,15,30,62,126,238,206,142,14,14,14,14,14,14,31
60 DATA 0,0,0,15,24,48,96,96,97,99,102,60,24,0,0,0
70 DATA 0,0,0,240,24,52,102,198,134,6,6,6,4,8,16,0
80 DATA 4,252,4,252,4,252,4,4,4,0,9,9,16,32,64,128
90 DATA 64,127,64,127,64,127,64,64,64,4,34,17,136,64,33,31
100 DATA 4,7,4,63,36,47,36,39,32,47,36,44,39,42,70,138
110 DATA 1,193,17,209,81,17,17,145,17,209,17,145,17,129,66,4
120 FORI=0TO3:FORJ=0TO31
130 READ X:M$(I)=M$(I)+CHR$(X)
140 NEXT J,I:GOTO 230
150 FORI=0TO10:FORJ=0TO78
160 CURSOR J,I:PRINTCHR$(32);
170 NEXT J,I
180 PRINT"{HOME}":RETURN
190 PRINT"{RIGHT}K: ";:INPUT C$:RETURN
200 PRINT"{DOWN}{RIGHT}COMMAND1:";CHR$(12);:INPUT C1$:RETURN
210 PRINT"{RIGHT}COMMAND2:";CHR$(12);:INPUT C2$:RETURN
220 FORI=1TO6:MUSIC"-CO-DO":NEXT:RETURN
230 PRINT"{CLR}":GRAPH C7
240 LINE[4]0,0,319,0,319,199,0,199,0,0
250 L=1:FORI=0TO3
260 POSITION48+8*I,8+18*I:PATTERN[L]-16,M$(0)
270 POSITION88+8*I,8+18*I:PATTERN[L]-16,M$(1)
280 POSITION128+8*I,8+18*I:PATTERN[L]-16,M$(2)
290 POSITION168+8*I,8+18*I:PATTERN[L]-16,M$(3)
300 L=L+1:NEXT
310 CURSOR 53,10:PRINT"Author  CHIAKI. KASAHARA"
330 LINE[1] 20,140,100,140,100,170,20,170
340 LINE[1] 20,170,20,160,22,158,23,156,23,153,22,152,20,150,20,140
350 LINE[1] 20,168,100,168
360 CURSOR 0,19:PRINT"{RIGHT}{RIGHT}{RIGHT}{RIGHT}{RIGHT}{RIGHT}{RIGHT}{RIGHT}{RIGHT}{RIGHT}LSI  M80-CPU"
370 CURSOR 0,20:PRINT"{RIGHT}{RIGHT}{RIGHT}{RIGHT}{RIGHT}{RIGHT}{RIGHT}{BLK}"
380 CURSOR 0,21:PRINT"{RIGHT}{RIGHT}{RIGHT}{RIGHT}{RIGHT}VVVVVVVVVVVVVVVVVVVV"
390 LINE[1]265,145,268,110,260,105,220,105,210,110,213,115,245,115,248,145
400 LINE[3]217,116,217,125,210,133,215,138,215,147,220,150
410 LINE[4]216,123,232,123,230,130,220,130,216,123
420 LINE[4]232,127,245,127:LINE[7]214,142,205,142,205,144,214,144
430 LINE[2]225,160,200,155,220,150,280,142,265,160,288,170,300,198
440 LINE[2]222,160,200,170,186,198:LINE[2]200,171,208,198
450 LINE[2]215,170,240,170:LINE[2]260,170,280,170:LINE[2]248,165,260,198
455 PAINT[5]200,180,2,4
456 PAINT[5]220,180,2,4
460 REM # ｺｲﾋﾞﾄﾖ
470 C1$="-C1-D-E-F-G3-GC1DC-B-A3-A7R5"
480 C2$="-D1-E-F-G4-B1CDEF6-G1-A-G-A-G3-G5R5"
490 C3$="-G3-A-G-F-G5-E3-D5-C3-C5-C3-E-GC5R1"
500 C4$="C1DEE3D-#B-G-G5-G3DEDCC8R5"
510 C5$="C1CFGF3F7F3C1CEFE3E7"
520 C6$="E3DCDDD-#B-G5-G1G3F1EDE3E7"
530 C7$="C1CAGAGF3F7C1CCGGFGGGFE3"
540 C8$="D1ED5D1-#B3-B1-G5-G1G3F1EDC3C8"
550 TEMPO5:MUSIC C1$,C2$,C3$,C4$,C5$,C6$,C7$,C8$
560 GOSUB 150
562 FORI=0TO3
564 POSITION48+8*I,8+18*I:PATTERN[0]-16,M$(0)
566 POSITION88+8*I,8+18*I:PATTERN[0]-16,M$(1)
567 POSITION128+8*I,8+18*I:PATTERN[0]-16,M$(2)
568 POSITION168+8*I,8+18*I:PATTERN[0]-16,M$(3)
569 NEXT
570 CURSOR 20,1:PRINT"<ﾌﾟﾛﾛｰｸﾞ>"
580 PRINT"{RIGHT}ｷﾐﾊ,ｼﾘﾂﾀﾝﾃｲ ﾉ K (Kindaichi Konsuke) ﾃﾞｱﾙ｡"
590 PRINT"{RIGHT}ｱﾙﾋ K ﾉ ｼﾞﾑｼｮ ﾆ,ﾄﾋﾞｯｷﾘ ﾉ ﾅﾝｼﾞｹﾝ ｶﾞ ﾓﾁｺﾏﾚﾀ｡"
600 PRINT"{RIGHT}ﾆﾎﾝ ﾉ ｵｵﾃ ｺﾝﾋﾟｭｰﾀ ﾒｰｶｰ Micro-hardｼｬ ﾉ ｼｬﾁｮｳ M ｶﾞ ﾅﾆﾓﾉｶﾆ ｻﾂｶﾞｲ ｻﾚﾀﾉﾃﾞｱﾙ｡"
610 PRINT"{RIGHT}ｿﾉ ﾊｲｺﾞﾆﾊ,ｱﾀﾗｼｲ M80-CPU ﾉ ｶｲﾊﾂ ｦ ﾒｸﾞｯﾃ,ﾒｰｶｰ ﾉ ｲﾝﾎﾞｳ ｶﾞ ﾋｿﾝﾃﾞｲﾀ｡"
620 PRINT"{RIGHT}ﾏｽｺﾐ ﾊ ｺﾚｦ ｢M ﾉ ﾋｹﾞｷ｣ ﾄ ﾅｽﾞｹﾃ,ﾀﾞｲﾀﾞｲﾃｷﾆ ﾎｳﾄﾞｳ ｼﾀ｡"
630 PRINT"{RIGHT}ｷﾐﾊ,ｹｲｼﾁｮｳ ﾉ Oｹｲﾌﾞ ﾉ ｲﾗｲ ｦ ｳｹﾃ ｺﾉ ﾅﾝｼﾞｹﾝ ﾆ ﾄﾘｸﾑ ｺﾄﾆﾅｯﾀ｡"
640 PRINT"{RIGHT}ﾊﾀｼﾃ ｷﾐﾊ ｢M ﾉ ﾋｹﾞｷ｣ ｦ ﾐｺﾞﾄ ｶｲｹﾂｼﾃ,ﾊﾝﾆﾝ ｦ ｱｹﾞﾙ ｺﾄｶﾞ ﾃﾞｷﾙﾀﾞﾛｳｶ｡"
650 PRINT"{DOWN}{RIGHT}PUSH [CR]"
660 GET C$:IF C$<>CHR$(13) THEN 660
670 GOSUB 150
680 PRINT"{RIGHT}ｺﾉ ﾐｽﾃﾘｰｹﾞｰﾑ ﾊ ﾂｷﾞﾉﾖｳﾅ ｽｲﾘ ﾆ ﾖｯﾃ ｼﾝｺｳｽﾙ｡"
690 PRINT"{RIGHT}COMMAND1: ｺﾚﾆﾊ ﾒｲｼ(ｲｴ,ｸﾙﾏ,ﾋﾄ,etc) ｦ INPUT ｽﾙ｡"
700 PRINT"{RIGHT}COMMAND2: ｺﾚﾆﾊ ﾄﾞｳｼ(ｼﾗﾍﾞﾙ,ﾑｶｳ,ﾊｲﾙ,etc) ｦ INPUT ｽﾙ｡"
710 PRINT"{RIGHT}ﾘｮｳﾎｳ ﾉ ｺﾏﾝﾄﾞ ｦ ｾｲｶｲ ｼﾅｹﾚﾊﾞ,ｿｳｻ ﾊ ﾕｷﾂﾞﾏﾘ ﾆ ﾅﾙ｡"
720 PRINT"{RIGHT}ﾀﾒｼﾆ ﾋﾄﾂ,ﾀﾊﾞｺ ｦ ｹｽ ｿｳｻ ｦ ﾔｯﾃﾐﾖｳ｡"
730 GOSUB 200
740 IF C1$<>CHR$(192)+CHR$(202)+CHR$(222)+CHR$(186)GOSUB 150:GOTO 720
750 GOSUB 210
760 IF C2$<>CHR$(185)+CHR$(189)GOSUB 150:GOTO 720
770 BLINE[7;W1]214,142,205,142,205,144,214,144
780 PRINT"{DOWN}{RIGHT}Are you ready ?{RIGHT}{RIGHT}{RIGHT}Push [CR] to start !"
790 GET C$:IF C$<>CHR$(13)THEN 790
800 PRINT"{CLR}":GRAPH C7
810 REM P-1  :GOSUB 220
820 LINE[1]35,185,40,165,55,155,60,140,65,145,95,145,100,140,105,155,120,165,125,185,35,185
830 LINE[1]57,142,57,148,38,148,35,145,40,132,43,130,117,130,120,132,125,145,122,148,103,148,103,142
840 FORJ=0TOπ*2 STEP.1
850 SET[6]16*COS(J)+80,14*SIN(J)+165
860 SET[6]10*COS(J)+80,8*SIN(J)+165
870 NEXT
880 LINE[2]155,185,155,170,152,167,152,165,155,162,160,162,163,165,163,167,158,170,158,175,161,175,161,178,158,178,158,185,155,185
890 LINE[3]155,164,160,164,160,167,155,167,155,165
900 LINE[4]180,177,180,150,280,150,280,177,180,177
910 LINE[5]190,170,190,155,270,155,270,170,190,170
920 LINE[5]220,155,220,170:LINE[5]242,155,242,170
930 LINE[7]280,150,290,160,290,172,280,177
940 LINE[5]195,177,200,182,205,177:LINE[5]260,177,265,182,270,177
950 LINE[6]10,198,30,140,36,140:LINE[6]125,140,318,140
960 PRINT"{RIGHT}ｷﾐｶﾞ ﾀﾝﾃｲｼﾞﾑｼｮ ﾆ ｲﾙﾄ ﾂｸｴ ﾉ ﾃﾞﾝﾜ ｶﾞ ﾅﾘﾋﾋﾞｲﾀ｡"
970 PRINT"{RIGHT}ｻｲｷﾝ ﾊ ｷｮｳｱｸ ｼﾞｹﾝ ﾊﾞｶﾘﾃﾞ,ｽﾞﾉｳ ｦ ﾂｶｳ ﾀﾝﾃｲ ﾉ ﾃﾞﾊﾞﾝ ｶﾞ ｽｸﾅｲ｡"
980 PRINT"{RIGHT}ｱﾀﾏ ﾆ ﾋﾗﾒｸ ｶﾝｼﾞﾃﾞﾊ,ｻｯｿｸ ｼﾞｹﾝ ﾉ ﾖｳﾀﾞ｡"
990 GOSUB 200
1000 IF C1$<>CHR$(188)+CHR$(222)+CHR$(173)+CHR$(220)+CHR$(183)GOSUB 150:GOTO 960
1010 GOSUB 210
1020 IF C2$<>CHR$(196)+CHR$(217)GOSUB 150:GOTO 960
1030 BLINE[1,W1]57,142,57,148,38,148,35,145,40,132,43,130,117,130,120,132,125,145,122,148,103,148,103,142
1040 LINE[6]30,140,318,140:LINE[1]1,100,10,140,35,180
1050 GOSUB 150
1060 PRINT"{RIGHT}ﾃﾞﾝﾜ ﾉ ﾇｼ ﾊ ｹｲｼﾁｮｳ ﾉ Oｹｲﾌﾞ ﾀﾞｯﾀ｡"
1070 PRINT"{RIGHT}O: ｼﾞｹﾝ ﾀﾞﾖ K｡ ｷﾐ ﾆ ｳｯﾃﾂｹ ﾉ ﾔｯｶｲﾅ ｼﾞｹﾝ ｶﾞ ｵｷﾀ｡"
1080 PRINT"{RIGHT}K: ｷﾏｸﾞﾚﾆ ﾔｯｶｲﾅ ｼﾞｹﾝ ｦ ﾓﾁｺﾑﾉﾊ ｹｲﾌﾞ ﾉ ﾎｳｼﾞｬﾅｲﾃﾞｽｶ｡"
1090 PRINT"{RIGHT}O: ｲﾏﾊ ｲﾔﾐ ｦ ｲｯﾃｲﾙ ﾊﾞｱｲ ﾃﾞﾊ ﾅｲ｡ ｺﾝﾋﾟｭｰﾀ ｶﾞｲｼｬ ﾉ ｼｬﾁｮｳ ｶﾞ ｺﾛｻﾚﾀ｡"
1100 PRINT"{RIGHT}{RIGHT}{RIGHT}{RIGHT}ﾊﾞｼｮ ﾊ ｺｳｶﾞｲ ﾆ ｱﾙ Z ﾏﾝｼｮﾝ ﾉ ﾆｶｲ ﾀﾞ｡ ｽｸﾞﾆ ｷﾃｸﾚ｡"
1110 PRINT"{RIGHT}K: ﾊﾝｻﾞｲ ｿｳｻ ﾉ ｷﾎﾝ ﾊ,ﾏｽﾞ ｾｲｶｸﾆ ｼﾞｶﾝ ｦ ﾀｼｶﾒﾃ ｵｸｺﾄﾀﾞ｡"
1120 GOSUB 200
1130 IF C1$<>CHR$(196)+CHR$(185)+CHR$(178)GOSUB 150:GOTO 1110
1140 GOSUB 210
1150 IF C2$<>CHR$(208)+CHR$(217)GOSUB 150:GOTO 1110
1160 CURSOR 49,20:PRINT"9 /10{RIGHT}{RIGHT}{RIGHT}MON{RIGHT}{RIGHT}10:30"
1170 GOSUB 150
1180 PRINT"{RIGHT}9ｶﾞﾂ 10ｶ ｹﾞﾂﾖｳﾋﾞ,ｺﾞｾﾞﾝ 10ｼﾞ 30ﾌﾟﾝ ﾀﾞ｡"
1190 PRINT"{RIGHT}ﾊﾝｻﾞｲ ﾊ ﾄｷ ﾄ ﾊﾞｼｮ ｦ ｴﾗﾊﾞｽﾞ｡"
1200 PRINT"{RIGHT}ｿﾚﾃﾞﾊ ﾊﾝｺｳｹﾞﾝﾊﾞ ﾆ ﾃﾞｶｹﾙﾄ ｼﾖｳ｡"
1210 PRINT"{RIGHT}ｱｲﾖｳ ﾉ ﾎﾟﾝｺﾂｸﾞﾙﾏ ｦ ﾊｼﾗｾﾙﾄ ｽﾙｶ｡"
1220 GOSUB 200
1230 IF C1$<>CHR$(182)+CHR$(183)+CHR$(222)GOSUB 150:GOTO 1220
1240 GOSUB 210
1250 REM P-2
1260 GRAPHC7:PRINT"{CLR}":GOSUB 220
1270 FORI=0TO2
1280 LINE[3]20,100+30*I,300,100+30*I,300,110+30*I,20,110+30*I,20,100+30*I
1290 FORJ=0TO5
1300 LINE[5]30+40*J,110+30*I,30+40*J,130+30*I:NEXTJ
1310 LINE[6]30,120+30*I,230,120+30*I:LINE[5]290,110+30*I,290,130+30*I
1320 LINE[7]260,130+30*I,260,120+30*I,280,120+30*I,280,130+30*I
1330 LINE[7]270,120+30*I,270,130+30*I
1340 NEXT I
1350 FORI=0TO9:LINE[1]1,190+I,318,190+I:NEXT
1360 PRINT"{RIGHT}ｻｲｷﾝ ｵｵﾊﾊﾞﾆ ｷﾞｮｳｾｷ ｦ ﾉﾊﾞｼﾀ Micro-hard ﾉ Mｼｬﾁｮｳ ﾊ ﾜﾝﾏﾝﾀｲﾌﾟ ﾉ ｼﾞﾂｷﾞｮｳｶ ﾃﾞｱﾘ,"
1370 PRINT"{RIGHT}ｿﾉ ｺﾞｳｲﾝﾅ ﾔﾘｸﾁ ﾃﾞ ｵｵｸﾉ ﾃｷ ｦ ｺｼﾗｴﾃ ｲﾀ｡"
1380 PRINT"{RIGHT}ｺﾝﾋﾟｭｰﾀ ﾉ IC ｺﾝﾄﾛｰﾗ ﾉ ｾｯｹｲｽﾞ ｦ ﾗｲﾊﾞﾙ ﾒｰｶｰ ｶﾗ ｽﾊﾟｲ ｺｳｲ ﾆﾖｯﾃ,"
1390 PRINT"{RIGHT}ｺﾋﾟｰ ｼ,ｵﾘｼﾞﾅﾙ ﾃﾞｱﾙｶ ﾉﾖｳﾆ ﾊﾂﾊﾞｲ ｼﾀﾄｲｳ ｳﾜｻ ﾃﾞｱﾙ｡"
1400 PRINT"{RIGHT}M ﾊ  ｶﾅﾘ ﾌﾄｯﾀ 50ｵﾄｺ ﾃﾞｱﾘ,ﾄﾞｳｲｳ ﾜｹｶ 1ｶｹﾞﾂ ﾎﾄﾞ ﾏｴｶﾗ,"
1410 PRINT"{RIGHT}ﾂﾏ ﾔ ｺﾄﾞﾓ ﾄ ﾍﾞｯｷｮｼﾃ,ﾋﾄﾘ ｺｳｶﾞｲ ﾉ ｺｳｷｭｳ ﾏﾝｼｮﾝ ﾆ ｽﾝﾃﾞｲﾀ｡"
1420 GOSUB 200
1430 IF C1$<>CHR$(207)+CHR$(221)+CHR$(188)+CHR$(174)+CHR$(221)GOSUB 150:GOTO 1420
1440 GOSUB 210
1450 IF C2$<>CHR$(202)+CHR$(178)+CHR$(217)GOSUB 150:GOTO 1410
1460 GOSUB 150
1470 PRINT"{RIGHT}K: ﾅｶﾆ ﾊｲｯﾃﾐﾙﾄ ｻｽｶﾞﾆ ｶﾈﾓﾁ ﾉ ｽﾐﾂｷｿｳﾅ ｺﾞｳｶﾅ ﾀﾃﾓﾉﾀﾞ｡"
1480 PRINT"{RIGHT}{RIGHT}{RIGHT}{RIGHT}ｼﾘﾂﾀﾝﾃｲ ﾉ ﾜﾀｼﾉ ｽﾝﾃﾞｲﾙ ﾔｽ ｱﾊﾟｰﾄ ﾄﾊ ｳﾝﾃﾞｲﾉ ｻｶﾞ ｱﾙ｡"
1490 PRINT"{RIGHT}{RIGHT}{RIGHT}{RIGHT}ｻｲｷﾝ ﾌﾞｰﾑ ﾉ ｺﾝﾋﾟｭｰﾀ ｶﾞｲｼｬ ﾊ ﾓｳｶｯﾃ ｲﾙﾝﾀﾞﾅ｡"
1500 PRINT"{RIGHT}{RIGHT}{RIGHT}{RIGHT}ｲｸﾗ ｶﾈﾓﾁ ﾃﾞｱｯﾃﾓ,ｼﾀﾞｲ ﾆ ﾅｯﾁｬ ｵｼﾏｲﾀﾞｶﾞ..."
1510 GOSUB 200
1520 IF C1$<>CHR$(198)+CHR$(182)+CHR$(178)GOSUB 150:GOTO 1510
1530 GOSUB 210
1540 IF C2$<>CHR$(177)+CHR$(182)+CHR$(222)+CHR$(217)GOSUB 150:GOTO 1510
1550 GOTO 1720
1560 GRAPHC7:PRINT"{CLR}":GOSUB 220
1570 REM P-3
1580 LINE[2]1,80,40,90,40,130,1,198
1590 LINE[2]260,60,100,90,100,130,318,198
1600 FORI=0TO1:LINE[2]40,90+30*I,100,90+30*I:NEXT
1610 LINE[2]40,130,100,130:LINE[1]50,100,90,100
1620 FORI=0TO2:LINE[1]50+20*I,100,50+20*I,119:NEXT
1630 LINE[7]220,93,220,155,180,155,180,100,230,90,230,170
1640 LINE[1]63,160,90,160,87,157,80,153,75,150,66,150,63,160
1650 LINE[3]125,160,155,160:LINE[3]130,160,130,147,150,147,150,160
1660 FORI=0TO1:FORJ=0TOπSTEP.1
1670 SET[6]10*COS(J)+75+65*I,15*SIN(J)+160
1680 NEXT J
1690 LINE[5]70+65*I,173,55+65*I,199,95+65*I,199,80+65*I,173
1700 NEXTI
1702 PAINT[1]80,155,1,6:PAINT[3]140,155,3,6
1704 PAINT[1]80,180,5,6:PAINT[4]140,180,5,6
1710 CURSOR 53,14:PRINT"0{BLK}":RETURN
1720 GOSUB 1560
1730 PRINT"{RIGHT}K: ｺｺｶﾞ ﾋｶﾞｲｼｬ ﾉ ﾍﾔﾀﾞﾅ｡ ﾔｱ,Oｹｲﾌﾞ,ﾊｯｷﾘ ｲｯﾃ M ﾉ ｼｲﾝﾊ ﾅﾝﾃﾞｽｶ ?"
1740 PRINT"{RIGHT}O: ﾏｯﾃｲﾀｿﾞ K｡ ｲﾏ ｹｲｻﾂｲ ﾄ ｶﾝｼｷﾊﾝ ｶﾞ ﾅｲﾌﾞ ｦ ﾄﾘｼﾗﾍﾞ ﾁｭｳ ﾀﾞﾖ｡"
1750 PRINT"{RIGHT}{RIGHT}{RIGHT}{RIGHT}ﾎﾄｹ ﾊ ﾊﾞｽﾙｰﾑ ﾃﾞ ｺﾄｷﾚﾃｲﾙ｡ ｼｶｼ ｼﾝｿﾞｳﾎｯｻ ﾅﾄﾞﾉ ｳﾀｶﾞｲ ﾊ ﾏｯﾀｸ ﾅｲ｡"
1760 PRINT"{RIGHT}K: ﾄｲｳｺﾄﾊ ﾀｻﾂ ﾉ ｳﾀｶﾞｲ ｶﾞ ﾉｳｺｳﾀﾞﾄ ｲｳｺﾄﾃﾞｽｶ ?"
1770 PRINT"{RIGHT}O: ﾔｯｺｻﾝ ﾊ ﾖ ｦ ﾊｶﾅﾝﾃﾞ ｼﾞｻﾂ ｽﾙﾖｳﾅ ﾔﾜﾅ ｾｲｶｸ ﾃﾞﾓ ﾅｶｯﾀﾖｳﾀﾞ｡"
1780 PRINT"{DOWN}{RIGHT}PUSH [CR]"
1790 GET C$:IF C$<>CHR$(13)THEN 1790
1800 GOSUB 150
1810 PRINT"{RIGHT}K: ﾃﾞﾊ,ｼﾀﾞｲ ﾉ ﾀﾞｲｲﾁﾊｯｹﾝｼｬ ﾊ ﾀﾞﾚ ﾅﾝﾃﾞｽｶ ?"
1820 PRINT"{RIGHT}O: ﾏﾝｼｮﾝ ﾉ ｶﾝﾘﾆﾝ ｶﾞ ﾊｯｹﾝｼ,ｹｲｻﾂ ﾆ ﾂｳﾎｳ ｼﾃｷﾀﾉﾀﾞ｡"
1830 PRINT"{RIGHT}K: ｿﾉﾄｷ ﾍﾔ ﾉ ﾄﾞｱ ﾊ ﾄﾞｳﾅｯﾃｲﾀﾝﾃﾞｽ ?"
1840 PRINT"{RIGHT}O: ｳﾁｶﾞﾜ ｶﾗ ｶｷﾞ ｶﾞ ｶｶｯﾃｲﾃ,ｶﾝﾘﾆﾝ ﾊ ｽﾍﾟｱｰｷｰ ﾃﾞ ｱｹﾀ ﾄｲｯﾃｲﾙ｡"
1850 PRINT"{RIGHT}K: ﾄｲｳｺﾄﾊ,ｲｯｼｭ ﾉ ﾐｯｼﾂ ｼﾞｮｳﾀｲ ﾀﾞｯﾀﾜｹﾀﾞ｡"
1860 GOSUB 200
1870 IF C1$=CHR$(205)+CHR$(212)THEN 1890
1880 GOSUB 150:GOTO 1860
1890 GOSUB 210
1900 IF C2$<>CHR$(202)+CHR$(178)+CHR$(217)GOSUB 150:GOTO 1860
1910 GOTO 2120
1920 REM P-4
1930 GRAPHC7:PRINT"{CLR}":GOSUB 220
1940 LINE[1]1,90,30,90,30,180
1950 LINE[4]120,140,115,135,120,125,150,125,155,135,150,140
1960 LINE[2]22,199,80,140,200,140,142,199:LINE[2]190,150,190,190,185,190,185,156
1970 LINE[5]319,140,260,140,255,145,255,165,319,165
1980 LINE[5]255,165,230,170,225,175,225,194,319,194
1990 LINE[3]90,142,90,155,85,160,90,165,100,165,105,160,100,155,100,142,90,142
2000 LINE[1]130,150,135,165,140,165,145,150,130,150
2010 LINE[7]50,198,60,180,120,180,110,198
2020 LINE[7]55,190,115,190:LINE[3]90,150,100,150
2030 LINE[6]0,180,39,180:LINE[6]161,180,184,180:LINE[6]191,180,225,180
2040 REM
2050 LINE[6]210,90,240,90,240,130,210,130,210,90:LINE[2]215,95,235,95,235,125,215,125,215,95
2060 LINE[7]218,98,228,108,220,110,232,122
2070 FORI=0TO2
2080 LINE[1]80,90+15*I,160,90+15*I
2090 LINE[1]80+40*I,90,80+40*I,120
2100 NEXT
2102 PAINT[3]95,155,3:PAINT[4]120,130,2,4
2104 PAINT[6]10,190,2,6:PAINT[6]200,190,2,5,6
2110 CURSOR 5,17:PRINT"0{BLK}":RETURN
2120 GOSUB 1920
2130 PRINT"{RIGHT}K: ｺｺｶﾞ ﾘﾋﾞﾝｸﾞﾙｰﾑ ﾀﾞﾅ｡ ｼﾞﾂﾅｲ ﾊ ｱﾗｻﾚﾀ ﾖｳｽｶﾞ ﾅｲ｡"
2140 PRINT"{RIGHT}{RIGHT}{RIGHT}{RIGHT}ｼﾞｭﾀﾝ ｶﾞ ｲｸﾗｶ ｼﾜ ﾆ ﾅｯﾃ ﾖｺﾞﾚﾃ ｲﾙﾃﾞｲ ﾀﾞ｡"
2150 PRINT"{RIGHT}{RIGHT}{RIGHT}{RIGHT}ﾃｰﾌﾞﾙ ﾉ ｳｴﾆ ﾉｯﾃｲﾙﾉﾊ,ﾌﾞﾗﾝﾃﾞｰ ﾉ ﾋﾞﾝ ﾄ ｸﾞﾗｽ,ｿｼﾃ ｼﾝﾌﾞﾝ｡"
2160 PRINT"{RIGHT}{RIGHT}{RIGHT}{RIGHT}ｱﾄﾊ ｱﾘｷﾀﾘ ﾉ ｿﾌｧ ﾄ ｶﾍﾞ ﾆ ｶｶｯﾀ ｶﾞｸﾌﾞﾁ ﾀﾞｹ｡"
2170 GOSUB 200
2180 IF C1$=CHR$(188)+CHR$(221)+CHR$(204)+CHR$(222)+CHR$(221)GOTO 2230
2190 IF C1$=CHR$(203)+CHR$(222)+CHR$(221)GOTO 2290
2200 IF C1$=CHR$(184)+CHR$(222)+CHR$(215)+CHR$(189)GOTO 2350
2210 IF C1$=CHR$(196)+CHR$(222)+CHR$(177)GOTO 2410
2220 GOSUB 150:GOTO 2170
2230 GOSUB 210:GOSUB 150
2240 BLINE[7,W1]50,198,60,180,120,180,110,198:BLINE[7,W1]55,190,115,190
2250 D1$=C1$
2260 PRINT"{RIGHT}K: ";D1$;" ﾉ ﾋｽﾞｹ ﾊ,9ｶﾞﾂ 9ｶ,ｽﾅﾜﾁ ｷﾉｳ ﾉ ﾆﾁﾖｳ ﾉ ﾁｮｳｶﾝ ﾀﾞ｡"
2270 PRINT"{RIGHT}O: ｺﾚｶﾞ ﾃｰﾌﾞﾙ ﾆ ﾉｯﾃｲﾀｺﾄｶﾗ, M ﾊ ﾆﾁﾖｳ ﾉ ｱｻﾏﾃﾞ ｲｷﾃｲﾀ ｼｮｳｺ ﾆ ﾅﾙ｡"
2280 GOTO 2170
2290 GOSUB 210:GOSUB 150
2300 IF C2$<>CHR$(188)+CHR$(215)+CHR$(205)+CHR$(222)+CHR$(217)GOTO 2170
2310 D2$=C1$
2320 PRINT"{RIGHT}K: ｺﾉ ";D2$;" ﾉ ﾅｶﾆ ﾅﾆｶ ﾔｸﾌﾞﾂ ｶﾞ ﾊｲｯﾃｲﾅｲｶ ﾄﾞｳｶ,ｼﾗﾍﾞﾀﾎｳｶﾞ ｲｲ｡"
2330 PRINT"{RIGHT}O: ｱﾄﾃﾞ ｶﾝｼｷ ﾆ ﾏﾜｼﾃ ﾌﾞﾝｾｷ ｻｾﾙｺﾄﾆ ｼﾃｲﾙ｡"
2340 GOTO 2170
2350 GOSUB 210:GOSUB 150
2360 IF C2$<>CHR$(188)+CHR$(215)+CHR$(205)+CHR$(222)+CHR$(217)GOTO 2170
2370 D3$=C1$
2380 PRINT"{RIGHT}K: ｺﾉ ";D3$;" ﾆ ｼﾓﾝ ｶﾞ ﾂｲﾃｲﾙ｡ ｼﾗﾍﾞﾀﾎｳｶﾞ ｲｲ｡"
2390 PRINT"{RIGHT}O: ｱﾄﾃﾞ ｶﾝｼｷ ﾆ ﾏﾜｼﾃ ｸﾜｼｸ ﾌﾞﾝｾｷ ｻｾﾙｺﾄﾆ ｼﾃｲﾙ｡"
2400 GOTO 2170
2410 GOSUB 210:GOSUB 150
2420 IF C2$<>CHR$(177)+CHR$(185)+CHR$(217)GOTO 2170
2430 GOTO 2600
2440 REM P-5
2450 GRAPHC7:PRINT"{CLR}":GOSUB 220
2460 LINE[5]50,100,200,100,240,120,90,120,50,100,50,140,90,160,240,160,240,120
2470 LINE[5]90,120,90,160
2480 LINE[7]70,105,195,105,220,115,95,115,70,105
2490 LINE[4]20,110,20,95,25,90,30,90,30,100,25,97,25,110,20,110,1,140
2500 LINE[4]25,110,1,147
2510 LINE[3]50,140,7,140:LINE[3]241,140,318,140
2520 FORJ=0TO2*πSTEP.1
2530 SET[6]20*COS(J)+30,7*SIN(J)+160
2540 SET[2]15*COS(J)+260,10*SIN(J)+180
2550 NEXT
2560 LINE[6]10,160,15,173,45,173,50,160
2570 LINE[2]265,170,300,160,310,162,295,152,290,153,240,166,180,170,120,170,110,180,120,177,170,185,120,190,110,198
2580 LINE[2]265,190,310,186,308,190,305,193,270,198
2590 RETURN
2600 GOSUB 2450
2610 PRINT"{RIGHT}O: ｺｺｶﾞ ﾓﾝﾀﾞｲﾉ ﾊﾞｽﾙｰﾑ ﾀﾞ｡"
2620 PRINT"{RIGHT}{RIGHT}{RIGHT}{RIGHT}ｶﾞｲｼｬ ﾊ ｱﾀﾏ ｶﾗ ﾁ ｦ ﾅｶﾞｼﾃ ｲｷﾀｴﾃｲﾀ｡"
2630 PRINT"{RIGHT}K: M ﾊ ｱﾔﾏｯﾃ ｱｼ ｦ ｽﾍﾞﾗｾ,ﾀｲﾙ ﾉ ﾕｶ ﾆ ﾊｹﾞｼｸ ｱﾀﾏ ｦ ﾌﾞﾂｹﾀﾉﾃﾞﾊ ﾅｲﾃﾞｽｶ ?"
2640 PRINT"{RIGHT}{RIGHT}{RIGHT}{RIGHT}ｿﾉ ｻｲ,ﾃｰﾌﾞﾙ ﾆ ｱｯﾀ ﾌﾞﾗﾝﾃﾞｰ ｦ ﾉﾝﾃﾞ,ﾖｯﾃｲﾀ ﾄﾓ ｶﾝｶﾞｴﾗﾚﾙ｡"
2650 PRINT"{RIGHT}O: ﾜﾚﾜﾚﾀﾞｯﾃ ｿﾚｸﾗｲ ﾉ ｺﾄﾊ ｳﾀｶﾞｯﾃ ﾐﾀﾖ｡"
2660 PRINT"{RIGHT}{RIGHT}{RIGHT}{RIGHT}ｼｶｼ,ｱﾀﾏ ﾉ ｷｽﾞ ｶﾞ ﾁﾒｲｼｮｳ ﾆ ﾅｯﾀﾄﾊ ｵﾓｴﾅｲ｡"
2670 PRINT"{RIGHT}{RIGHT}{RIGHT}{RIGHT}ｿﾉｳｴ,ｼﾀﾞｲ ﾊ ﾄﾞｳﾔﾗ ｳｺﾞｶｻﾚﾀ ｹｲｾｷ ｶﾞ ｱﾙ｡"
2680 PRINT"{RIGHT}{RIGHT}{RIGHT}{RIGHT}ﾂﾏﾘ ﾊﾞｽﾙｰﾑ ﾆ ﾋｷｽﾞｯﾃ ﾊｺﾋﾞｺﾏﾚﾀ ｱﾄ ｶﾞ ｱﾙﾉﾀﾞ｡"
2690 PRINT"{DOWN}{RIGHT}PUSH [CR]"
2700 GET C$:IF C$<>CHR$(13)THEN 2700
2710 GOSUB 150
2720 PRINT"{RIGHT}K: M ﾊ ﾐﾃﾉﾄｳﾘ,ｶﾅﾘ ﾌﾄｯﾃｲﾙ｡ 100ｷﾛ ﾁｶｲ ﾀｲｼﾞｭｳ ﾀﾞ｡"
2730 PRINT"{RIGHT}{RIGHT}{RIGHT}{RIGHT}ﾓｼﾓ ｼﾀﾞｲ ｦ ｳｺﾞｶｼﾀ ﾉｶﾞ ｼﾞｼﾞﾂ ﾅﾗ,ﾊﾝﾆﾝ ﾊ ｵﾄｺ ﾉ ｶﾉｳｾｲ ｶﾞ ﾂﾖｲ｡"
2740 PRINT"{RIGHT}{RIGHT}{RIGHT}{RIGHT}ｵﾝﾅ ﾆﾊ ｳｺﾞｶｽﾉｶﾞ ﾑｽﾞｶｼｲ ﾀﾞﾛｳ｡"
2750 PRINT"{RIGHT}{RIGHT}{RIGHT}{RIGHT}ﾑﾛﾝ ﾊﾝﾆﾝ ｶﾞ ﾋﾄﾘ ﾀﾞﾄ ｶﾃｲ ｼﾀ ﾊﾞｱｲ ﾀﾞｶﾞ｡"
2760 PRINT"{RIGHT}O: ﾀﾞｶﾞ ﾅｾﾞ ﾜｻﾞﾜｻﾞ ﾊﾞｽﾙｰﾑ ﾆ ｼﾀﾞｲ ｦ ﾊｺﾋﾞ ｺﾝﾀﾞﾉｶ ｿﾉ ﾘﾕｳ ｶﾞ ﾜｶﾗﾅｲ｡"
2770 PRINT"{RIGHT}{RIGHT}{RIGHT}{RIGHT}ﾓﾄﾓﾄ M ﾉ ﾍﾔ ｾﾞﾝﾀｲ ｶﾞ ﾐｯｼﾂ ｼﾞｮｳﾀｲ ﾀﾞｯﾀ ﾉﾀﾞ ｶﾗﾅ｡"
2780 PRINT"{RIGHT}K: ｿﾚｶﾞ ｺﾉ ｼﾞｹﾝ ﾉ ｼﾞｭｳﾖｳ ﾅ ｶｷﾞ ﾆ ﾅﾙｶﾓ ｼﾚﾅｲ｡"
2790 GOSUB 200
2800 IF C1$=CHR$(213)+CHR$(204)+CHR$(222)+CHR$(200)GOTO 2850
2810 IF C1$=CHR$(188)+CHR$(172)+CHR$(220)+CHR$(45)GOTO 2930
2820 IF C1$=CHR$(188)+CHR$(192)+CHR$(178)GOTO 2990
2830 IF C1$=CHR$(216)+CHR$(203)+CHR$(222)+CHR$(221)+CHR$(184)+CHR$(222)+CHR$(217)+CHR$(45)+CHR$(209)GOTO 3070
2840 GOSUB 150:GOTO 2790
2850 GOSUB 210
2860 IF C2$<>CHR$(201)+CHR$(191)+CHR$(222)+CHR$(184)GOSUB150:GOTO 2790
2870 GOSUB 150
2880 D5$=C1$
2890 PRINT"{RIGHT}K: ";D5$;" ﾉ ﾅｶﾉ ﾐｽﾞ ﾊ ｽｺｼ ﾀﾞｹ ﾉｺｯﾃｲﾙ｡"
2900 PRINT"{RIGHT}{RIGHT}{RIGHT}{RIGHT}ｼｶﾓ ﾄﾒﾕ ﾉ ﾖｳﾆ ﾖｺﾞﾚﾃﾊ ｲﾅｲ｡ M ﾊ ﾌﾛ ﾆ ﾊｲﾙ ﾏｴﾆ ｺﾛｻﾚﾀ ﾖｳﾀﾞ｡"
2910 PRINT"{RIGHT}{RIGHT}{RIGHT}{RIGHT}ﾅﾝﾄﾅｸ ｷ ﾆ ﾅﾙﾅ｡"
2920 GOTO 2790
2930 GOSUB 210:GOSUB 150
2940 D6$=C1$
2950 PRINT"{RIGHT}K: ";D6$;" ﾉ ﾎｰｽ ﾊ ﾂﾖｸ ｺｽｯﾀ ﾖｳﾅ ｱﾄｶﾞ ｱﾙ｡"
2960 PRINT"{RIGHT}O: ｼﾀﾞｲ ﾉ ｸﾋﾞｽｼﾞ ﾆﾊ ﾋﾓ ﾉ ﾖｳﾅﾓﾉ ﾃﾞ ｼﾒﾗﾚﾀ ｱﾄｶﾞ ｱﾙ｡"
2970 PRINT"{RIGHT}K: ﾄｲｳｺﾄﾊ,ﾊﾝﾆﾝ ﾊ M ｦ ﾊﾞｽﾙｰﾑ ﾆ ﾊｺﾋﾞｺﾝﾀﾞｱﾄ,ﾎｰｽ ﾃﾞ ﾈﾝｲﾘﾆ ｼﾒｺﾛｼﾀ ﾉｶﾓｼﾚﾅｲ｡"
2980 GOTO 2790
2990 GOSUB 210
3000 IF C2$<>CHR$(187)+CHR$(220)+CHR$(217)GOSUB150:GOTO 2790
3010 GOSUB 150
3020 D7$=C1$
3030 PRINT"{RIGHT}K: ｶﾞｳﾝ ｽｶﾞﾀ ﾉ M ﾉ ";D7$;" ﾊ ﾋﾄﾞｸ ｼﾒｯﾎﾟｲ｡"
3040 PRINT"{RIGHT}O: ﾊﾞｽﾙｰﾑ ﾆ ﾖｺﾀﾜｯﾃ ｲﾀﾉﾀﾞｶﾗ ﾄｳｾﾞﾝﾀﾞ｡"
3050 PRINT"{RIGHT}K: ｲﾔ,ﾀﾀﾞ ｿﾚﾀﾞｹ ﾄﾊ ｵﾓﾜﾚﾅｲ｡ ﾊﾝﾆﾝ ｶﾞ ﾜｻﾞﾄ ｿｳﾅﾙﾖｳﾆ ｼｸﾝﾀﾞ ﾉﾃﾞﾊ ﾅｲｶ｡"
3060 GOTO 2790
3070 GOSUB 210
3080 IF C2$<>CHR$(211)+CHR$(196)+CHR$(222)+CHR$(217)GOSUB150:GOTO 2790
3090 GOSUB 1920
3100 REM P-6
3110 GOSUB 200
3120 IF C1$=CHR$(207)+CHR$(196)+CHR$(222)GOTO 3160
3130 IF C1$=CHR$(182)+CHR$(222)+CHR$(184)+CHR$(204)+CHR$(222)+CHR$(193)GOTO 3220
3140 IF C1$=CHR$(188)+CHR$(221)+CHR$(188)+CHR$(194)GOTO 3550
3150 GOSUB 150:GOTO 3110
3160 GOSUB 210:GOSUB 150
3170 IF C2$<>CHR$(188)+CHR$(215)+CHR$(205)+CHR$(222)+CHR$(217)GOTO 3110
3180 D8$=C1$
3190 PRINT"{RIGHT}K: ｹｲﾌﾞ,ｻｯｼ";D8$;" ﾉ ﾌﾚｰﾑ ﾆ ｱｶｲ ｶﾐﾉｹ ｶﾞ ﾌﾁｬｸ ｼﾃｲﾙ｡"
3200 PRINT"{RIGHT}O: ﾌﾑ, ｺﾚﾊ ﾅﾆｶ ﾉ ｷﾁｮｳﾅ ﾃｶﾞｶﾘ ﾆ ﾅﾙｶﾓｼﾚﾅ｡"
3210 GOTO 3110
3220 GOSUB 210:GOSUB 150
3230 IF C2$<>CHR$(188)+CHR$(215)+CHR$(205)+CHR$(222)+CHR$(217)GOTO 3110
3240 REM P-7
3250 BLINE[2,W1]215,95,235,95,235,125,215,125,215,95
3260 BLINE[7,W1]218,98,228,108,220,110,232,122
3270 FORJ=0TO2*πSTEP.1
3280 SET[5] 7*COS(J)+225,7*SIN(J)+110
3290 SET[1] 4*COS(J)+225,4*SIN(J)+110
3300 NEXT
3310 D9$=C1$
3320 PRINT"{RIGHT}K: ｹｲﾌﾞ,ｺﾚﾊ ｶｸｼ ｷﾝｺ ﾉ ﾖｳﾃﾞｽﾈ｡"
3330 PRINT"{RIGHT}O: ﾌﾑ, ｺﾉﾅｶﾆ ﾅﾆｶﾞ ｼﾏｯﾃｱﾙﾉｶ ｻｸﾞｯﾃ ﾐﾖｳ｡"
3340 PRINT"{RIGHT}K: ｼｶｼ ﾀﾞｲﾔﾙ ﾉ ｱﾝｼｮｳ ﾊﾞﾝｺﾞｳ ｶﾞ ﾜｶﾗﾅｹﾚﾊﾞ ｱｷﾏｾﾝﾖ｡"
3350 PRINT"{RIGHT}O: ﾃﾞﾊ ｽｸﾞﾆ ｷﾝｺ ｦ ｺｼﾗｴﾀ ﾒｰｶｰ ｦ ﾖﾝﾃﾞｺﾖｳ｡"
3360 PRINT"{RIGHT}K: ｲｯﾀｲ M ｦ ｻﾂｶﾞｲ ｼﾀ ﾊﾝﾆﾝ ﾉ ﾒｱﾃ ﾊ ﾅﾝﾀﾞｯﾀﾝﾃﾞｽｶ｡"
3370 PRINT"{RIGHT}{RIGHT}{RIGHT}{RIGHT}ｶﾈﾒ ﾉ ﾓﾉ ｶﾞ ｺﾞｯｿﾘ ｳﾊﾞﾜﾚﾃｲﾙ ﾅﾗ ﾓﾉﾄﾘ ﾉ ﾊﾝｺｳ ﾄ ﾐﾅｻﾚﾙ｡"
3380 GOSUB 200
3390 IF C1$<>CHR$(183)+CHR$(221)+CHR$(186)GOSUB 150:GOTO 3380
3400 GOSUB 210:GOSUB 150
3410 IF C2$<>CHR$(177)+CHR$(185)+CHR$(217)GOTO 3380
3430 FORJ=0TO2*πSTEP.1
3440 RESET[5,W1]7*COS(J)+225,7*SIN(J)+110
3450 RESET[1,W1]4*COS(J)+225,4*SIN(J)+110
3460 NEXT
3470 LINE[6]215,95,235,95,235,125,215,125,215,95:LINE[1]216,115,234,115
3480 LINE[7]220,114,220,105,230,105,230,114
3490 E2$=C1$
3500 PRINT"{RIGHT}O: ﾔｯﾄ ";E2$;" ｶﾞ ｱｲﾀｿﾞ｡"
3510 PRINT"{RIGHT}{RIGHT}{RIGHT}{RIGHT}ﾅｶﾆﾊ 50ﾏﾝｴﾝ ﾎﾄﾞﾉ ｹﾞﾝｷﾝ ｶﾞ ﾊｲｯﾃｲﾃ,ｱﾗｻﾚﾀ ｹｲｾｷ ﾊ ﾐｱﾀﾗﾅｲ｡"
3520 PRINT"{RIGHT}K: ｽﾙﾄ ﾊﾝﾆﾝ ﾊ ﾓﾉﾄﾘ ｶﾞ ﾓｸﾃｷ ﾃﾞﾊ ﾅｶｯﾀ｡"
3530 PRINT"{RIGHT}{RIGHT}{RIGHT}{RIGHT}ｿﾚﾄﾓ ﾊﾝﾆﾝ ﾊ ｺﾉ ｶｸｼ ｷﾝｺ ｦ ｼﾗﾅｶｯﾀ ﾉｶ｡"
3540 GOTO 3110
3550 GOSUB 210:GOSUB 150
3560 IF C2$<>CHR$(202)+CHR$(178)+CHR$(217)GOTO 3110
3570 GOTO 3810
3580 REM P-8
3590 GRAPHC7:PRINT"{CLR}":GOSUB 220
3600 LINE[1]120,160,120,115,125,110,225,110,230,115,230,135,310,170,315,175,315,195,200,195,120,160
3610 LINE[2]128,113,128,140,200,175,200,195
3620 LINE[2]130,163,130,140,232,140:LINE[2]200,175,310,175
3630 LINE[4]165,139,160,125,165,120,195,120,200,125,205,139
3640 LINE[5]40,110,90,110,90,135,105,150,100,155,30,155,25,150,40,135,40,110
3650 FORI=0TO1:LINE[1]45,113+25*I,85,113+25*I:NEXT
3660 LINE[1]45,113,45,138
3670 FORI=0TO2:LINE[1]71+7*I,113,71+7*I,138:NEXT
3680 FORI=0TO3:LINE[6]37,143+3*I,92,143+3*I:NEXT
3690 FORI=0TO11:LINE[6]37+5*I,143,37+5*I,152:NEXT
3700 LINE[4]3,125,7,120,20,120,23,125,23,155,3,155,3,125:LINE[4]3,125,23,125
3710 FORI=0TO1
3720 LINE[5]10+10*I,125,10+10*I,155:LINE[5]10+10*I,135,5+10*I,135,5+10*I,150,10+10*I,150:NEXT
3730 LINE[7]23,135,40,135
3740 LINE[7]90,135,94,135,124,165,1,165
3750 FORI=0TO1:LINE[7]5+90*I,165,5+90*I,195,10+90*I,195,10+90*I,165:NEXT
3760 LINE[5]10,185,52,185,52,165
3770 LINE[4]25,170,40,170,40,175,25,175,25,170
3780 LINE[4]65,170,80,170,80,175,65,175,65,170
3790 LINE[5]53,185,94,185
3800 RETURN
3810 GOSUB 3580
3820 PRINT"{RIGHT}O: ｺｺｶﾞ M ﾉ ｼﾝｼﾂ ﾀﾞ｡"
3830 PRINT"{RIGHT}K: ｻｽｶﾞﾊ ｺﾝﾋﾟｭｰﾀ ｶﾞｲｼｬ ﾉ ｼｬﾁｮｳ ﾀﾞｹｱｯﾃ,ﾍﾞｯﾄﾞ ﾉ ｿﾊﾞﾆﾏﾃﾞ ﾏｲｺﾝ ｦ ﾖｳｲｼﾃ,"
3840 PRINT"{RIGHT}{RIGHT}{RIGHT}{RIGHT}ｱｻｶﾗ ﾊﾞﾝﾏﾃﾞ,ﾃﾞｰﾀ ｦ ｿｳｻ ｼﾃｲﾀ ﾖｳﾀﾞ｡"
3850 PRINT"{RIGHT}O: ｼﾂﾅｲ ﾊ ｷﾁﾝﾄ ｼﾃｲﾃ ﾄｸﾆ ﾌﾞｯｼｮｸ ｻﾚﾀ ﾖｳｽ ﾊ ﾅｲ｡"
3860 GOSUB 200
3870 IF C1$=CHR$(207)+CHR$(184)+CHR$(215)GOTO 3920
3880 IF C1$=CHR$(203)+CHR$(183)+CHR$(192)+CHR$(222)+CHR$(188)GOTO 4010
3890 IF C1$=CHR$(207)+CHR$(178)+CHR$(186)+CHR$(221)GOTO 4130
3900 IF C1$=CHR$(188)+CHR$(221)+CHR$(188)+CHR$(194)GOTO 4670
3910 GOSUB 150:GOTO 3860
3920 GOSUB 210:GOSUB 150
3930 IF C2$<>CHR$(196)+CHR$(217)GOTO 3860
3940 BLINE[4,W1]165,139,160,125,165,120,195,120,200,125,205,139
3950 LINE[6]180,139,180,130,187,130,187,139:LINE[6]180,135,187,135
3960 E3$=C1$
3970 PRINT"{RIGHT}K: ｹｲﾌﾞ,";E3$;" ﾉ ｼﾀﾆ ｺﾝﾅﾓﾉｶﾞ..."
3980 PRINT"{RIGHT}O: ﾗｲﾀｰ ﾀﾞﾅ｡ ｵﾓﾃ ﾆ ｲﾆｼｬﾙ ｶﾞ ｼﾙｻﾚﾃｲﾙ｡ ｢N.Y｣ ﾀﾞｿﾞ｡"
3990 PRINT"{RIGHT}K: ﾋｶﾞｲｼｬ ﾉ M ﾉ ｲﾆｼｬﾙ ﾃﾞﾊ ｱﾘﾏｾﾝﾈ｡"
4000 GOTO 3860
4010 GOSUB 210:GOSUB 150
4020 IF C2$<>CHR$(187)+CHR$(182)+CHR$(222)+CHR$(189)GOTO 3860
4022 BLINE[4,W1]65,170,80,170,80,175,65,175,65,170
4024 BLINE[5,W1]53,185,94,185
4030 LINE[4]65,185,80,185,80,190,65,190,65,185
4040 LINE[5]60,165,52,180,95,180
4050 LINE[5]52,185,52,196,95,196,95,180
4060 E4$=C1$
4070 PRINT"{RIGHT}O: ﾌﾑ,";E4$;" ﾉ ﾅｶｶﾗ ｢ｺﾞｸﾋ｣ ﾄ ｶｶﾚﾀ ﾌｳﾄｳ ｶﾞ ﾐﾂｶｯﾀ｡"
4080 PRINT"{RIGHT}K: ﾊｲｯﾃ ｲﾙﾉﾊ,ｲﾁﾏｲ ﾉ ﾌﾛｯﾋﾟｰ ﾃﾞｽﾖ｡"
4090 PRINT"{RIGHT}O: ｺﾉﾅｶﾆ ﾊﾝﾆﾝ ﾉ ﾃｶﾞｶﾘ ﾆ ﾅﾙﾖｳﾅ ﾀﾞｲｲﾝｸﾞ ﾒｯｾｰｼﾞ ﾃﾞﾓ ｱﾚﾊﾞ ﾀｽｶﾙﾉﾀﾞｶﾞ｡"
4100 PRINT"{RIGHT}K: ﾄﾆｶｸ ｺﾚｦ ﾏｲｺﾝ ﾆ ﾊｼﾗｾﾃ ﾐﾏｼｮｳ｡"
4110 PRINT"{RIGHT}O: ﾄﾞｳﾔﾚﾊﾞ ｲｲﾉｶ ﾜｼﾆﾊ ﾏｲｺﾝ ﾅﾄﾞ ｻｯﾊﾟﾘ ﾜｶﾗﾝ｡"
4120 GOTO 3860
4130 GOSUB 210:GOSUB 150
4140 IF E4$<>CHR$(203)+CHR$(183)+CHR$(192)+CHR$(222)+CHR$(188)GOTO 3860
4150 E5$=C1$
4160 PRINT"{RIGHT}K: ﾌﾛｯﾋﾟｰ ﾉ ﾌﾟﾛｸﾞﾗﾑ ｦ ";E5$;" ﾆ LOAD ﾃﾞｷﾏｼﾀ｡"
4170 PRINT"{RIGHT}O: ﾂｷﾞ ﾊ ﾄﾞｳｽﾘｬ ｲｲﾝｼﾞｬ ?"
4180 PRINT"{RIGHT}K: ﾄﾘｱｴｽﾞ RUN ｻｾﾃ ﾐﾏｼｮｳ｡"
4190 PRINT"{DOWN}{RIGHT}PUSH [CR]"
4200 GET C$: IF C$<>CHR$(13)THEN 4200
4205 REM P-9
4210 GRAPHC7:PRINT"{CLR}":GOSUB 220
4220 LINE[5]1,150,5,145,10,140,15,130,130,130:LINE[5]15,130,15,190,31,198
4230 LINE[5]1,185,15,190,130,190,146,198
4240 FORI=0TO2:LINE[1]110+10*I,130,110+10*I,190:NEXT
4250 LINE[3]20,140,100,140,100,170,20,170
4260 LINE[3]20,170,20,160,22,158,23,156,23,153,22,152,20,150,20,140
4270 LINE[3]20,168,100,168
4280 CURSOR 0,19:PRINT"{RIGHT}{RIGHT}{RIGHT}{RIGHT}{RIGHT}{RIGHT}{RIGHT}{RIGHT}{RIGHT}{RIGHT}LSI  M80-CPU"
4290 CURSOR 0,20:PRINT"{RIGHT}{RIGHT}{RIGHT}{RIGHT}{RIGHT}{RIGHT}{RIGHT}{BLK}"
4300 CURSOR 0,21:PRINT"{RIGHT}{RIGHT}{RIGHT}{RIGHT}{RIGHT}VVVVVVVVVVVVVVVVVVV{BLK}"
4310 LINE[1]265,155,268,110,260,105,220,105,210,110,213,115,245,115,248,155
4320 LINE[3]217,116,217,125,210,133,215,138,215,148,220,153,230,153,230,160
4330 LINE[6]220,121,230,121:LINE[6]220,125,225,125
4340 LINE[6]215,142,225,142
4350 LINE[7]265,160,230,160,240,155,265,155,270,160,288,170,300,199
4360 LINE[7]230,160,200,170,186,199:LINE[7]200,171,208,199
4370 LINE[7]215,170,240,170:LINE[7]260,170,280,170:LINE[7]248,165,260,199
4372 PAINT[4]200,190,7:PAINT[4]290,190,7
4380 PRINT"{RIGHT}{RIGHT}{RIGHT}{RIGHT}{RIGHT}{RIGHT}{RIGHT}{RIGHT}{RIGHT}{RIGHT}{RIGHT}< Micro-hard ｺﾞｸﾋ ｼﾞｮｳﾎｳ >"
4390 PRINT"{DOWN}{RIGHT}ｺﾉ M80-CPU ﾊ ﾜｶﾞｼｬ ｶﾞ ﾄﾞｸｼﾞ ﾆ ｶｲﾊﾂ ｼﾀ,40 DIP ﾀｲﾌﾟ ﾉ LSI ﾃﾞｱﾙ｡"
4400 PRINT"{RIGHT}ﾛｼﾞｯｸ ｶｲﾛ ﾉ ｱｰｷﾃｸﾁｬｰ ﾊ,ﾊｰﾄﾞ ｴﾝｼﾞﾆｱｰ ﾉ N.Y ｦ ﾄﾞｳﾘｮｳ ﾉ ﾀﾏﾓﾉ ﾃﾞｱﾙ｡"
4410 PRINT"{RIGHT}ｶﾚ ﾉ ｺｳｾｷ ﾊ ﾐﾄﾒﾙｶﾞ,ｻｲｷﾝ ｶﾚ ﾉ ｿﾞｳﾊﾝ ｼ,ｽﾋﾟﾝｵﾌ ｦ ﾉｿﾞﾝﾃﾞ ｲﾙ｡"
4420 PRINT"{RIGHT}ｿｳﾅﾚﾊﾞ ﾀｼｬ ﾆ ｿﾉ ｱｰｷﾃｸﾁｬｰ ｶﾞ ﾘｭｳｼﾞﾂ ｽﾙ ｷｹﾝ ｶﾞ ﾀﾞｲ ﾃﾞｱﾙ｡"
4430 PRINT"{RIGHT}ｿｺﾃﾞ,ﾜｼ ﾊ ｶｲﾛ ｾｯｹｲｽﾞ ｦ ｺﾞｸﾋ ﾆ ﾎｶﾝ ｻｾﾙｺﾄ ﾆ ｷﾒﾀ｡"
4440 PRINT"{RIGHT}ｺﾉｺﾄ ｦ ｼｯﾃ,ｾｯｹｲｼｬ ﾉ N.Y ﾊ ﾜｼ ｦ ｳﾗﾝﾃﾞ ｲﾙﾖｳﾀﾞ｡"
4450 PRINT"{DOWN}{RIGHT}PUSH [CR]"
4460 GET C$: IF C$<>CHR$(13)THEN 4460
4470 GOSUB 150
4480 PRINT"{DOWN}{RIGHT}ｺﾉ M80-CPU ﾁｯﾌﾟ ﾊ ﾜｶﾞｼｬ ﾉ ﾋｯﾄ ｼｮｳﾋﾝ ﾆ ﾅﾙﾆﾁｶﾞｲﾅｲ｡"
4490 PRINT"{RIGHT}IC ｺﾝﾄﾛｰﾗ ﾉﾄｷﾊ,ｽﾊﾟｲ ｺｳｲﾃﾞ ﾀｼｬ ﾉ ﾓﾉｦ ｺﾋﾟｰ ｼﾀﾄ,ｻﾝｻﾞﾝ ﾀﾀｶﾚﾀｶﾞ,"
4500 PRINT"{RIGHT}ｺﾉ ﾁｯﾌﾟ ﾊ ﾏｷﾞﾚﾓﾅｸ ﾜｶﾞｼｬ ﾉ ｵﾘｼﾞﾅﾙ ﾀﾞ｡"
4510 PRINT"{RIGHT}ｿﾉ ｱｰｷﾃｸﾁｬｰ ｦ ﾀｼｬ ﾆ ｳﾊﾞﾜﾚﾙｺﾄﾊ ﾀﾞﾝｺﾄｼﾃ ｿｼ ｼﾅｹﾚﾊﾞ ﾅﾗﾅｲ｡"
4520 PRINT"{RIGHT}ｳﾜｻ ﾃﾞﾊ,ﾗｲﾊﾞﾙ ﾒｰｶｰ ﾉ UNIT1ｼｬ ｶﾞ N.Y ｦ ﾋｷｦｺｳﾄ ｼﾃｲﾙﾗｼｲ｡"
4530 PRINT"{RIGHT}N.Y ﾉ ｶｲｼﾞｭｳｻｸ ﾉ ﾀﾒﾆﾊ ﾜｼ ﾉ ﾑｽﾒ ｦ ｶﾚ ﾆ ｸﾚﾃﾔｯﾃﾓ ﾖｲ｡"
4540 PRINT"{RIGHT}ｼｶｼ ｿﾉｺﾄﾃﾞ ﾜｼ ﾊ ﾂﾏ ﾄ ﾊｹﾞｼｸ ｲｲｱﾗｿｳ ﾊﾒﾆ ﾅｯﾀ｡"
4550 PRINT"{DOWN}{RIGHT}PUSH [CR]"
4560 GET C$: IF C$<>CHR$(13)THEN 4560
4570 GOSUB 150
4580 PRINT"{DOWN}{RIGHT}ｺﾉ ﾅｲﾌﾞ ｼﾞｼﾞｮｳ ﾊ ﾏﾀﾞ ﾀﾞﾚﾆﾓ ｼﾗﾚﾃ ｲﾅｲｶﾞ,ｷﾞｼﾞｭﾂﾌﾞ ﾉ I.F ｶﾞ ｼｷﾘﾄ"
4590 PRINT"{RIGHT}ﾜｼ ﾆ ﾌｲﾁｮｳ ｼﾃｲﾙ｡ I.F ﾊ ｷﾞｼﾞｭﾂﾒﾝ ﾃﾞ N.Y ﾉ ﾗｲﾊﾞﾙ ﾃﾞｱﾙ｡"
4600 PRINT"{RIGHT}ｼｶｼ,M80-CPU ﾉ ｶｲﾊﾂ ﾃﾞﾊ N.Y ﾆ ｲｯﾎﾟ ｵｸﾚｦ ﾄﾘ,ﾅﾆｶﾄ ｳﾗﾔﾝﾃﾞｲﾙ｡"
4610 PRINT"{RIGHT}ｲｶﾆ ｺﾝﾋﾟｭｰﾀ ｷﾞｼﾞｭﾂ ｶﾞ ﾊｯﾀﾂ ｼﾃﾓ,ﾆﾝｹﾞﾝ ｶﾝｹｲ ﾉ ﾑｽﾞｶｼｻ ﾊ ｱｲｶﾜﾗｽﾞ ﾀﾞ｡"
4620 PRINT"{RIGHT}ｼｬﾁｮｳ ﾉ ﾜｼﾄｼﾃ,20ﾈﾝ ﾂﾚｿｯﾀ ﾂﾏ ﾄ ｳﾏｸｲｶｽﾞ,ｲﾏﾊ ｺｳｼﾃ ﾍﾞｯｷｮﾁｭｳ ﾅﾉﾀﾞ｡"
4630 PRINT"{RIGHT}ｼﾝｿｺ ｼﾝﾖｳ ﾉ ｵｹﾙ ﾔﾂ ﾊ ﾋﾄﾘﾓ ｲﾅｲ｡"
4640 PRINT"{DOWN}{RIGHT}PUSH [CR]"
4650 GET C$: IF C$<>CHR$(13)THEN 4650
4660 GOSUB 3580:GOTO 3860
4670 GOSUB 210:GOSUB 150
4680 IF C2$<>CHR$(195)+CHR$(222)+CHR$(217)GOTO 3860
4690 GOSUB 1560
4700 PRINT"{RIGHT}O: ｺﾚﾃﾞ ﾊﾝｺｳｹﾞﾝﾊﾞ ﾉ ﾁｮｳｻ ﾊ ﾋﾄﾄｵﾘ ｵﾜｯﾀ｡"
4710 PRINT"{RIGHT}K: ｺﾏｶﾅ ﾃﾝ ﾃﾞﾊ ﾏﾀﾞ ｼﾗﾍﾞ ﾀﾘﾅｲ ｺﾄﾓ ｱﾙｶﾞ,ｹｲｻﾂ ﾃﾞﾊ ﾊﾔｸ ﾖｳｷﾞｼｬ ｦ ｼﾎﾞﾘﾀｲ"
4720 PRINT"{RIGHT}{RIGHT}{RIGHT}{RIGHT}ﾉｶﾞ ﾎﾝﾈ ﾃﾞｼｮｳ｡ ｿﾉﾏｴﾆ M ﾉ ｼﾎﾞｳｽｲﾃｲ ｼﾞｺｸ ｦ ﾜﾘﾀﾞｽ ﾉｶﾞ ｶﾝｼﾞﾝ ﾃﾞｽ｡"
4730 PRINT"{RIGHT}O: ｿﾚﾊ ｹｲｻﾂｲ ｶﾞ ｲｽﾞﾚ ﾊﾝﾃｲ ｼﾃｸﾚﾙ ﾀﾞﾛｳ｡"
4740 IF D1$<>CHR$(188)+CHR$(221)+CHR$(204)+CHR$(222)+CHR$(221)GOTO 4780
4750 PRINT"{RIGHT}K: ﾃｰﾌﾞﾙ ﾉ ｳｴﾆ 9ｶ ﾆﾁﾖｳﾋﾞ ﾉ ";D1$;" ｶﾞ ﾉｯﾃ ｲﾏｼﾀﾈ｡"
4760 PRINT"{RIGHT}O: ﾌﾑ,M ｶﾞ ｱﾚｦ ﾖﾝﾀﾞﾄｽﾚﾊﾞ,9ｶ ｱｻﾏﾃﾞ ﾊ ﾋﾟﾝﾋﾟﾝ ｼﾃｲﾀ ｺﾄﾆﾅﾙ｡"
4770 PRINT"{RIGHT}K: ﾑﾛﾝ ﾊﾝﾆﾝ ｶﾞ ﾜｻﾞﾄ ﾃｰﾌﾞﾙ ﾆ ﾉｾﾃ ｻｲｸ ｼﾀﾉﾃﾞ ﾅｹﾚﾊﾞ ﾃﾞｽｶﾞ｡"
4780 PRINT"{DOWN}{RIGHT}PUSH [CR]"
4790 GET C$: IF C$<>CHR$(13)THEN 4790
4800 GOSUB 150
4810 PRINT"{RIGHT}K: M ｶﾞ ｲｷﾃｲﾙ ﾉｦ ｻｲｺﾞ ﾆ ﾓｸｹﾞｷ ｼﾀﾉﾊ ﾀﾞﾚｶ ｦ ｼﾗﾍﾞﾃ ｸﾀﾞｻｲ｡"
4820 PRINT"{RIGHT}O: ｿﾉﾂﾓﾘﾃﾞ,ﾌﾞｶ ｦ ｷﾝｼﾞｮ ﾆ ﾊｹﾝｼﾃ ｷｷｺﾐ ﾆ ｱﾀﾗｾﾃｲﾙ｡"
4830 IF E2$<>CHR$(183)+CHR$(221)+CHR$(186)GOTO 4860
4840 PRINT"{RIGHT}K: ｼﾀﾞｲ ｦ ﾌﾞｯｼｮｸ ｼﾀﾘ,";E2$;" ｶﾞ ｱﾗｻﾚﾀ ﾖｳｽｶﾞ ﾅｲｺﾄｶﾗ,ｶｵﾐｼﾘ ﾉ ﾊﾝｺｳ ﾆ ﾏﾁｶﾞｲﾅｲ｡"
4850 PRINT"{RIGHT}O: ｿﾉｳｴ,ｹﾞﾝﾊﾞ ﾊ ﾐｯｼﾂ ﾆ ﾅｯﾃｲﾀ｡ ｽﾅﾜﾁ,ｱｲｶｷﾞ ｦ ﾃﾆ ｲﾚﾙｺﾄｶﾞ ﾃﾞｷﾀ ﾓﾉﾉ ｼﾜｻﾞﾀﾞ｡"
4860 PRINT"{DOWN}{RIGHT}PUSH [CR]"
4870 GET C$: IF C$<>CHR$(13)THEN 4870
4880 GOSUB 150
4890 PRINT"{RIGHT}K: M ﾆﾊ ｵｸｻﾝ ﾆ ﾅｲｼｮ ﾃﾞ ｵﾝﾅ ｶﾞ ｲﾀﾝｼﾞｬ ﾅｲﾃﾞｼｮｳｶ ?"
4900 PRINT"{RIGHT}O: ﾅｾﾞ ｿｳ ｵﾓｳﾝﾀﾞ ?"
4910 IF D8$<>CHR$(207)+CHR$(196)+CHR$(222)GOTO 4940
4920 PRINT"{RIGHT}K: ｱﾉ ";D8$;" ﾆ ｸｯﾂｲﾃｲﾀ ｱｶｲ ｶﾐﾉｹ ﾊ ｵﾝﾅ ﾉ ｿﾒｶﾞﾐ ﾃﾞｽﾖ｡"
4930 PRINT"{RIGHT}{RIGHT}{RIGHT}{RIGHT}ｿﾉ ｹﾂｴｷｶﾞﾀ ｦ ｼﾗﾍﾞﾚﾊﾞ ｵｸｻﾝﾉ ｶﾐﾉｹ ｶ ｲﾅｶ ﾊ ﾊｯｷﾘｽﾙ｡"
4940 PRINT"{RIGHT}K: ｼﾝｿｳ ﾊ ﾏﾀﾞ ﾜｶﾗﾅｲｶﾞ..."
4950 PRINT"{DOWN}{RIGHT}PUSH [CR]"
4960 GET C$: IF C$<>CHR$(13)THEN 4960
4970 REM P-10
4980 GRAPHC7:PRINT"{CLR}":GOSUB 220
4990 CIRCLE[7]100,150,13,1.1
5000 CIRCLE[7]200,150,13,1.1
5020 LINE[1]93,161,70,188,70,198:LINE[1]108,161,120,180,150,185
5030 LINE[6]65,198,65,185,70,185,70,198:LINE[1]110,185,96,198
5040 LINE[4]110,185,185,185,185,190,110,190,110,185
5050 LINE[4]125,190,125,198:LINE[4]170,190,170,198
5060 LINE[2]193,161,185,188,185,198:LINE[2]208,161,220,180,225,198
5070 LINE[6]225,198,225,185,230,185,230,198
5080 LINE[2]200,178,190,198:LINE[2]215,180,205,198
5090 FORI=0TO2
5100 LINE[5]110,100+15*I,190,100+15*I
5110 LINE[5]110+40*I,100,110+40*I,130
5120 NEXT
5130 PRINT"{RIGHT}{RIGHT}{RIGHT}{RIGHT}{RIGHT}{RIGHT}{RIGHT}{RIGHT}{RIGHT}{RIGHT}{RIGHT}< ﾖｳｷﾞｼｬ ﾉ ﾄﾘｼﾗﾍﾞ >"
5140 PRINT"{DOWN}{RIGHT}ｹｲｼﾁｮｳ 80ﾏｶﾞﾘｼﾞｮ ﾆﾊ ｢ Mｼｬﾁｮｳ ｻﾂｶﾞｲｼﾞｹﾝ ｿｳｻﾎﾝﾌﾞ ｣ ｶﾞ ｾｯﾁｻﾚﾀ｡"
5150 PRINT"{RIGHT}ｺﾚﾏﾃﾞ ﾉ ｿｳｻ ﾃﾞ ﾊﾝﾒｲ ｼﾀ ｼﾞｼﾞﾂ ｦ ｸﾜｼｸ ﾉﾍﾞﾃ ｵｺｳ｡"
5160 PRINT"{RIGHT}ｹﾝｼ ﾉ ｹｯｶ M ﾉ ｼﾎﾞｳｽｲﾃｲ ﾊ 9ｶﾞﾂ 9ｶ ｺﾞｾﾞﾝ 9ｼﾞ ｶﾗ 10ｼﾞ ﾄｻﾚﾀ｡"
5170 PRINT"{RIGHT}ﾁｮｸｾﾂﾃｷﾅ ｼｮｳｺ ﾊ ﾅｲｶﾞ,ｼﾀﾞｲ ﾉ ｼﾞｮｳｷｮｳ ﾔ ｺｳﾁｮｸ ﾉ ｽｽﾐｸﾞｱｲ ｶﾗ ｿｳ ﾊﾝﾀﾞﾝ ｻﾚﾀ｡"
5180 PRINT"{RIGHT}ﾀﾀﾞｼ,ｷｷｺﾐ ﾆ ﾖﾙﾄ,8ｶ ｺﾞｺﾞ 11ｼﾞ ｲｺﾞ ﾆ M ﾆ ｱｯﾀ ﾓﾉ ﾊ ﾀﾞﾚﾓ ｲﾅｲ｡"
5190 PRINT"{RIGHT}M ﾉ ｼｲﾝ ﾊ,ﾄｳﾌﾞ ﾉ ｷｽﾞ ﾃﾞﾊﾅｸ,ｸﾋﾞ ｦ ｼﾒﾗﾚﾃ,ﾁｯｿｸｼ ﾃﾞｱﾙ｡"
5200 PRINT"{DOWN}{RIGHT}PUSH [CR]"
5210 GET C$: IF C$<>CHR$(13)THEN 5210
5220 GOSUB 150
5230 PRINT"{DOWN}{RIGHT}ﾂﾏ ﾄ ﾍﾞｯｷｮﾁｭｳ ﾉ M ﾆﾊ,U(ﾕｳｺ)ﾄｲｳ,ﾓﾄ ﾋｼｮ ｦｼﾃｲﾀ ﾜｶｲ ｱｲｼﾞﾝ ｶﾞ ｲﾀ｡"
5240 PRINT"{RIGHT}ﾂﾏ ﾉ A(ｴｲｺ) ﾊ ｿﾚｦ ｳｽｳｽ ｶﾝﾂﾞｲﾃ ｲﾀﾖｳﾀﾞ｡"
5250 PRINT"{RIGHT}ｽﾅﾜﾁ,A ﾆﾓ ｵｯﾄ ｦ ｻﾂｶﾞｲｽﾙ ﾄﾞｳｷ ｶﾞ ｱｯﾀ｡"
5260 PRINT"{RIGHT}ｼｶｼ,M ﾊ 100ｷﾛ ﾉ ｷｮｶﾝ ﾃﾞｱﾘ,ｵﾝﾅ ｶﾞ ﾋﾄﾘﾃﾞ M ｦ ﾌﾛﾊﾞ ﾆ ﾊｺﾝﾃﾞ ｼﾒｺﾛｼﾀ ﾄﾊ"
5270 PRINT"{RIGHT}ｵﾖｿ ｶﾝｶﾞｴﾗﾚﾅｲ｡ ｺﾚﾊ ｱｲｼﾞﾝ ﾉ U ﾆﾓ ｱﾃﾊﾏﾙ ｺﾄﾃﾞｱﾙ｡"
5280 PRINT"{RIGHT}ﾁｮｸｾﾂ ﾃ ｦ ｸﾀﾞｼﾀ ﾉﾊ ｵﾄｺﾃﾞｱﾙ,ﾄｲｳﾉｶﾞ ｿｳｻﾎﾝﾌﾞ ﾉ ｲｯﾁｼﾀ ﾐｶﾀﾃﾞｱﾙ｡"
5290 PRINT"{DOWN}{RIGHT}PUSH [CR]"
5300 GET C$: IF C$<>CHR$(13)THEN 5300
5310 GOSUB 150
5320 PRINT"{RIGHT}Oｹｲﾌﾞ ﾊ ｻｲｼｮﾆ,ｼﾞｭｳﾖｳ ｻﾝｺｳﾆﾝ ﾄｼﾃ,ｴﾝｼﾞﾆｱｰ ﾉ N.Y ｦ ﾄﾘｼﾗﾍﾞﾙ ｺﾄﾆｼﾀ｡"
5330 PRINT"{DOWN}{RIGHT}O: M ﾉ ｼﾎﾞｳｽｲﾃｲｼﾞｺｸ ﾉ 9ｶ ｺﾞｾﾞﾝ 9ｼﾞ ｶﾗ 10ｼﾞ ﾏﾃﾞﾉ ｱﾘﾊﾞｲ ｦ ｷｷﾀｲ｡"
5340 PRINT"{RIGHT}Y: ｿﾉﾋﾊ ﾆﾁﾖｳ ﾀﾞｶﾗ,ﾋﾙｺﾞﾛ ﾏﾃﾞ ﾉﾝﾋﾞﾘ ﾈﾃｲﾏｼﾀ｡"
5350 PRINT"{RIGHT}O: ｿﾚｶﾞ ｲﾂﾜﾘ ﾃﾞﾅｲｺﾄｦ ﾀﾞﾚｶ ｼｮｳｹﾞﾝ ｼﾃｸﾚﾙ ﾓﾉﾊ ｲﾙｶ ?"
5360 PRINT"{RIGHT}Y: ｼﾞﾌﾞﾝ ﾊ ﾏﾀﾞ ｱﾊﾟｰﾄ ﾃﾞ ﾋﾄﾘｸﾞﾗｼ ﾀﾞｶﾗ,ｿﾝﾅｺﾄﾊ ﾑﾘﾀﾞ｡"
5370 PRINT"{RIGHT}O: ﾂﾏﾘ ｱﾘﾊﾞｲ ﾊ ﾅｲﾓ ﾄﾞｳｾﾞﾝ ﾅﾉﾀﾞﾅ｡"
5380 PRINT"{DOWN}{RIGHT}PUSH [CR]"
5390 GET C$: IF C$<>CHR$(13)THEN 5390
5400 GOSUB 150
5410 PRINT"{RIGHT}Y: ﾎﾞｸ ｶﾞ ﾅｾﾞ,ｼｬﾁｮｳ ｦ ｱﾝﾅ ﾑｺﾞｲ ﾒﾆ ｱﾜｾﾅｹﾚﾊﾞ ｲｹﾅｲﾝﾃﾞｽｶ ?"
5420 PRINT"{RIGHT}{RIGHT}{RIGHT}{RIGHT}ﾎﾞｸ ﾊ ﾅﾆﾓ ﾔｯﾃｲﾅｲ｡ ﾑｼﾞﾂ ﾃﾞｽ｡"
5430 PRINT"{RIGHT}O: ﾑｼﾞﾂ ｶ ﾄﾞｳｶ ﾊ ｼﾗﾍﾞ ｶﾞ ｽｽﾒﾊﾞ,ｵﾉｽﾞｶﾗ ﾜｶﾙ｡"
5440 PRINT"{RIGHT}{RIGHT}{RIGHT}{RIGHT}ｷﾐ ﾊ ｸﾛｳｼﾃ ｶｲﾊﾂ ｼﾀ M80-CPU ｦ ｼｬﾁｮｳ ｶﾞ ｺﾞｸﾋ ﾆ ｶﾝﾘ ｽﾙﾄ ｼｯﾃ ｳﾗﾝﾃﾞｲﾀ ｿｳﾀﾞﾅ｡"
5450 PRINT"{RIGHT}{RIGHT}{RIGHT}{RIGHT}ｿﾉｳｴ,ﾗｲﾊﾞﾙｼｬ ﾉ UNTIL ｶﾞ ｷﾐﾉ ｻｲﾉｳ ｦ ﾐｺﾝﾃﾞ ﾋｷﾇｷ ﾉ ｿｳﾀﾞﾝ ｶﾞ ｱｯﾀ｡"
5460 PRINT"{RIGHT}Y: ｿﾚﾊ,UNTIL ﾉ Bｾﾝﾑ ｶﾞ ﾊﾅｼ ｦ ﾓﾁｶｹﾀ ﾏﾃﾞﾃﾞ,ﾎﾞｸ ﾊ ﾅﾝﾄﾓ ﾍﾝｼﾞ ｦ ｼﾃｲﾅｲ｡"
5470 PRINT"{RIGHT}O: Bｾﾝﾑ ﾊ ﾑｼﾛ M80-CPU ﾉ ｾｯｹｲｽﾞ ｶﾞ ﾎｼｶｯﾀ ﾉﾃﾞﾊ ﾅｲｶﾈ｡"
5480 PRINT"{DOWN}{RIGHT}PUSH [CR]"
5490 GET C$: IF C$<>CHR$(13)THEN 5490
5500 GOSUB 150
5510 IF E3$<>CHR$(207)+CHR$(184)+CHR$(215)GOTO 5610
5520 PRINT"{RIGHT}O: ｿﾚﾊ ｿｳﾄ,ｺﾉ ﾗｲﾀｰ ﾊ Y,ｷﾐﾉ ﾓﾉｼﾞｬ ﾅｲｶﾈ ? N.Y ﾉ ｲﾆｼｬﾙ ｶﾞ ﾊｲｯﾃｲﾙ｡"
5530 PRINT"{RIGHT}Y: ｱｯ,ｿﾚﾊ... ｶｲｼｬ ﾉ ﾃﾞｽｸ ﾆ ｵｲﾃｲﾙｳﾁ ﾅｸｼﾀ ﾗｲﾀｰ ﾃﾞｽ｡ ﾄﾞｳｼﾃ ｿﾚｶﾞ..."
5540 PRINT"{RIGHT}O: ｺﾉ ﾗｲﾀｰ ｶﾞ ﾄﾞｺﾆ ｱｯﾀｶ ｵｼｴﾃ ﾔﾛｳｶ｡ M ﾉ ﾍﾔﾆ ｵﾁﾃｲﾀﾉﾀﾞ｡"
5550 PRINT"{RIGHT}Y: ﾏｻｶ ｿﾝﾅ ﾊｽﾞﾊ..."
5560 PRINT"{RIGHT}O: ｷﾐﾊ M ﾉ ﾏﾝｼｮﾝ ﾉ ｱｲｶｷﾞ ｦ ｶｸｼﾓｯﾃ ｲﾙﾉﾃﾞﾊ ﾅｲｶ ?"
5570 PRINT"{RIGHT}Y: ｲｲｴ ｱｲｶｷﾞ ﾅﾄﾞ ｼﾘﾏｾﾝ｡"
5580 PRINT"{DOWN}{RIGHT}PUSH [CR]"
5590 GET C$: IF C$<>CHR$(13)THEN 5590
5600 GOSUB 150
5610 PRINT"{RIGHT}ｿｳｻﾎﾝﾌﾞ ﾊ ﾂｷﾞﾆ,M ﾉ ｱｲｼﾞﾝ ﾉ U ｦ ﾖﾝﾃﾞ ｼﾞｼﾞｮｳ ﾁｮｳｼｭｳ ｼﾀ｡"
5620 PRINT"{DOWN}{RIGHT}O: M ﾉ ﾏﾝｼｮﾝ ﾆ ｱｯﾀ ﾌﾞﾗﾝﾃﾞｰｸﾞﾗｽ ｶﾗ ｷﾐ ﾉ ｼﾓﾝ ｶﾞ ｹﾝｼﾞﾂ ｻﾚﾀ｡"
5630 PRINT"{RIGHT}{RIGHT}{RIGHT}{RIGHT}ｽﾅﾜﾁ,U ﾊ M ｶﾞ ﾅｸﾅﾙ ﾁｮｸｾﾞﾝ ｱﾉ ﾏﾝｼｮﾝ ｦ ｵﾄｽﾞﾚﾃ ｲﾀﾉﾃﾞﾊ ﾅｲｶﾈ ?"
5640 PRINT"{RIGHT}U: ﾊｲ,ﾄﾞﾖｳ ﾉ ﾖﾙ 10ｼﾞ ｺﾞﾛﾏﾃﾞ ｼｬﾁｮｳ ﾄ ｲｯｼｮ ﾆ ｲﾏｼﾀ｡"
5650 PRINT"{RIGHT}{RIGHT}{RIGHT}{RIGHT}ﾏｻｶ ﾂｷﾞﾉ ﾋ,ｼｬﾁｮｳ ｶﾞ ｱﾝﾅｺﾄﾆ ﾅﾙﾅﾝﾃ ﾕﾒﾆﾓ ｵﾓﾜｽﾞ,ﾜﾀｼﾓ ﾌﾞﾗﾝﾃﾞｰ ｦ ｽｺｼ ﾉﾐﾏｼﾀ｡"
5660 PRINT"{RIGHT}{RIGHT}{RIGHT}{RIGHT}ｼﾓﾝ ﾊ ｿﾉﾄｷ ﾂｲﾀﾉﾃﾞｼｮｳ｡ ﾓｼﾓ ﾜﾀｼ ｶﾞ ﾊﾝﾆﾝ ﾅﾗ ｳｶﾂﾆ ｼﾓﾝ ｦ ﾉｺｼﾀﾘ ｼﾅｲﾃﾞｼｮｳ｡"
5670 PRINT"{DOWN}{RIGHT}PUSH [CR]"
5680 GET C$: IF C$<>CHR$(13)THEN 5680
5690 GOSUB 150
5700 PRINT"{RIGHT}O: ｿﾚﾃﾞﾊ ｷﾐﾊ ﾏﾝｼｮﾝ ﾉ ｱｲｶｷﾞ ｦ ﾓｯﾃｲﾙｶﾈ ?"
5710 PRINT"{RIGHT}U: ｴｴ,ｼｬﾁｮｳ ｶﾞ ﾜﾀｼﾃ ｸﾚﾀﾉﾀﾞｶﾗ｡ ﾓｳ ﾋﾂﾖｳ ﾅｸﾅｯﾀｹﾄﾞ ｲﾏﾓ ﾊﾞｯｸﾞ ﾆ ﾓｯﾃｲﾙﾜ｡"
5720 PRINT"{RIGHT}O: ｿﾉ ｱｲｶｷﾞ ｦ ﾀﾞﾚｶﾆ ｺｯｿﾘ ｶｼﾀ ｵﾎﾞｴﾊ ﾅｲｶ ?"
5730 PRINT"{RIGHT}U: ﾅｾﾞ ｿﾝﾅｺﾄ｡ ﾜﾀｼﾄ ｼｬﾁｮｳ ﾉ ｶﾝｹｲ ﾊ ﾎｶﾉﾋﾄ ﾆﾊ ﾋﾐﾂ ﾃﾞｼﾀｶﾗ,"
5740 PRINT"{RIGHT}{RIGHT}{RIGHT}{RIGHT}ｼﾞﾌﾞﾝﾃﾞ ﾋﾐﾂ ｦ ﾊﾞﾗｽ ﾖｳﾅ ﾏﾈﾅﾄﾞ ｼﾏｾﾝﾜ｡"
5750 PRINT"{DOWN}{RIGHT}PUSH [CR]"
5760 GET C$: IF C$<>CHR$(13)THEN 5760
5770 GOSUB 150
5780 PRINT"{RIGHT}ｼﾞｹﾝ ﾄｳｼﾞﾂ,U ﾊ ﾄﾓﾀﾞﾁ ﾄ ｺﾝｻｰﾄ ﾆ ﾃﾞｶｹﾃｲﾃ,ｱﾘﾊﾞｲ ﾊ ﾏﾁｶﾞｲﾅｸ ｾｲﾘﾂ ｼﾀ｡"
5790 PRINT"{RIGHT}ｿｳｻﾎﾝﾌﾞ ﾊ ｻﾗﾆ M ﾉ ﾂﾏ A ｦﾓ ﾆﾝｲﾃﾞ ﾄﾘｼﾗﾍﾞﾀ｡"
5800 PRINT"{RIGHT}ﾀﾞｶﾞ,A ﾊ ｵｯﾄ ｶﾞ ｺﾛｻﾚﾀ ｼﾞｺｸ,ｼﾘﾂﾋﾞｮｳｲﾝ ﾃﾞ ｺｳｹﾂｱﾂ ﾉ ｼﾝｻﾂ ｦ ｳｹﾃｲﾃ,"
5810 PRINT"{RIGHT}ｺﾁﾗ ﾉ ｱﾘﾊﾞｲ ﾓ ﾓﾝﾀﾞｲ ﾅｶｯﾀ｡ ｿﾚﾆ ﾍﾞｯｷｮﾁｭｳ ﾄﾊｲｴ,A ｶﾞ ｼｯﾄ ﾆ ｸﾙｯﾃ ｺﾛｼﾀ ﾄ"
5820 PRINT"{RIGHT}ﾐﾅｽﾉﾊ ｽｺｼ ﾑﾘｶﾞ ｱﾙ｡ ﾂﾏ ﾄｼﾃ ﾕﾙｾﾅｲ ﾅﾗ ﾑｼﾛ ｱｲｼﾞﾝ ﾉ U ｦ ﾈﾗｳﾀﾞﾛｳ｡"
5830 PRINT"{RIGHT}ｻﾗﾆ,A ﾊ ｲﾏﾀﾞ ｼｬﾁｮｳﾌｼﾞﾝ ﾃﾞｱﾘ,ｿﾉ ｵｯﾄ ｦ ｺﾛｽｺﾄﾃﾞ ﾖﾘ ｵｵｷﾅ ﾘｴｷ ｶﾞ ｱﾙﾄﾊ ｵﾓﾜﾚﾅｲ｡"
5840 PRINT"{DOWN}{RIGHT}PUSH [CR]"
5850 GET C$: IF C$<>CHR$(13)THEN 5850
5860 GOSUB 150
5870 PRINT"{RIGHT}ｿｳｻ ﾊ ﾅﾝｺｳ ｼ,Oｹｲﾌﾞ ﾊ ﾈﾝﾉﾀﾒ ｵﾅｼﾞｸ ｴﾝｼﾞﾆｱｰ ﾃﾞ Y ﾉ ﾗｲﾊﾞﾙ ﾄｲｳ F ｶﾗﾓ"
5880 PRINT"{RIGHT}ｼﾞｼﾞｮｳ ﾁｮｳｼｭｳ ｼﾀ｡ F ﾊ ｼﾞｹﾝ ﾄｳｼﾞﾂ ﾎｯｶｲﾄﾞｳ ﾆ ｼｭﾂﾁｮｳ ｼﾃｲﾃ,M ｶﾞ ﾍﾝｼ ｼﾀｺﾄﾊ"
5890 PRINT"{RIGHT}ｼｭｯﾁｮｳ ｶﾗ ﾓﾄﾞｯﾀ ﾁｮｸｺﾞ ﾆ ｷｲﾃ ｵﾄﾞﾛｲﾀ ﾄｲｳ｡"
5900 PRINT"{RIGHT}F ｶﾞ 8ｶ ｶﾗ 9ｶ ﾆ ｶｹﾃ ﾎｯｶｲﾄﾞｳ ﾆ ﾃﾞｶｹﾀ ｺﾄﾊ ｼﾞｼﾞﾂ ﾃﾞｱﾘ,ﾉｯﾀ ﾋｺｳｷ ﾏﾃﾞ ｶｸﾆﾝ ｻﾚﾀ｡"
5910 PRINT"{RIGHT}ｿｼﾃ ﾄﾞｳｷ ﾊ ﾄﾓｶｸ,F ｶﾞ M ｦ ｺﾛｽﾆﾊ ｼﾞｶﾝﾃｷﾆ ﾐﾃ ﾌｶﾉｳ ﾀﾞｯﾀ｡"
5920 PRINT"{RIGHT}M ﾉ ｼﾎﾞｳｽｲﾃｲ ｼﾞｺｸ 9ｼﾞ ｶﾗ 10ｼﾞ ﾆ,F ﾊ ﾁｮｳﾄﾞ ﾋｺｳｷ ﾉ ﾅｶﾆ ｲﾀｶﾗﾃﾞｱﾙ｡"
5930 PRINT"{DOWN}{RIGHT}PUSH [CR]"
5940 GET C$: IF C$<>CHR$(13)THEN 5940
5950 GOSUB 150
5960 PRINT"{RIGHT}Oｹｲﾌﾞ ﾊ ｻｲｺﾞﾆ,Micro-hard ﾉ ﾗｲﾊﾞﾙ ﾒｰｶｰ UNTIL ﾉ Bｾﾝﾑ ｦﾓ ﾄﾘｼﾗﾍﾞﾀ｡"
5970 PRINT"{RIGHT}Bｾﾝﾑ ﾊ ｺﾛｻﾚﾀ Mｼｬﾁｮｳ ﾄ ﾀﾞｲｶﾞｸ ｶﾞ ﾄﾞｳｷﾃﾞｱﾙ｡"
5980 PRINT"{RIGHT}ﾀｶﾞｲﾆ ｶｵﾐｼﾘ ﾃﾞ,ﾏｲｸﾛ ｺﾝﾋﾟｭｰﾀ ﾉ ﾊﾝﾊﾞｲ ｼｴｱ ﾆ ｶﾝｼﾃ ﾅﾆｶﾄ ﾀｲｺｳｼﾃｲﾀ｡"
5990 PRINT"{RIGHT}M80-CPU ﾉ ｱｰｷﾃｸﾁｬｰ ｦ ﾎｼｶﾞｯﾃｲﾀ ｺﾄﾓ ﾐﾄﾒﾀ｡"
6000 PRINT"{RIGHT}ｼｶｼ,Bｾﾝﾑ ﾊ 9ｶ ｺﾞｾﾞﾝﾁｭｳ ﾊ ｺﾞﾙﾌ ｼﾞｮｳﾉ ｺｰｽﾒｸﾞﾘ ｦ ｼﾃｲﾀ ﾄｲｳ｡"
6010 PRINT"{RIGHT}ｿﾉ ｱﾘﾊﾞｲ ﾊ ｽｸﾞ ﾆ ﾀｼｶﾒﾗﾚﾀ｡"
6020 PRINT"{DOWN}{RIGHT}PUSH [CR]"
6030 GET C$: IF C$<>CHR$(13)THEN 6030
6040 GOTO 6240
6050 REM  P-11
6060 GRAPHC7:PRINT"{CLR}":GOSUB 220
6070 LINE[5]0,125,5,120,60,120,65,125,60,135,25,135,20,160
6075 LINE[3]20,160,15,155,10,165,15,170
6080 LINE[2]55,136,55,155,65,165,55,172,55,185,50,190,30,195,25,198
6090 LINE[3]42,145,52,148:LINE[3]45,154,52,154:LINE[3]45,178,55,178
6100 LINE[4]0,180,25,199:LINE[5]0,180,15,170
6110 LINE[3]75,199,100,165,130,165,135,167,135,169,115,172,115,174,120,174,125,176,120,178,125,180,120,182,125,182,110,199
6120 LINE[1]260,120,310,120:LINE[1]270,110,300,110
6130 LINE[1]270,120,270,105,275,100,295,100,300,105,300,120
6140 LINE[7]270,121,270,145,285,155,300,145,300,121
6150 LINE[2]275,125,282,125:LINE[2]289,125,296,125:LINE[2]285,128,285,135
6160 LINE[7]270,135,300,135
6170 LINE[1]269,140,252,160:LINE[1]301,140,318,160
6180 LINE[2]235,182,240,162,313,162,318,182:LINE[2]244,162,245,160,308,160,309,162
6190 LINE[2]250,182,255,175,255,162:LINE[2]302,182,297,175,297,162
6200 LINE[1]230,198,233,182,250,182,250,198
6210 LINE[1]302,198,302,182,318,182,318,198
6220 LINE[2]253,178,256,198:LINE[2]300,178,297,198
6222 PAINT[5]10,130,3,5
6230 RETURN
6240 GOSUB 6050
6250 PRINT"{RIGHT}{RIGHT}{RIGHT}{RIGHT}{RIGHT}{RIGHT}{RIGHT}{RIGHT}{RIGHT}{RIGHT}{RIGHT}< ﾊﾝﾆﾝ ﾊ ﾀﾞﾚｶ ? >"
6260 PRINT"{DOWN}{RIGHT}ｺﾚﾃﾞ ｼﾞｹﾝ ﾉ ｾﾞﾝﾎﾞｳ ﾄ,ｽﾍﾞﾃ ﾉ ﾖｳｷﾞｼｬ ｦ ｶﾀﾘｵｴﾀ｡"
6270 PRINT"{RIGHT}ｹﾝﾒｲﾅ ﾀﾝﾃｲ ﾃﾞｱﾙ ｷﾐﾊ,ｽﾃﾞﾆ ﾊﾝﾆﾝ ﾉ ﾒﾎﾞｼ ﾊ ﾂｲﾃ ｲﾙｺﾄ ﾀﾞﾛｳ｡"
6280 PRINT"{RIGHT}ﾀﾞｶﾞ,ﾊﾀｼﾃ ﾊﾝﾆﾝ ﾉ ﾄﾘｯｸ ﾊ ｼｸﾏﾚﾃ ｲﾅｲﾉｶ ? ｱﾘﾊﾞｲ ﾊ ? ﾄﾞｳｷ ﾊ ﾅﾆｶ ?"
6290 PRINT"{RIGHT}ｲﾏﾏﾃﾞ ﾉ ﾃﾞｰﾀ ｦ ﾓﾄﾆ,ｷﾐｼﾞｼﾞﾝ ﾃﾞ ﾅｿﾞﾄｷ ｼﾃﾓﾗｲﾀｲ｡"
6300 PRINT"{RIGHT}ｺﾚｶﾗﾊ Oｹｲﾌﾞ ｶﾞ ｼﾂﾓﾝ ｼﾃ,K(ｷﾐ)ｶﾞ ｺﾀｴﾙ ﾄｲｳ ｹｲｼｷ ｦ ﾄﾙ｡"
6310 PRINT"{RIGHT}ｺﾀｴﾙ ﾄｷﾉ ﾓｰﾄﾞ ﾊ ｼﾞﾌﾞﾝ ﾃﾞ ｾｯﾃｲ ｽﾙｺﾄ｡"
6320 PRINT"{DOWN}{RIGHT}Are you ready ?{RIGHT}{RIGHT}{RIGHT}PUSH [CR]"
6330 GET C$: IF C$<>CHR$(13)THEN 6330
6340 GOSUB 150
6350 PRINT"{RIGHT}O: M ｶﾞ ｻﾂｶﾞｲ ｻﾚﾀ 9ｶ ｺﾞｾﾞﾝ 9ｼﾞ ｶﾗ 10ｼﾞ ﾏﾃﾞﾉ ｱﾘﾊﾞｲ ｶﾞ ﾅｲﾉﾊ ﾋﾄﾘﾀﾞ｡"
6360 PRINT"{RIGHT}{RIGHT}{RIGHT}{RIGHT}A,B,F,Y,U ﾉ ﾅｶｶﾗ ｺﾀｴﾖ｡"
6370 GOSUB 190
6380 IF C$<>CHR$(89)GOTO 6370
6390 A1$=C$:GOSUB 150
6400 PRINT"{RIGHT}O: ｼｶﾓ, M ﾉ ﾏﾝｼｮﾝ ｶﾗﾊ ";A1$;" ﾉ ｲﾆｼｬﾙ ｶﾞ ﾊｲｯﾀ ｼｮｳｺﾋﾝ ｶﾞ ﾐﾂｶｯﾃｲﾙ｡"
6410 PRINT"{RIGHT}{RIGHT}{RIGHT}{RIGHT}ｿﾚﾊ ﾅﾆｶ ?"
6420 GOSUB 190
6430 IF C$<>CHR$(215)+CHR$(178)+CHR$(192)+CHR$(45)GOTO 6420
6440 A2$=C$:GOSUB 150
6450 PRINT"{RIGHT}O: ｶﾚﾊ ";A2$;" ｦ ｶｲｼｬ ﾃﾞ ﾅｸｼﾀ ﾄ ｲｯﾃｲﾙｶﾞ,ｱﾔｼｲ ﾓﾉﾀﾞ｡"
6460 PRINT"{RIGHT}{RIGHT}{RIGHT}{RIGHT}ﾔﾊﾘ ｼﾝﾊﾝﾆﾝ ﾊ ";A1$;" ﾅﾉｶ ? YES ｶ NO ﾃﾞ ｺﾀｴﾖ｡"
6470 GOSUB 190
6480 IF C$=CHR$(89)+CHR$(69)+CHR$(83)GOTO 6510
6490 IF C$=CHR$(78)+CHR$(79)GOTO 6570
6500 GOTO 6470
6510 GOSUB 150
6520 PRINT"{DOWN}{RIGHT}ｷﾐ ﾉ ｽｲﾘ ﾊ ｱﾏﾘﾆ ﾀﾝｼﾞｭﾝ ﾃﾞ,ｼﾞｭｳﾀﾞｲﾅ ｺﾄ ｦ ﾐｵﾄｼﾃｲﾙ｡"
6530 PRINT"{DOWN}{RIGHT}ﾓｳｲﾁﾄﾞ ｻｲｼｮ ｶﾗ ﾔﾘﾅｵｼ ﾏｽｶ ? (PUSH  [Y] or [N])"
6540 GET C$: IF C$=CHR$(89)THEN RUN
6550 IF C$=CHR$(78)THEN END
6560 GOTO 6540
6570 GOSUB 150
6580 PRINT"{RIGHT}O: M ﾉ ﾏﾝｼｮﾝ ﾉ ｱｲｶｷﾞ ｦ ﾓｯﾃｲﾀ ﾉﾊ ﾀﾞﾚｶ ?"
6590 PRINT"{RIGHT}{RIGHT}{RIGHT}{RIGHT}A,B,F,Y,U ﾉ ﾅｶｶﾗ ｺﾀｴﾖ｡"
6600 GOSUB 190
6610 IF C$<>CHR$(85)GOTO 6600
6620 A3$=C$:GOSUB 150
6630 PRINT"{RIGHT}O: ｿﾚﾃﾞﾊ ｼﾝﾊﾝﾆﾝ ﾊ ";A3$;" ﾅﾉｶ ? YES ｶ NO ﾃﾞ ｺﾀｴﾖ｡"
6640 GOSUB 190
6650 IF C$=CHR$(89)+CHR$(69)+CHR$(83)GOTO 6510
6660 IF C$=CHR$(78)+CHR$(79)GOTO 6680
6670 GOTO 6640
6680 GOSUB 150
6690 PRINT"{RIGHT}O: M ﾉ ﾍﾔ ﾊ ｶﾝﾀﾝﾆ ｱｲﾀ ｶ ? ｿﾚﾄﾓ ﾄﾞｳﾅｯﾃｲﾀ ｶ ?"
6700 GOSUB 190
6710 IF C$<>CHR$(208)+CHR$(175)+CHR$(188)+CHR$(194)GOTO 6700
6720 A4$=C$:GOSUB 150
6730 PRINT"{RIGHT}O: ";A4$;" ｦ ﾂｸﾙﾆﾊ ﾔﾊﾘ ｱｲｶｷﾞ ｶﾞ ﾋﾂﾖｳﾀﾞ｡"
6740 PRINT"{RIGHT}{RIGHT}{RIGHT}{RIGHT}ｿﾚﾃﾞﾊ ";A3$;" ｶﾞ ﾊﾝﾆﾝ ﾆ ｺｯｿﾘ ｶｼﾀﾉｶ ? YES ｶ NO ﾃﾞ ｺﾀｴﾖ｡"
6750 GOSUB 190
6760 IF C$=CHR$(89)+CHR$(69)+CHR$(83)GOTO 6800
6770 IF C$=CHR$(78)+CHR$(79)GOTO 6790
6780 GOTO 6750
6790 GOSUB 150:GOTO 6730
6800 GOSUB 150
6810 PRINT"{RIGHT}O: ｿﾚﾃﾞﾊ ";A3$;" ｶﾞ ｶｷﾞ ｦ ｶｼﾀ ｱｲﾃﾊ ﾀﾞﾚｶ ?"
6820 PRINT"{RIGHT}{RIGHT}{RIGHT}{RIGHT}A,B,F,Y ﾉ ﾅｶｶﾗ ｺﾀｴﾖ｡"
6830 GOSUB 190
6840 IF C$=CHR$(65)GOTO 6890
6850 IF C$=CHR$(66)GOTO 6920
6860 IF C$=CHR$(89)GOTO 6950
6870 IF C$=CHR$(70)GOTO 6980
6880 GOTO 6800
6890 GOSUB 150
6900 PRINT"{RIGHT}O: ﾀﾞｶﾞ,ｵﾝﾅ ﾄﾞｳｼ ﾃｷﾀｲ ｼｱｯﾃ ｲﾀﾉﾀﾞｶﾗ,";A3$;" ｶﾞ ";C$;" ﾆ ｶｼﾀ ﾄﾊ ｶﾝｶﾞｴﾗﾚﾅｲ｡"
6910 GOTO 6810
6920 GOSUB 150
6930 PRINT"{RIGHT}O: ﾀﾞｶﾞ,ﾂﾄﾒｻｷ ｶﾞ ﾁｶﾞｳ ｶﾗ,";A3$;" ｶﾞ ";C$;" ﾆ ｶｼﾀ ﾄﾊ ｶﾝｶﾞｴﾗﾚﾅｲ｡"
6940 GOTO 6810
6950 GOSUB 150
6960 PRINT"{RIGHT}O: ﾀﾞｶﾞ,ｼﾝﾊﾝﾆﾝ ﾊ ｶﾚ ﾃﾞﾊﾅｲ ﾉﾀﾞｶﾗ,";A3$;" ｶﾞ ";C$;" ﾆ ｶｼﾀ ﾄﾊ ｶﾝｶﾞｴﾗﾚﾅｲ｡"
6970 GOTO 6520
6980 A5$=C$:GOSUB 150
6990 PRINT"{RIGHT}O: M ｶﾞ ｼﾝﾃﾞｲﾀ ﾍﾔ ﾊ ﾄﾞｺｶ ?"
7000 GOSUB 190
7010 IF C$<>CHR$(202)+CHR$(222)+CHR$(189)+CHR$(217)+CHR$(45)+CHR$(209)GOTO 7000
7020 A6$=C$:GOSUB 150
7030 PRINT"{RIGHT}O: M ﾊ ｱﾀﾏ ｶﾗ ﾁ ｦ ﾅｶﾞｼﾃ ｲﾀｶﾞ,ﾎﾝﾄｳ ﾉ ｼｲﾝ ﾊ ﾅﾆｶ ?"
7040 GOSUB 190
7050 IF C$<>CHR$(193)+CHR$(175)+CHR$(191)+CHR$(184)+CHR$(188)GOTO 7040
7060 GOSUB 150
7070 PRINT"{RIGHT}O: M ﾉ ｸﾋﾞ ｦ ｼﾒﾀ ﾓﾉﾊ ";A6$;" ﾆ ｱｯﾀ ﾅﾝﾉ ﾎｰｽ ｶ ?"
7080 GOSUB 190
7090 IF C$<>CHR$(188)+CHR$(172)+CHR$(220)+CHR$(45)GOTO 7080
7100 A7$=C$:GOSUB 150
7110 PRINT"{RIGHT}O: ｷﾐ ﾊ,";A5$;" ｦ M ｻﾂｶﾞｲ ﾊﾝﾆﾝ ﾄ ﾀﾞﾝﾃｲ ｼﾃｲﾙ｡"
7120 PRINT"{RIGHT}{RIGHT}{RIGHT}{RIGHT}ｼｶｼ,ｶﾚﾆﾊ 9ｶ ｺﾞｾﾞﾝ 9ｼﾞ ｶﾗ 10ｼﾞ ﾏﾃﾞﾉ ｶﾝﾍﾟｷﾅ ｱﾘﾊﾞｲ ｶﾞ ｱﾙ｡"
7130 PRINT"{RIGHT}{RIGHT}{RIGHT}{RIGHT}ﾂﾏﾘ,ｶﾚﾊ ﾎｯｶｲﾄﾞｳ ﾆ ｼｭｯﾁｮｳ ｼ,11ｼﾞ ﾉ ﾋｺｳｷ ﾃﾞ ﾓﾄﾞｯﾃ ｷﾀﾉﾀﾞ｡"
7140 PRINT"{RIGHT}K: ｿﾚﾃﾞﾊ,ﾓｳｲﾁﾄﾞ ｱﾉ ﾊﾝｺｳｹﾞﾝﾊﾞ ｦ ｻｲｹﾞﾝ ｼﾃ ﾐﾖｳ｡"
7150 PRINT"{RIGHT}{RIGHT}{RIGHT}{RIGHT}ｿｳｽﾚﾊﾞ,ﾊﾝﾆﾝ ｶﾞ ﾄﾞﾝﾅ ﾄﾘｯｸ ｦ ﾓﾁｲﾀｶ ﾐﾔﾌﾞｯﾃ ｺﾞﾗﾝﾆｲﾚﾙ｡"
7160 PRINT"{DOWN}{RIGHT}PUSH [CR]"
7170 GET C$: IF C$<>CHR$(13)THEN 7170
7180 GOSUB 2440
7190 PRINT"{RIGHT}K: ｺﾚｶﾞ ";A6$;" ﾄ ｼﾀﾞｲ ﾉ ｼﾞｮｳｷｮｳ ﾃﾞｱﾙ｡"
7200 PRINT"{RIGHT}{RIGHT}{RIGHT}{RIGHT}ﾜﾀｼ ﾊ ｱﾉﾄｷ ｼﾀﾞｲ ﾆ ｼﾞｶﾆ ｻﾜｯﾃ ﾐﾀ｡ ｿｼﾃ ｹｲﾌﾞ ﾆ ﾅﾝﾄ ｲｯﾀｶ ｵﾎﾞｴﾃ ｲﾙｶｲ ?"
7210 PRINT"{RIGHT}O: ﾅﾝﾄ ｲｯﾀ ﾉﾀﾞｯﾀｶﾅ ?"
7220 GOSUB 190
7230 IF C$<>CHR$(188)+CHR$(210)+CHR$(175)+CHR$(206)+CHR$(223)+CHR$(178)GOTO 7220
7240 A8$=C$:GOSUB 150
7250 PRINT"{RIGHT}K: ｿｳ ﾋﾄﾞｸ ";A8$;" ｼﾀﾞｲ ﾀﾞｯﾀ｡"
7260 PRINT"{RIGHT}O: ﾀﾞｶﾞ ｿﾚﾊ ﾅｶﾞｲ ｱｲﾀﾞ ";A6$;" ﾆ ﾖｺﾀﾜｯﾃ ｲﾀ ｾｲﾀﾞﾛｳ｡"
7270 PRINT"{RIGHT}{RIGHT}{RIGHT}{RIGHT}ｿﾉﾀﾒ,ﾌﾂｳ ﾉ ｼﾞｮｳｷｮｳ ﾖﾘﾓ ｼﾀﾞｲﾉ ｺｳﾁｮｸ ﾄ ｼｶﾝ ｶﾞ ﾕﾙﾔｶ ﾀﾞﾄ,ｲｼｬ ﾊ ﾊﾝﾀﾞﾝ ｼﾀ｡"
7280 PRINT"{RIGHT}K: ｿﾚｶﾞ ｹｲｻﾂ ﾉ ﾓｳﾃﾝ ﾀﾞ｡ ｿﾚｺｿ ﾊﾝﾆﾝ ﾉ ｼｶｹﾀ ﾄﾘｯｸ ﾆ ﾎｶﾅﾗﾅｲ｡"
7290 PRINT"{RIGHT}O: ﾄﾞｳｲｳ ｺﾄﾀﾞ... ?"
7300 PRINT"{RIGHT}K: ﾜﾀｼ ﾊ ﾕﾌﾞﾈ ﾉ ﾅｶﾓ ﾉｿﾞｲﾃ ﾐﾀ｡ ｽｺｼ ﾉｺｯﾃｲﾀ ﾐｽﾞ ﾊ ﾏｯﾀｸ ﾖｺﾞﾚﾃ ｲﾅｶｯﾀ｡"
7310 PRINT"{RIGHT}O: ｿﾉｺﾄｶﾞ ﾄﾘｯｸ ﾄ ﾄﾞｳ ﾑｽﾋﾞﾂｸﾉｶ,ｻｯﾊﾟﾘ ﾜｶﾗﾝ｡"
7320 PRINT"{DOWN}{RIGHT}PUSH [CR]"
7330 GET C$: IF C$<>CHR$(13)THEN 7330
7340 GOSUB 150
7350 PRINT"{RIGHT}K: ﾐｽﾞ ﾆ ﾂｶｯﾀ ｼﾀﾞｲ ﾊ ﾌﾂｳﾖﾘﾓ ｺｳﾁｮｸ ﾔ ﾌﾊｲ ﾉ ｽｽﾐｸﾞｱｲ ｶﾞ ｵｿｸﾅﾙ｡"
7360 PRINT"{RIGHT}O: ｿﾚﾊ ｹﾝｼ ﾉ ｼﾞｮｳｼｷ ﾀﾞﾖ｡"
7370 PRINT"{RIGHT}K: ﾃﾞﾊ ﾐｽﾞ ﾃﾞﾊﾅｸ,ｽｲｼﾞｮｳｷ ﾂﾏﾘ ｽﾁｰﾑ ﾀﾞｯﾀﾗ ﾄﾞｳｶ ?"
7380 PRINT"{RIGHT}O: ﾅﾝﾀﾞｯﾃ ! ｽﾁｰﾑ ﾀﾞﾄ..."
7390 PRINT"{RIGHT}K: ｺﾚｺｿ,ﾊﾝﾆﾝ ｶﾞ ｼﾀﾞｲ ｦ ";A6$;" ﾆ ﾊｺﾋﾞｺﾝﾀﾞ ﾘﾕｳ ﾀﾞｯﾀﾉﾀﾞ｡"
7400 PRINT"{RIGHT}{RIGHT}{RIGHT}{RIGHT}ﾊﾝﾆﾝ ﾊ ｺﾉﾀﾒﾆ ";A4$;" ｶﾞ ﾋﾂﾖｳ ﾀﾞｯﾀﾉﾀﾞ｡"
7410 PRINT"{RIGHT}O: ﾏﾀﾞ ﾜｼﾆﾊ ﾖｸ ﾘﾕｳ ｶﾞ ﾉﾐｺﾒﾝ｡"
7420 PRINT"{DOWN}{RIGHT}PUSH [CR]"
7430 GET C$: IF C$<>CHR$(13)THEN 7430
7440 GOSUB 150
7450 PRINT"{RIGHT}K: ｲｲﾃﾞｽｶ ｹｲﾌﾞ,ﾊﾝﾆﾝ ﾊ ｼﾀﾞｲ ｦ ｽﾁｰﾑ ﾃﾞ ｱﾀﾀﾒﾃ ,ﾌﾊｲ ｶﾞ ｽｽﾑﾖｳﾆ ｻｲｸ ｼﾀﾝﾃﾞｽﾖ｡"
7460 PRINT"{RIGHT}{RIGHT}{RIGHT}{RIGHT}ﾐｽﾞ ﾆ ﾇﾚﾀ ｼﾀﾞｲ ﾄ ｽﾁｰﾑ ﾆ ﾇﾚﾀ ｼﾀﾞｲ ﾄﾃﾞﾊ,ｼﾎﾞｳ ｽｲﾃｲ ｶﾞ 2,3ｼﾞｶﾝ ｸｲﾁｶﾞｳ｡"
7470 PRINT"{RIGHT}{RIGHT}{RIGHT}{RIGHT}ｺｳﾐｮｳﾅ ﾊﾝﾆﾝ ﾊ ｿﾉｺﾄ ﾆ ﾒｦ ﾂｹﾃ,M ﾉ ｼﾎﾞｳｼﾞｺｸ ｦ ｱｻﾑｲﾀ｡"
7480 PRINT"{RIGHT}O: ﾂﾏﾘ M ﾉ ｼﾞｯｻｲ ﾉ ｼﾎﾞｳｼﾞｺｸ ﾊ,ｺﾞｾﾞﾝ 9ｼﾞ ﾖﾘﾓ ﾏｴ ﾀﾞｯﾀﾉｶ ｱﾄ ﾀﾞｯﾀﾉｶ ?"
7490 GOSUB 190:GOSUB 150
7500 IF C$<>CHR$(177)+CHR$(196)GOTO 7450
7510 PRINT"{RIGHT}K: ﾊﾝﾆﾝ ｽﾅﾜﾁ,";A5$;" ﾊ 11ｼﾞ ﾉ ﾋｺｳｷ ﾃﾞ ﾓﾄﾞﾙﾄ ｽｸﾞﾆ ｼｬﾁｮｳ ﾃﾞｱﾙ M ﾉ ﾏﾝｼｮﾝ ｦ "
7520 PRINT"{RIGHT}{RIGHT}{RIGHT}{RIGHT}ｵﾄｽﾞﾚ,ｽｷ ｦ ﾐﾃ M ﾉ ｱﾀﾏ ｦ ﾅｸﾞﾘﾂｹ,ｷｾﾞﾂ ｼﾃｲﾙ ｱｲﾀﾞﾆ,";A6$;" ﾆ ﾊｺﾋﾞｺﾐ"
7530 PRINT"{RIGHT}{RIGHT}{RIGHT}{RIGHT}";A7$;" ﾉ ﾎｰｽ ｦ ｸﾋﾞ ﾆ ﾏｷﾂｹﾃ ｼﾒｺﾛｼﾀ｡"
7540 PRINT"{RIGHT}{RIGHT}{RIGHT}{RIGHT}ｿｼﾃ ｶﾚﾊ,ｶﾞｽ ﾌﾛｶﾞﾏ ﾆ ﾃﾝｶ ｼﾃ ﾕ ｦ ﾜｶｼ,";A6$;" ｦ ｽﾁｰﾑ ﾃﾞ ｼﾞｭｳﾏﾝ ｻｾﾀ｡"
7550 PRINT"{RIGHT}{RIGHT}{RIGHT}{RIGHT}ｽﾁｰﾑ ﾉ ﾈﾂ ﾃﾞ M ﾉ ｼﾀﾞｲ ﾊ ｼｾﾞﾝﾆ ｱﾀﾀﾒﾗﾚ,ﾌﾊｲ ﾉ ｼﾝｺｳ ｶﾞ ﾊﾔﾒﾗﾚﾀ｡"
7560 PRINT"{RIGHT}{RIGHT}{RIGHT}{RIGHT}ﾀﾞｶﾞ ｼﾀﾞｲ ｶﾞ ﾊｯｹﾝ ｻﾚﾙｺﾛﾆﾊ ｽｯｶﾘ ｻﾒﾃ,ﾀﾀﾞ ﾐｽﾞ ﾆ ﾇﾚﾀﾖｳﾆ ｼｶ ﾐｴﾅｲ｡"
7570 PRINT"{RIGHT}{RIGHT}{RIGHT}{RIGHT}ｹｲｻﾂｲ ﾊ ﾊｯｹﾝ ｻﾚﾀ ｼﾞｮｳｷｮｳ ｶﾗ,ｼﾎﾞｳｼﾞｺｸ ｦ ｼﾞｯｻｲ ﾖﾘﾓ ﾋｷﾉﾊﾞｼﾃ ﾊﾝﾀﾞﾝ ｼﾀ｡"
7580 PRINT"{DOWN}{RIGHT}PUSH [CR]"
7590 GET C$: IF C$<>CHR$(13)THEN 7590
7600 GOTO 7750
7610 REM P-12
7620 GRAPHC7:PRINT"{CLR}":GOSUB 220
7630 FORI=0TO80 STEP80
7640 FORJ=0TO2*π STEP.05:SET[5]20*COS(J)+100+I,20*SIN(J)+155:NEXT J
7650 FORJ=2*π/3 TO7*π/3  STEP.05:SET[5]30*COS(J)+100+I,30*SIN(J)+155:NEXT J
7660 LINE[4]85+I,180,85+I,195,115+I,195,115+I,175,95+I,175
7670 LINE[5]102+I,125,102+I,135
7680 NEXT I
7690 CURSOR 24,16:PRINT"o"
7700 CURSOR 44,16:PRINT"o"
7710 CURSOR 22,22:PRINT"o"
7720 CURSOR 47,22:PRINT"o"
7730 CURSOR 27,23:PRINT"@=============@{BLK}"
7740 RETURN
7750 GOSUB 7610
7760 PRINT"{RIGHT}K: ｺｳｼﾃ ";A5$;" ﾊ ﾊﾝｺｳ ｶﾞ ｼﾞｯｻｲ ﾖﾘﾓ 2ｼﾞｶﾝ ﾊﾔｸ ｵｷﾀｶﾉ ﾖｳﾆ ﾐｾｶｹ,"
7770 PRINT"{RIGHT}{RIGHT}{RIGHT}{RIGHT}ｿﾉｱｲﾀﾞ ｼﾞﾌﾞﾝ ﾊ ﾋｺｳｷ ﾆ ﾉｯﾃｲﾀ,ﾄｲｳ ｶﾝﾍﾟｷﾅ ｱﾘﾊﾞｲ ｦ ﾖｳｲ ｼﾃｲﾀ ﾉﾀﾞ｡"
7780 PRINT"{RIGHT}{RIGHT}{RIGHT}{RIGHT}ｻﾗﾆ,ｶﾚﾊ M80-CPU ﾉ ｶｲﾊﾂ ﾃﾞ ｵｸﾚ ｦ ﾄｯﾀ ﾗｲﾊﾞﾙ ﾉ ";A1$;" ﾆ ﾂﾐｦ ｷｾﾖｳﾄｼﾃ,"
7790 PRINT"{RIGHT}{RIGHT}{RIGHT}{RIGHT}ｲｾﾞﾝｶﾗ ﾖｳｲｼﾃ ｱｯﾀ ";A1$;" ﾉ ";A2$;" ｦ M ﾉ ｼﾝｼﾂ ﾆ ｺｯｿﾘ ｶｸｼﾃ ｵｲﾀ｡"
7800 PRINT"{RIGHT}O: ﾌﾑ,ｼﾝﾊﾝﾆﾝ ｶﾞ ｳｶﾂﾆ ｲﾆｼｬﾙ ｲﾘﾉ ";A2$;" ﾅﾄﾞ ｵﾄｼﾃ ｵｸ ﾊｽﾞｶﾞ ﾅｲｶﾗﾅ｡"
7810 PRINT"{RIGHT}K: ";A5$;" ﾊ ｽﾍﾞﾃ ﾉ ｻｲｸ ｶﾞ ﾄﾄﾉｳ ﾄ,";A3$;" ｶﾗ ﾋｿｶﾆ ｶﾘﾀ ｱｲｶｷﾞ ﾃﾞ "
7820 PRINT"{RIGHT}{RIGHT}{RIGHT}{RIGHT}M ﾉ ﾏﾝｼｮﾝ ｦ ";A4$;" ｼﾞｮｳﾀｲ ﾆｼﾃ ﾅﾆｸﾜﾇ ｶｵ ﾃﾞ ﾄｳｿｳ ｼﾀﾉﾀﾞ｡"
7830 PRINT"{DOWN}{RIGHT}PUSH [CR]"
7840 GET C$: IF C$<>CHR$(13)THEN 7840
7850 GOSUB 150
7860 PRINT"{RIGHT}O: ﾀﾞｶﾞ ｲｯﾀｲ ";A5$;" ｶﾞ M ｦ ｺﾛｼﾀ ﾄﾞｳｷ ﾊ ﾅﾝﾅﾉﾀﾞ ?"
7870 PRINT"{RIGHT}K: ｵｿﾗｸ M ｶﾞ ｺﾞｸﾋ ｼﾞｮｳﾎｳ ﾃﾞ ｳﾁｱｹﾀ ﾖｳﾅ,ｺﾝﾋﾟｭｰﾀ ｼｬｶｲ ﾆ ﾅｯﾃﾓ ｶｲｹﾂ ｼｴﾅｲ,"
7880 PRINT"{RIGHT}{RIGHT}{RIGHT}{RIGHT}ﾆﾝｹﾞﾝ ｶﾝｹｲ ﾉ ﾑｽﾞｶｼｻ ﾆ ﾀﾝ ｦ ﾊｯｼﾀ ｼﾞｹﾝ ﾀﾞﾛｳ｡"
7890 PRINT"{RIGHT}{RIGHT}{RIGHT}{RIGHT}ｼｬﾁｮｳ ﾉ M ﾊ ｼﾞﾌﾞﾝ ﾉ ﾑｽﾒ ｦ ﾖﾒ ﾆ ﾔｯﾃﾓｲｲ ﾄ ｵﾓｳﾎﾄﾞ ";A1$;" ﾆ ｷﾀｲ ｦ ﾖｾﾃｲﾀ｡"
7900 PRINT"{RIGHT}{RIGHT}{RIGHT}{RIGHT}ｿﾚﾆﾀｲｼﾃ,ｵﾅｼﾞ ｴﾝｼﾞﾆｱｰ ﾉ ";A5$;" ﾊ ｵｸﾚｦ ﾄﾘ,ﾊｹﾞｼｸ ﾃｷｲ ｦ ﾓﾔｼﾃ ｲﾀ｡"
7910 PRINT"{RIGHT}{RIGHT}{RIGHT}{RIGHT}ｲﾏ ";A1$;" ｶﾞ ｼｬﾁｮｳ ﾉ ﾑｽﾒﾄ ｲｯｼｮﾆ ﾅﾚﾊﾞ,";A5$;" ﾊ ｲｯｼｮｳ ｿﾉ ｼﾀﾃﾞ ﾊﾀﾗｸ ﾊﾒﾆﾅﾙ｡"
7920 PRINT"{RIGHT}{RIGHT}{RIGHT}{RIGHT}ｱﾝﾀﾝ ﾄｼﾀ ";A5$;" ﾉ ｺｺﾛ ﾆ ﾂｹｲﾘ,ｶｹﾞﾃﾞ ｲﾄ ｦ ﾋｲﾃｲﾀﾉﾊ ｱﾙｲﾊ UNTIL ﾉ Bｾﾝﾑ ﾃﾞﾊﾅｲｶ｡"
7930 PRINT"{RIGHT}{RIGHT}{RIGHT}{RIGHT}ｼｶｼ ｿｳｼﾀ ﾊｲｺﾞ ｶﾝｹｲ ｦ ﾂｷﾄﾒ,ﾊﾝﾆﾝ ｦ ﾀｲﾎ ｽﾙﾉﾊ ｹｲﾌﾞ ﾉ ﾔｸﾒ ﾃﾞｼｮｳ｡"
7940 PRINT"{DOWN}{RIGHT}PUSH [CR]"
7950 GET C$: IF C$<>CHR$(13)THEN 7950
7960 GOSUB 150:GOSUB 220
7970 POSITION48,8:PATTERN[2]-16,M$(0)
7980 POSITION88,8:PATTERN[2]-16,M$(1)
7990 POSITION128,8:PATTERN[2]-16,M$(2)
8000 POSITION168,8:PATTERN[2]-16,M$(3)
8010 PRINT"{DOWN}{DOWN}{DOWN}{DOWN}{RIGHT}{RIGHT}{RIGHT}{RIGHT}{RIGHT}{RIGHT}{RIGHT}{RIGHT}{RIGHT}{RIGHT}{RIGHT}{RIGHT}{RIGHT}{RIGHT}{RIGHT}{RIGHT}{RIGHT}{RIGHT}THE END."
